[Killed] BlockStatement
src/app/(auth)/layout.tsx:10:4
   children,
 }: {
   children: React.ReactNode;
-}) {
-  return (
-    <div className="min-h-screen bg-gradient-to-br from-blue-50 to-indigo-100 flex items-center justify-center p-4">
-      <div className="w-full max-w-md bg-white rounded-2xl shadow-xl p-8">
-        {children}
-      </div>
-    </div>
-  );
-}
+}) {}
 
killedBy: AuthLayout rendering should render children
statusReason: Unable to find an element by: [data-testid="child"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
