[Killed] ConditionalExpression
(app)/chat/success/page.tsx:22:9
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    if (!reportId) {
+    if (true) {
       router.push('/chat');
       return;
killedBy: PaymentSuccessPage polling behavior should poll for report status
statusReason: expected "spy" to be called with arguments: [ '/api/reports/test-report-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:22:9
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    if (!reportId) {
+    if (false) {
       router.push('/chat');
       return;
killedBy: PaymentSuccessPage redirect without reportId should redirect to chat if no reportId
statusReason: expected "spy" to be called with arguments: [ '/chat' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
(app)/chat/success/page.tsx:29:11
 
     // Poll for report status every 2 seconds
     const pollInterval = setInterval(async () => {
-      try {
-        const response = await api.get<Report>(`/api/reports/${reportId}`);
-
-        if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to fetch report');
-          clearInterval(pollInterval);
-          return;
-        }
-
-        const report = response.data;
-        setStatus(report.status);
-
-        if (report.status === 'completed') {
-          clearInterval(pollInterval);
-          // Redirect to report view
-          router.push(`/report/${reportId}`);
-        } else if (report.status === 'failed') {
-          clearInterval(pollInterval);
-          setError('Report generation failed');
-        }
-      } catch (err) {
+      try {} catch (err) {
         console.error('Polling error:', err);
         setError('Failed to check report status');
killedBy: PaymentSuccessPage polling behavior should poll for report status
statusReason: expected "spy" to be called with arguments: [ '/api/reports/test-report-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:32:13
       try {
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
-        if (response.error || !response.data) {
+        if (true) {
           setError(response.error?.message || 'Failed to fetch report');
           clearInterval(pollInterval);
killedBy: PaymentSuccessPage polling behavior should redirect to report when completed
statusReason: expected "spy" to be called with arguments: [ '/report/completed-report' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:32:13
       try {
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
-        if (response.error || !response.data) {
+        if (false) {
           setError(response.error?.message || 'Failed to fetch report');
           clearInterval(pollInterval);
killedBy: PaymentSuccessPage error handling should display error when API returns error
statusReason: Unable to find an element with the text: API Error. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:33:20
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
         if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to fetch report');
+          setError(false);
           clearInterval(pollInterval);
           return;
killedBy: PaymentSuccessPage error handling should display error when API returns error
statusReason: Unable to find an element with the text: API Error. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:33:20
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
         if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to fetch report');
+          setError(true);
           clearInterval(pollInterval);
           return;
killedBy: PaymentSuccessPage error handling should display error when API returns error
statusReason: Unable to find an element with the text: API Error. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[Killed] BlockStatement
(app)/chat/success/page.tsx:41:44
         const report = response.data;
         setStatus(report.status);
 
-        if (report.status === 'completed') {
-          clearInterval(pollInterval);
-          // Redirect to report view
-          router.push(`/report/${reportId}`);
-        } else if (report.status === 'failed') {
+        if (report.status === 'completed') {} else if (report.status === 'failed') {
           clearInterval(pollInterval);
           setError('Report generation failed');
killedBy: PaymentSuccessPage polling behavior should redirect to report when completed
statusReason: expected "spy" to be called with arguments: [ '/report/completed-report' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:41:13
         const report = response.data;
         setStatus(report.status);
 
-        if (report.status === 'completed') {
+        if (true) {
           clearInterval(pollInterval);
           // Redirect to report view
killedBy: PaymentSuccessPage error handling should display error when report generation fails
statusReason: Unable to find an element with the text: Report generation failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[Killed] StringLiteral
(app)/chat/success/page.tsx:44:23
         if (report.status === 'completed') {
           clearInterval(pollInterval);
           // Redirect to report view
-          router.push(`/report/${reportId}`);
+          router.push(``);
         } else if (report.status === 'failed') {
           clearInterval(pollInterval);
killedBy: PaymentSuccessPage polling behavior should redirect to report when completed
statusReason: expected "spy" to be called with arguments: [ '/report/completed-report' ]

Received: 

  1st spy call:

  Array [
-   "/report/completed-report",

[Killed] BlockStatement
(app)/chat/success/page.tsx:45:48
           clearInterval(pollInterval);
           // Redirect to report view
           router.push(`/report/${reportId}`);
-        } else if (report.status === 'failed') {
-          clearInterval(pollInterval);
-          setError('Report generation failed');
-        }
+        } else if (report.status === 'failed') {}
       } catch (err) {
         console.error('Polling error:', err);
killedBy: PaymentSuccessPage error handling should display error when report generation fails
statusReason: Unable to find an element with the text: Report generation failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/chat/success/page.tsx:45:20
           clearInterval(pollInterval);
           // Redirect to report view
           router.push(`/report/${reportId}`);
-        } else if (report.status === 'failed') {
+        } else if (true) {
           clearInterval(pollInterval);
           setError('Report generation failed');
killedBy: PaymentSuccessPage polling behavior should update status to processing
statusReason: Unable to find an element with the text: processing. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-2xl mx-auto text-center py-12"
    >

[NoCoverage] BlockStatement
(app)/chat/success/page.tsx:49:21
           clearInterval(pollInterval);
           setError('Report generation failed');
         }
-      } catch (err) {
-        console.error('Polling error:', err);
-        setError('Failed to check report status');
-        clearInterval(pollInterval);
-      }
+      } catch (err) {}
     }, 2000);
 

[NoCoverage] StringLiteral
(app)/chat/success/page.tsx:50:23
           setError('Report generation failed');
         }
       } catch (err) {
-        console.error('Polling error:', err);
+        console.error("", err);
         setError('Failed to check report status');
         clearInterval(pollInterval);

[NoCoverage] StringLiteral
(app)/chat/success/page.tsx:51:18
         }
       } catch (err) {
         console.error('Polling error:', err);
-        setError('Failed to check report status');
+        setError("");
         clearInterval(pollInterval);
       }

[Survived] ArrowFunction
(app)/chat/success/page.tsx:56:12
       }
     }, 2000);
 
-    return () => clearInterval(pollInterval);
+    return () => undefined;
   }, [reportId, router]);
 

[Survived] ArrowFunction
(app)/chat/success/page.tsx:85:22
         <div className="p-4 bg-red-50 border border-red-200 rounded-lg">
           <p className="text-sm text-red-600">{error}</p>
           <button
-            onClick={() => router.push('/chat')}
+            onClick={() => undefined}
             className="mt-4 text-sm text-blue-600 hover:text-blue-700"
           >

[Survived] StringLiteral
(app)/chat/success/page.tsx:94:103
       ) : (
         <div className="space-y-4">
           <div className="flex items-center justify-center gap-2">
-            <div className="w-2 h-2 bg-blue-600 rounded-full animate-bounce" style={{ animationDelay: '0ms' }} />
+            <div className="w-2 h-2 bg-blue-600 rounded-full animate-bounce" style={{ animationDelay: "" }} />
             <div className="w-2 h-2 bg-blue-600 rounded-full animate-bounce" style={{ animationDelay: '150ms' }} />
             <div className="w-2 h-2 bg-blue-600 rounded-full animate-bounce" style={{ animationDelay: '300ms' }} />
