[Killed] BlockStatement
(auth)/login/[[...rest]]/page.tsx:8:37
 
 import { SignIn } from '@clerk/nextjs';
 
-export default function LoginPage() {
-  return (
-    <div className="flex min-h-screen items-center justify-center bg-gray-50">
-      <SignIn
-        appearance={{
-          elements: {
-            rootBox: 'mx-auto',
-            card: 'shadow-lg',
-          },
-        }}
-        routing="path"
-        path="/login"
-        signUpUrl="/signup"
-        afterSignInUrl="/chat"
-      />
-    </div>
-  );
-}
+export default function LoginPage() {}
 
killedBy: LoginPage rendering should render SignIn component
statusReason: Unable to find an element by: [data-testid="clerk-sign-in"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
(auth)/login/[[...rest]]/page.tsx:12:21
   return (
     <div className="flex min-h-screen items-center justify-center bg-gray-50">
       <SignIn
-        appearance={{
-          elements: {
-            rootBox: 'mx-auto',
-            card: 'shadow-lg',
-          },
-        }}
+        appearance={{}}
         routing="path"
         path="/login"
killedBy: LoginPage appearance configuration should configure appearance with rootBox class
statusReason: Cannot read properties of undefined (reading 'rootBox')
