[Killed] BlockStatement
(auth)/signup/[[...rest]]/page.tsx:8:38
 
 import { SignUp } from '@clerk/nextjs';
 
-export default function SignupPage() {
-  return (
-    <div className="flex min-h-screen items-center justify-center bg-gray-50">
-      <SignUp
-        appearance={{
-          elements: {
-            rootBox: 'mx-auto',
-            card: 'shadow-lg',
-          },
-        }}
-        routing="path"
-        path="/signup"
-        signInUrl="/login"
-        afterSignUpUrl="/chat"
-      />
-    </div>
-  );
-}
+export default function SignupPage() {}
 
killedBy: SignupPage rendering should render SignUp component
statusReason: Unable to find an element by: [data-testid="clerk-sign-up"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
(auth)/signup/[[...rest]]/page.tsx:12:21
   return (
     <div className="flex min-h-screen items-center justify-center bg-gray-50">
       <SignUp
-        appearance={{
-          elements: {
-            rootBox: 'mx-auto',
-            card: 'shadow-lg',
-          },
-        }}
+        appearance={{}}
         routing="path"
         path="/signup"
killedBy: SignupPage appearance configuration should configure appearance with rootBox class
statusReason: Cannot read properties of undefined (reading 'rootBox')
