[NoCoverage] ConditionalExpression
src/app/(app)/layout.tsx:19:7
   const { userId } = await auth();
 
   // Redirect to login if not authenticated
-  if (!userId) {
+  if (true) {
     redirect('/login');
   }

[NoCoverage] BlockStatement
src/app/(app)/layout.tsx:19:16
   const { userId } = await auth();
 
   // Redirect to login if not authenticated
-  if (!userId) {
-    redirect('/login');
-  }
+  if (!userId) {}
 
   return (
