[Survived] BooleanLiteral
(app)/report/[id]/page.tsx:21:46
   const reportId = params.id as string;
 
   const [report, setReport] = useState<Report | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
 

[Killed] BlockStatement
(app)/report/[id]/page.tsx:24:19
   const [isLoading, setIsLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
 
-  useEffect(() => {
-    const fetchReport = async () => {
-      try {
-        setIsLoading(true);
-        const response = await api.get<Report>(`/api/reports/${reportId}`);
-
-        if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
-          return;
-        }
-
-        setReport(response.data);
-      } catch (err) {
-        setError('Failed to load report');
-      } finally {
-        setIsLoading(false);
-      }
-    };
-
-    fetchReport();
-  }, [reportId]);
+  useEffect(() => {}, [reportId]);
 
   if (isLoading) {
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BlockStatement
(app)/report/[id]/page.tsx:25:37
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    const fetchReport = async () => {
-      try {
-        setIsLoading(true);
-        const response = await api.get<Report>(`/api/reports/${reportId}`);
-
-        if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
-          return;
-        }
-
-        setReport(response.data);
-      } catch (err) {
-        setError('Failed to load report');
-      } finally {
-        setIsLoading(false);
-      }
-    };
+    const fetchReport = async () => {};
 
     fetchReport();
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BlockStatement
(app)/report/[id]/page.tsx:26:11
 
   useEffect(() => {
     const fetchReport = async () => {
-      try {
-        setIsLoading(true);
-        const response = await api.get<Report>(`/api/reports/${reportId}`);
-
-        if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
-          return;
-        }
-
-        setReport(response.data);
-      } catch (err) {
+      try {} catch (err) {
         setError('Failed to load report');
       } finally {
killedBy: ReportDetailPage loading state should show loading spinner initially
statusReason: Unable to find an element with the text: Loading report.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BooleanLiteral
(app)/report/[id]/page.tsx:27:22
   useEffect(() => {
     const fetchReport = async () => {
       try {
-        setIsLoading(true);
+        setIsLoading(false);
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
killedBy: ReportDetailPage loading state should show loading spinner initially
statusReason: Unable to find an element with the text: Loading report.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BlockStatement
(app)/report/[id]/page.tsx:30:47
         setIsLoading(true);
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
-        if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
-          return;
-        }
+        if (response.error || !response.data) {}
 
         setReport(response.data);
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:31:20
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
         if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
+          setError(true);
           return;
         }
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:31:20
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
         if (response.error || !response.data) {
-          setError(response.error?.message || 'Failed to load report');
+          setError(false);
           return;
         }
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[NoCoverage] BlockStatement
(app)/report/[id]/page.tsx:36:21
         }
 
         setReport(response.data);
-      } catch (err) {
-        setError('Failed to load report');
-      } finally {
+      } catch (err) {} finally {
         setIsLoading(false);
       }

[Killed] BlockStatement
(app)/report/[id]/page.tsx:38:17
         setReport(response.data);
       } catch (err) {
         setError('Failed to load report');
-      } finally {
-        setIsLoading(false);
-      }
+      } finally {}
     };
 
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BooleanLiteral
(app)/report/[id]/page.tsx:39:22
       } catch (err) {
         setError('Failed to load report');
       } finally {
-        setIsLoading(false);
+        setIsLoading(true);
       }
     };
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BooleanLiteral
(app)/report/[id]/page.tsx:55:16
     );
   }
 
-  if (error || !report) {
+  if (error || report) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage generating state should show generating message for pending status
statusReason: Unable to find an element with the text: Generating Your Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:55:7
     );
   }
 
-  if (error || !report) {
+  if (true) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage generating state should show generating message for pending status
statusReason: Unable to find an element with the text: Generating Your Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:59:45
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
         <div className="p-6 bg-red-50 border border-red-200 rounded-lg">
-          <p className="text-red-600 mb-4">{error || 'Report not found'}</p>
+          <p className="text-red-600 mb-4">{false}</p>
           <button
             onClick={() => router.push('/chat')}
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] LogicalOperator
(app)/report/[id]/page.tsx:59:45
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
         <div className="p-6 bg-red-50 border border-red-200 rounded-lg">
-          <p className="text-red-600 mb-4">{error || 'Report not found'}</p>
+          <p className="text-red-600 mb-4">{error && 'Report not found'}</p>
           <button
             onClick={() => router.push('/chat')}
killedBy: ReportDetailPage error state should show error when API returns error
statusReason: Unable to find an element with the text: Not found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] LogicalOperator
(app)/report/[id]/page.tsx:72:7
   }
 
   // Show progress indicator for generating/pending states
-  if (report.status === 'generating' || report.status === 'pending') {
+  if (report.status === 'generating' && report.status === 'pending') {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage generating state should show generating message for pending status
statusReason: Unable to find an element with the text: Generating Your Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] EqualityOperator
(app)/report/[id]/page.tsx:72:41
   }
 
   // Show progress indicator for generating/pending states
-  if (report.status === 'generating' || report.status === 'pending') {
+  if (report.status === 'generating' || report.status !== 'pending') {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage generating state should show generating message for pending status
statusReason: Unable to find an element with the text: Generating Your Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Survived] StringLiteral
(app)/report/[id]/page.tsx:85:14
           </p>
           <p className="text-sm text-gray-500">
             Status:
-            {' '}
+            {""}
             <span className="font-medium capitalize">{report.status}</span>
           </p>

[Killed] EqualityOperator
(app)/report/[id]/page.tsx:94:7
   }
 
   // Show error state
-  if (report.status === 'failed') {
+  if (report.status !== 'failed') {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage failed state should show failure message
statusReason: Unable to find an element with the text: Report Generation Failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:94:7
   }
 
   // Show error state
-  if (report.status === 'failed') {
+  if (true) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage expired state should show expired message
statusReason: Unable to find an element with the text: Report Expired. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[NoCoverage] StringLiteral
(app)/report/[id]/page.tsx:103:40
           </h2>
           <p className="text-red-600 mb-4">An error occurred during generation</p>
           <button
-            onClick={() => router.push('/chat')}
+            onClick={() => router.push("")}
             className="px-4 py-2 bg-blue-600 text-white rounded-lg hover:bg-blue-700"
           >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:114:7
   }
 
   // Show expired state
-  if (report.status === 'expired') {
+  if (false) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage expired state should show expired message
statusReason: Unable to find an element with the text: Report Expired. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:114:7
   }
 
   // Show expired state
-  if (report.status === 'expired') {
+  if (true) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage completed state should render ExecutiveSummary
statusReason: Unable to find an element by: [data-testid="executive-summary"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] BooleanLiteral
(app)/report/[id]/page.tsx:136:7
   }
 
   // Show completed report
-  if (!report.content) {
+  if (report.content) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage completed state should render ExecutiveSummary
statusReason: Unable to find an element by: [data-testid="executive-summary"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[Killed] ConditionalExpression
(app)/report/[id]/page.tsx:136:7
   }
 
   // Show completed report
-  if (!report.content) {
+  if (true) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
killedBy: ReportDetailPage completed state should render ExecutiveSummary
statusReason: Unable to find an element by: [data-testid="executive-summary"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto text-center py-12"
    >

[NoCoverage] StringLiteral
(app)/report/[id]/page.tsx:160:83
         <div className="text-sm text-gray-500">
           Expires:
           {' '}
-          {report.expires_at ? new Date(report.expires_at).toLocaleDateString() : 'N/A'}
+          {report.expires_at ? new Date(report.expires_at).toLocaleDateString() : ""}
         </div>
       </div>

[Killed] ArrowFunction
(app)/report/[id]/page.tsx:172:38
       />
 
       <div className="space-y-8">
-        {report.content.sections.map((section, index) => (
-          <ReportSection key={index} section={section} index={index + 1} />
-        ))}
+        {report.content.sections.map(() => undefined)}
       </div>
 
killedBy: ReportDetailPage completed state should render report sections
statusReason: Unable to find an element by: [data-testid="section-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto"
    >

[Killed] ArithmeticOperator
(app)/report/[id]/page.tsx:173:63
 
       <div className="space-y-8">
         {report.content.sections.map((section, index) => (
-          <ReportSection key={index} section={section} index={index + 1} />
+          <ReportSection key={index} section={section} index={index - 1} />
         ))}
       </div>
killedBy: ReportDetailPage completed state should render report sections
statusReason: Unable to find an element by: [data-testid="section-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-4xl mx-auto"
    >

[Survived] StringLiteral
(app)/report/[id]/page.tsx:180:12
       <div className="mt-12 border-t border-gray-200 pt-6 text-center">
         <p className="text-sm text-gray-500">
           Report generated by AI •
-          {' '}
+          {""}
           {report.content.total_citations}
           {' '}
