[Killed] BooleanLiteral
src/components/dev/environment-badge.tsx:14:48
 
 export function EnvironmentBadge() {
   const { flags, environmentMode, isLoading } = useFeatureFlags();
-  const [isExpanded, setIsExpanded] = useState(false);
+  const [isExpanded, setIsExpanded] = useState(true);
 
   // Only show in non-production environments
killedBy: EnvironmentBadge collapsed state should show collapsed badge by default
statusReason: Unable to find an accessible element with the role "button" and name `/expand environment info/i`

Here are the accessible roles:

  button:

  Name "Collapse environment info":
  <button

[Killed] ConditionalExpression
src/components/dev/environment-badge.tsx:17:7
   const [isExpanded, setIsExpanded] = useState(false);
 
   // Only show in non-production environments
-  if (environmentMode === 'production' || isLoading) {
+  if (false) {
     return null;
   }
killedBy: EnvironmentBadge visibility should return null in production environment
statusReason: expected <div …(1)>…(1)</div> to be null

[Killed] ConditionalExpression
src/components/dev/environment-badge.tsx:17:7
   const [isExpanded, setIsExpanded] = useState(false);
 
   // Only show in non-production environments
-  if (environmentMode === 'production' || isLoading) {
+  if (false || isLoading) {
     return null;
   }
killedBy: EnvironmentBadge visibility should return null in production environment
statusReason: expected <div …(1)>…(1)</div> to be null

[Killed] ObjectLiteral
src/components/dev/environment-badge.tsx:21:21
     return null;
   }
 
-  const envColors = {
-    development: 'bg-green-600',
-    test: 'bg-yellow-600',
-    production: 'bg-red-600',
-  };
+  const envColors = {};
 
   const badgeColor = envColors[environmentMode];
killedBy: EnvironmentBadge collapsed state should have green color for development
statusReason: expect(element).toHaveClass("bg-green-600")

Expected the element to have class:
  bg-green-600
Received:
  undefined rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105

[Killed] StringLiteral
src/components/dev/environment-badge.tsx:22:18
   }
 
   const envColors = {
-    development: 'bg-green-600',
+    development: "",
     test: 'bg-yellow-600',
     production: 'bg-red-600',
killedBy: EnvironmentBadge collapsed state should have green color for development
statusReason: expect(element).toHaveClass("bg-green-600")

Expected the element to have class:
  bg-green-600
Received:
  rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105

[Killed] StringLiteral
src/components/dev/environment-badge.tsx:23:11
 
   const envColors = {
     development: 'bg-green-600',
-    test: 'bg-yellow-600',
+    test: "",
     production: 'bg-red-600',
   };
killedBy: EnvironmentBadge collapsed state should have yellow color for test
statusReason: expect(element).toHaveClass("bg-yellow-600")

Expected the element to have class:
  bg-yellow-600
Received:
  rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105

[Killed] BooleanLiteral
src/components/dev/environment-badge.tsx:32:8
   return (
     <div className="fixed bottom-4 right-4 z-50">
       {/* Collapsed Badge */}
-      {!isExpanded && (
+      {isExpanded && (
         <button
           onClick={() => setIsExpanded(true)}
killedBy: EnvironmentBadge visibility should render in development environment
statusReason: Unable to find an element with the text: DEVELOPMENT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    />

[Killed] ConditionalExpression
src/components/dev/environment-badge.tsx:32:8
   return (
     <div className="fixed bottom-4 right-4 z-50">
       {/* Collapsed Badge */}
-      {!isExpanded && (
-        <button
-          onClick={() => setIsExpanded(true)}
-          className={`${badgeColor} rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105`}
-          aria-label="Expand environment info"
-        >
-          {environmentMode.toUpperCase()}
-        </button>
-      )}
+      {false}
 
       {/* Expanded Panel */}
killedBy: EnvironmentBadge visibility should render in development environment
statusReason: Unable to find an element with the text: DEVELOPMENT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    />

[Killed] BooleanLiteral
src/components/dev/environment-badge.tsx:34:40
       {/* Collapsed Badge */}
       {!isExpanded && (
         <button
-          onClick={() => setIsExpanded(true)}
+          onClick={() => setIsExpanded(false)}
           className={`${badgeColor} rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105`}
           aria-label="Expand environment info"
killedBy: EnvironmentBadge expand/collapse interaction should expand when clicked
statusReason: Unable to find an element with the text: Feature Flags. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Killed] ArrowFunction
src/components/dev/environment-badge.tsx:34:20
       {/* Collapsed Badge */}
       {!isExpanded && (
         <button
-          onClick={() => setIsExpanded(true)}
+          onClick={() => undefined}
           className={`${badgeColor} rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105`}
           aria-label="Expand environment info"
killedBy: EnvironmentBadge expand/collapse interaction should expand when clicked
statusReason: Unable to find an element with the text: Feature Flags. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Killed] MethodExpression
src/components/dev/environment-badge.tsx:38:12
           className={`${badgeColor} rounded-lg px-4 py-2 text-xs font-semibold text-white shadow-lg transition-all hover:scale-105`}
           aria-label="Expand environment info"
         >
-          {environmentMode.toUpperCase()}
+          {environmentMode.toLowerCase()}
         </button>
       )}
killedBy: EnvironmentBadge visibility should render in development environment
statusReason: Unable to find an element with the text: DEVELOPMENT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Survived] MethodExpression
src/components/dev/environment-badge.tsx:47:16
         <div className="rounded-lg bg-white p-4 shadow-xl ring-1 ring-black ring-opacity-5">
           <div className="flex items-center justify-between gap-3 mb-3">
             <div className={`${badgeColor} rounded px-3 py-1 text-xs font-semibold text-white`}>
-              {environmentMode.toUpperCase()}
+              {environmentMode.toLowerCase()}
             </div>
             <button

[Killed] ArrowFunction
src/components/dev/environment-badge.tsx:50:24
               {environmentMode.toUpperCase()}
             </div>
             <button
-              onClick={() => setIsExpanded(false)}
+              onClick={() => undefined}
               className="text-gray-400 hover:text-gray-600"
               aria-label="Collapse environment info"
killedBy: EnvironmentBadge expand/collapse interaction should collapse when close button clicked
statusReason: Unable to find an accessible element with the role "button" and name `/expand environment info/i`

Here are the accessible roles:

  button:

  Name "Collapse environment info":
  <button

[Killed] BooleanLiteral
src/components/dev/environment-badge.tsx:50:44
               {environmentMode.toUpperCase()}
             </div>
             <button
-              onClick={() => setIsExpanded(false)}
+              onClick={() => setIsExpanded(true)}
               className="text-gray-400 hover:text-gray-600"
               aria-label="Collapse environment info"
killedBy: EnvironmentBadge expand/collapse interaction should collapse when close button clicked
statusReason: Unable to find an accessible element with the role "button" and name `/expand environment info/i`

Here are the accessible roles:

  button:

  Name "Collapse environment info":
  <button

[Killed] ArrowFunction
src/components/dev/environment-badge.tsx:73:42
           <div className="space-y-2">
             <h3 className="text-xs font-semibold text-gray-900">Feature Flags</h3>
             <div className="space-y-1">
-              {Object.entries(flags).map(([key, value]) => (
-                <div key={key} className="flex items-center justify-between text-xs">
-                  <span className="text-gray-600">{key}</span>
-                  <span
-                    className={`rounded px-2 py-0.5 font-medium ${
-                      value
-                        ? 'bg-green-100 text-green-700'
-                        : 'bg-gray-100 text-gray-600'
-                    }`}
-                  >
-                    {value ? 'ON' : 'OFF'}
-                  </span>
-                </div>
-              ))}
+              {Object.entries(flags).map(() => undefined)}
             </div>
           </div>
killedBy: EnvironmentBadge expanded panel content should display feature flag status as ON/OFF
statusReason: Unable to find an element with the text: ON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Survived] StringLiteral
src/components/dev/environment-badge.tsx:79:27
                   <span
                     className={`rounded px-2 py-0.5 font-medium ${
                       value
-                        ? 'bg-green-100 text-green-700'
+                        ? ""
                         : 'bg-gray-100 text-gray-600'
                     }`}

[Survived] StringLiteral
src/components/dev/environment-badge.tsx:80:27
                     className={`rounded px-2 py-0.5 font-medium ${
                       value
                         ? 'bg-green-100 text-green-700'
-                        : 'bg-gray-100 text-gray-600'
+                        : ""
                     }`}
                   >

[Killed] StringLiteral
src/components/dev/environment-badge.tsx:95:44
               <div className="flex justify-between">
                 <span>Database:</span>
                 <span className="font-medium">
-                  {flags.ENABLE_SUPABASE ? 'Supabase' : 'Mock'}
+                  {flags.ENABLE_SUPABASE ? "" : 'Mock'}
                 </span>
               </div>
killedBy: EnvironmentBadge expanded panel content should display database status
statusReason: Unable to find an element with the text: Supabase. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Killed] ConditionalExpression
src/components/dev/environment-badge.tsx:107:12
             </div>
           </div>
 
-          {environmentMode === 'development' && (
-            <div className="mt-3 rounded bg-blue-50 p-2 text-xs text-blue-800">
-              <strong>Dev Mode:</strong>
-              {' '}
-              All features are mocked for easy testing
-            </div>
-          )}
+          {false}
 
           {environmentMode === 'test' && (
killedBy: EnvironmentBadge environment-specific messages should show Dev Mode message in development
statusReason: Unable to find an element with the text: Dev Mode:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Killed] EqualityOperator
src/components/dev/environment-badge.tsx:107:12
             </div>
           </div>
 
-          {environmentMode === 'development' && (
+          {environmentMode !== 'development' && (
             <div className="mt-3 rounded bg-blue-50 p-2 text-xs text-blue-800">
               <strong>Dev Mode:</strong>
killedBy: EnvironmentBadge environment-specific messages should show Dev Mode message in development
statusReason: Unable to find an element with the text: Dev Mode:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Survived] StringLiteral
src/components/dev/environment-badge.tsx:110:16
           {environmentMode === 'development' && (
             <div className="mt-3 rounded bg-blue-50 p-2 text-xs text-blue-800">
               <strong>Dev Mode:</strong>
-              {' '}
+              {""}
               All features are mocked for easy testing
             </div>

[Killed] ConditionalExpression
src/components/dev/environment-badge.tsx:115:12
             </div>
           )}
 
-          {environmentMode === 'test' && (
-            <div className="mt-3 rounded bg-yellow-50 p-2 text-xs text-yellow-800">
-              <strong>Test Mode:</strong>
-              {' '}
-              Using test database and payment bypass
-            </div>
-          )}
+          {true}
         </div>
       )}
killedBy: EnvironmentBadge environment-specific messages should show Test Mode message in test environment
statusReason: Unable to find an element with the text: Test Mode:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Killed] EqualityOperator
src/components/dev/environment-badge.tsx:115:12
             </div>
           )}
 
-          {environmentMode === 'test' && (
+          {environmentMode !== 'test' && (
             <div className="mt-3 rounded bg-yellow-50 p-2 text-xs text-yellow-800">
               <strong>Test Mode:</strong>
killedBy: EnvironmentBadge environment-specific messages should show Test Mode message in test environment
statusReason: Unable to find an element with the text: Test Mode:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed bottom-4 right-4 z-50"
    >

[Survived] StringLiteral
src/components/dev/environment-badge.tsx:118:16
           {environmentMode === 'test' && (
             <div className="mt-3 rounded bg-yellow-50 p-2 text-xs text-yellow-800">
               <strong>Test Mode:</strong>
-              {' '}
+              {""}
               Using test database and payment bypass
             </div>
