[Killed] BlockStatement
src/hooks/useAuth.ts:12:27
  * Custom authentication hook
  * Wraps Clerk's useUser hook with consistent interface
  */
-export function useAuth() {
-  const { user, isLoaded, isSignedIn } = useUser();
-
-  return {
-    user,
-    isLoading: !isLoaded,
-    isAuthenticated: isSignedIn || false,
-    userId: user?.id,
-  };
-}
+export function useAuth() {}
 
killedBy: useAuth hook should return loading state initially
statusReason: Cannot read properties of undefined (reading 'isLoading')

[Killed] BooleanLiteral
src/hooks/useAuth.ts:17:16
 
   return {
     user,
-    isLoading: !isLoaded,
+    isLoading: isLoaded,
     isAuthenticated: isSignedIn || false,
     userId: user?.id,
killedBy: useAuth hook should return loading state initially
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useAuth.ts:18:36
   return {
     user,
     isLoading: !isLoaded,
-    isAuthenticated: isSignedIn || false,
+    isAuthenticated: isSignedIn || true,
     userId: user?.id,
   };
killedBy: useAuth hook should return loading state initially
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/useAuth.ts:18:22
   return {
     user,
     isLoading: !isLoaded,
-    isAuthenticated: isSignedIn || false,
+    isAuthenticated: false,
     userId: user?.id,
   };
killedBy: useAuth hook should return authenticated state when user signed in
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/hooks/useAuth.ts:19:13
     user,
     isLoading: !isLoaded,
     isAuthenticated: isSignedIn || false,
-    userId: user?.id,
+    userId: user.id,
   };
 }
killedBy: useAuth hook should return loading state initially
statusReason: Cannot read properties of null (reading 'id')
