[NoCoverage] BlockStatement
src/app/layout.tsx:31:5
 
 // Initialize configuration and logging
 // This runs on the server during build/request time
-try {
-  initializeConfig();
-  initializeLogger();
-  validateEnvironment();
-  runStartupChecks();
-} catch (error) {
+try {} catch (error) {
   console.error('[Layout] Initialization failed:', error);
   // Re-throw to prevent app from running with invalid config

[NoCoverage] BlockStatement
src/app/layout.tsx:36:17
   initializeLogger();
   validateEnvironment();
   runStartupChecks();
-} catch (error) {
-  console.error('[Layout] Initialization failed:', error);
-  // Re-throw to prevent app from running with invalid config
-  throw error;
-}
+} catch (error) {}
 
 export const metadata: Metadata = {

[NoCoverage] StringLiteral
src/app/layout.tsx:37:17
   validateEnvironment();
   runStartupChecks();
 } catch (error) {
-  console.error('[Layout] Initialization failed:', error);
+  console.error("", error);
   // Re-throw to prevent app from running with invalid config
   throw error;
