[Survived] ConditionalExpression
src/lib/api-client.ts:41:18
 ): Promise<ApiResponse<T>> {
   const config = getConfig();
   const url = `${config.apiUrl}${endpoint}`;
-  const method = options.method || 'GET';
+  const method = true;
 
   // Generate or use provided correlation ID

[Survived] LogicalOperator
src/lib/api-client.ts:41:18
 ): Promise<ApiResponse<T>> {
   const config = getConfig();
   const url = `${config.apiUrl}${endpoint}`;
-  const method = options.method || 'GET';
+  const method = options.method && 'GET';
 
   // Generate or use provided correlation ID

[Killed] ConditionalExpression
src/lib/api-client.ts:44:25
   const method = options.method || 'GET';
 
   // Generate or use provided correlation ID
-  const correlationId = options.correlationId || generateCorrelationId();
+  const correlationId = false;
 
   // Start timing
killedBy: api-client fetchApi Successful requests should include correlation ID in request headers
statusReason: expected false to be 'test-correlation-123' // Object.is equality

[Killed] LogicalOperator
src/lib/api-client.ts:44:25
   const method = options.method || 'GET';
 
   // Generate or use provided correlation ID
-  const correlationId = options.correlationId || generateCorrelationId();
+  const correlationId = options.correlationId && generateCorrelationId();
 
   // Start timing
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined not to be undefined

[Survived] ArrowFunction
src/lib/api-client.ts:61:20
     // Make the request with timeout
     const controller = new AbortController();
     const timeoutId = options.timeout
-      ? setTimeout(() => controller.abort(), options.timeout)
+      ? setTimeout(() => undefined, options.timeout)
       : null;
 

[Survived] ConditionalExpression
src/lib/api-client.ts:70:9
       signal: controller.signal,
     });
 
-    if (timeoutId) {
+    if (true) {
       clearTimeout(timeoutId);
     }

[Survived] BlockStatement
src/lib/api-client.ts:70:20
       signal: controller.signal,
     });
 
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
+    if (timeoutId) {}
 
     // Calculate duration

[Survived] ArithmeticOperator
src/lib/api-client.ts:75:22
     }
 
     // Calculate duration
-    const duration = Date.now() - startTime;
+    const duration = Date.now() + startTime;
 
     // Parse response

[Killed] OptionalChaining
src/lib/api-client.ts:82:20
     let error: ApiError | undefined;
 
     const contentType = response.headers.get('content-type');
-    const isJson = contentType?.includes('application/json');
+    const isJson = contentType.includes('application/json');
 
     if (isJson) {
killedBy: api-client Edge cases should handle missing content-type header
statusReason: expected +0 to be 200 // Object.is equality

[Killed] StringLiteral
src/lib/api-client.ts:82:42
     let error: ApiError | undefined;
 
     const contentType = response.headers.get('content-type');
-    const isJson = contentType?.includes('application/json');
+    const isJson = contentType?.includes("");
 
     if (isJson) {
killedBy: api-client fetchApi Error responses should handle error without JSON response
statusReason: expected undefined to be 503 // Object.is equality

[Killed] ConditionalExpression
src/lib/api-client.ts:84:9
     const contentType = response.headers.get('content-type');
     const isJson = contentType?.includes('application/json');
 
-    if (isJson) {
+    if (false) {
       const json = await response.json();
 
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined to deeply equal { id: 1, name: 'Test' }

[Killed] BlockStatement
src/lib/api-client.ts:84:17
     const contentType = response.headers.get('content-type');
     const isJson = contentType?.includes('application/json');
 
-    if (isJson) {
-      const json = await response.json();
-
-      if (response.ok) {
-        data = json as T;
-      } else {
-        error = {
-          message: json.message || 'An error occurred',
-          code: json.code,
-          status: response.status,
-          correlationId,
-        };
-      }
-    } else if (!response.ok) {
+    if (isJson) {} else if (!response.ok) {
       error = {
         message: response.statusText || 'An error occurred',
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined to deeply equal { id: 1, name: 'Test' }

[Killed] BlockStatement
src/lib/api-client.ts:87:24
     if (isJson) {
       const json = await response.json();
 
-      if (response.ok) {
-        data = json as T;
-      } else {
+      if (response.ok) {} else {
         error = {
           message: json.message || 'An error occurred',
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined to deeply equal { id: 1, name: 'Test' }

[Killed] BlockStatement
src/lib/api-client.ts:89:14
 
       if (response.ok) {
         data = json as T;
-      } else {
-        error = {
-          message: json.message || 'An error occurred',
-          code: json.code,
-          status: response.status,
-          correlationId,
-        };
-      }
+      } else {}
     } else if (!response.ok) {
       error = {
killedBy: api-client fetchApi Error responses should handle 400 error with JSON error message
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/lib/api-client.ts:91:20
         data = json as T;
       } else {
         error = {
-          message: json.message || 'An error occurred',
+          message: true,
           code: json.code,
           status: response.status,
killedBy: api-client fetchApi Error responses should handle 400 error with JSON error message
statusReason: expected true to be 'Invalid request' // Object.is equality

[Killed] ConditionalExpression
src/lib/api-client.ts:91:20
         data = json as T;
       } else {
         error = {
-          message: json.message || 'An error occurred',
+          message: false,
           code: json.code,
           status: response.status,
killedBy: api-client fetchApi Error responses should handle 400 error with JSON error message
statusReason: expected false to be 'Invalid request' // Object.is equality

[Killed] ConditionalExpression
src/lib/api-client.ts:97:16
           correlationId,
         };
       }
-    } else if (!response.ok) {
+    } else if (false) {
       error = {
         message: response.statusText || 'An error occurred',
killedBy: api-client fetchApi Error responses should handle error without JSON response
statusReason: expected undefined to be 503 // Object.is equality

[Killed] BooleanLiteral
src/lib/api-client.ts:97:16
           correlationId,
         };
       }
-    } else if (!response.ok) {
+    } else if (response.ok) {
       error = {
         message: response.statusText || 'An error occurred',
killedBy: api-client fetchApi Error responses should handle error without JSON response
statusReason: expected undefined to be 503 // Object.is equality

[Killed] LogicalOperator
src/lib/api-client.ts:99:18
       }
     } else if (!response.ok) {
       error = {
-        message: response.statusText || 'An error occurred',
+        message: response.statusText && 'An error occurred',
         status: response.status,
         correlationId,
killedBy: api-client fetchApi Error responses should handle error without JSON response
statusReason: expected 'An error occurred' to be 'Service Unavailable' // Object.is equality

[Killed] ConditionalExpression
src/lib/api-client.ts:99:18
       }
     } else if (!response.ok) {
       error = {
-        message: response.statusText || 'An error occurred',
+        message: true,
         status: response.status,
         correlationId,
killedBy: api-client fetchApi Error responses should handle error without JSON response
statusReason: expected true to be 'Service Unavailable' // Object.is equality

[Killed] OptionalChaining
src/lib/api-client.ts:108:14
     // Log the response
     logApiResponse(method, endpoint, response.status, duration, {
       correlationId,
-      error: error?.message,
+      error: error.message,
     });
 
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined to deeply equal { id: 1, name: 'Test' }

[Survived] ArithmeticOperator
src/lib/api-client.ts:118:22
       correlationId,
     };
   } catch (err) {
-    const duration = Date.now() - startTime;
+    const duration = Date.now() + startTime;
 
     // Handle timeout

[Killed] ConditionalExpression
src/lib/api-client.ts:121:9
     const duration = Date.now() - startTime;
 
     // Handle timeout
-    if (err instanceof Error && err.name === 'AbortError') {
+    if (false) {
       const error: ApiError = {
         message: 'Request timeout',
killedBy: api-client fetchApi Timeout handling should timeout request after specified duration
statusReason: expected 'NETWORK_ERROR' to be 'TIMEOUT' // Object.is equality

[Killed] EqualityOperator
src/lib/api-client.ts:121:33
     const duration = Date.now() - startTime;
 
     // Handle timeout
-    if (err instanceof Error && err.name === 'AbortError') {
+    if (err instanceof Error && err.name !== 'AbortError') {
       const error: ApiError = {
         message: 'Request timeout',
killedBy: api-client fetchApi Timeout handling should timeout request after specified duration
statusReason: expected 'NETWORK_ERROR' to be 'TIMEOUT' // Object.is equality

[Survived] ObjectLiteral
src/lib/api-client.ts:128:42
         correlationId,
       };
 
-      logApiError(method, endpoint, err, { correlationId, duration });
+      logApiError(method, endpoint, err, {});
 
       return {

[Killed] ObjectLiteral
src/lib/api-client.ts:157:20
 /**
  * Convenience methods for common HTTP verbs
  */
-export const api = {
-  get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'GET' }),
-
-  post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'POST',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
-
-  put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PUT',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
-
-  patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PATCH',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
-
-  delete: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'DELETE' }),
-};
+export const api = {};
 
 /**
killedBy: api-client api convenience methods api.get should make GET request
statusReason: api.get is not a function

[Killed] ArrowFunction
src/lib/api-client.ts:158:8
  * Convenience methods for common HTTP verbs
  */
 export const api = {
-  get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'GET' }),
+  get: () => undefined,
 
   post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.get should make GET request
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
src/lib/api-client.ts:158:89
  * Convenience methods for common HTTP verbs
  */
 export const api = {
-  get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'GET' }),
+  get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, {}),
 
   post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.get should make GET request
statusReason: expected undefined to be 'GET' // Object.is equality

[Killed] ArrowFunction
src/lib/api-client.ts:160:9
 export const api = {
   get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'GET' }),
 
-  post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'POST',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  post: () => undefined,
 
   put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.post should make POST request with body
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
src/lib/api-client.ts:160:106
 export const api = {
   get: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'GET' }),
 
-  post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'POST',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  post: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {}),
 
   put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.post should make POST request with body
statusReason: expected undefined to be 'POST' // Object.is equality

[Killed] ArrowFunction
src/lib/api-client.ts:166:8
     body: body ? JSON.stringify(body) : undefined,
   }),
 
-  put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PUT',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  put: () => undefined,
 
   patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.put should make PUT request with body
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
src/lib/api-client.ts:166:105
     body: body ? JSON.stringify(body) : undefined,
   }),
 
-  put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PUT',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {}),
 
   patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
killedBy: api-client api convenience methods api.put should make PUT request with body
statusReason: expected undefined to be 'PUT' // Object.is equality

[Killed] StringLiteral
src/lib/api-client.ts:168:13
 
   put: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
     ...options,
-    method: 'PUT',
+    method: "",
     body: body ? JSON.stringify(body) : undefined,
   }),
killedBy: api-client api convenience methods api.put should make PUT request with body
statusReason: expected '' to be 'PUT' // Object.is equality

[Killed] ArrowFunction
src/lib/api-client.ts:172:10
     body: body ? JSON.stringify(body) : undefined,
   }),
 
-  patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PATCH',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  patch: () => undefined,
 
   delete: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'DELETE' }),
killedBy: api-client api convenience methods api.patch should make PATCH request with body
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
src/lib/api-client.ts:172:107
     body: body ? JSON.stringify(body) : undefined,
   }),
 
-  patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {
-    ...options,
-    method: 'PATCH',
-    body: body ? JSON.stringify(body) : undefined,
-  }),
+  patch: <T = unknown>(endpoint: string, body?: unknown, options?: FetchOptions) => fetchApi<T>(endpoint, {}),
 
   delete: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'DELETE' }),
killedBy: api-client api convenience methods api.patch should make PATCH request with body
statusReason: expected undefined to be 'PATCH' // Object.is equality

[Killed] ArrowFunction
src/lib/api-client.ts:178:11
     body: body ? JSON.stringify(body) : undefined,
   }),
 
-  delete: <T = unknown>(endpoint: string, options?: FetchOptions) => fetchApi<T>(endpoint, { ...options, method: 'DELETE' }),
+  delete: () => undefined,
 };
 
killedBy: api-client api convenience methods api.delete should make DELETE request
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BlockStatement
src/lib/api-client.ts:184:32
 /**
  * Get API configuration
  */
-export function getApiConfig() {
-  const config = getConfig();
-  return {
-    apiUrl: config.apiUrl,
-    timeout: 30000, // 30 seconds default
-  };
-}
+export function getApiConfig() {}
 
 /**
killedBy: api-client getApiConfig should return API configuration
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
src/lib/api-client.ts:195:42
 /**
  * Generate a correlation ID
  */
-function generateCorrelationId(): string {
-  return `${Date.now()}-${Math.random().toString(36).substring(2, 11)}`;
-}
+function generateCorrelationId(): string {}
 
 /**
killedBy: api-client fetchApi Successful requests should make GET request and return JSON data
statusReason: expected undefined not to be undefined

[Survived] MethodExpression
src/lib/api-client.ts:196:27
  * Generate a correlation ID
  */
 function generateCorrelationId(): string {
-  return `${Date.now()}-${Math.random().toString(36).substring(2, 11)}`;
+  return `${Date.now()}-${Math.random().toString(36)}`;
 }
 

[NoCoverage] BlockStatement
src/lib/api-client.ts:204:28
  */
 export async function apiWithContext<T>(
   fn: () => Promise<ApiResponse<T>>,
-): Promise<ApiResponse<T>> {
-  return fn();
-}
+): Promise<ApiResponse<T>> {}
 
