[Killed] BooleanLiteral
src/hooks/usePayment.ts:31:46
  */
 export function usePayment(options: UsePaymentOptions): UsePaymentReturn {
   const { apiEndpoint, onSuccess, onError } = options;
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const paymentsEnabled = useFeature('ENABLE_PAYMENTS');
killedBy: usePayment Initial state should return initial state with isLoading false and error null
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/hooks/usePayment.ts:33:38
   const { apiEndpoint, onSuccess, onError } = options;
   const [isLoading, setIsLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
-  const paymentsEnabled = useFeature('ENABLE_PAYMENTS');
+  const paymentsEnabled = useFeature("");
 
   const createCheckout = async (query: string) => {

[Killed] BooleanLiteral
src/hooks/usePayment.ts:36:18
   const paymentsEnabled = useFeature('ENABLE_PAYMENTS');
 
   const createCheckout = async (query: string) => {
-    setIsLoading(true);
+    setIsLoading(false);
     setError(null);
 
killedBy: usePayment Dev/Test mode (payments disabled) should set isLoading to true during request
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/usePayment.ts:40:11
     setError(null);
 
     try {
-      if (!paymentsEnabled) {
+      if (false) {
         // In dev/test mode, bypass payment and create report directly
         logInfo('Payment bypassed in dev/test mode', { query });
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "Payment bypassed in dev/test mode",

[Killed] BlockStatement
src/hooks/usePayment.ts:40:29
     setError(null);
 
     try {
-      if (!paymentsEnabled) {
-        // In dev/test mode, bypass payment and create report directly
-        logInfo('Payment bypassed in dev/test mode', { query });
-
-        const response = await api.post(apiEndpoint, { query });
-
-        if (response.error) {
-          throw new Error(response.error.message);
-        }
-
-        const reportId = response.data?.reportId || response.data?.id;
-        if (reportId) {
-          onSuccess?.(reportId);
-        } else {
-          throw new Error('No report ID returned');
-        }
-      } else {
+      if (!paymentsEnabled) {} else {
         // Production mode: create Stripe checkout
         logInfo('Creating Stripe checkout', { query });
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/hooks/usePayment.ts:46:13
 
         const response = await api.post(apiEndpoint, { query });
 
-        if (response.error) {
+        if (true) {
           throw new Error(response.error.message);
         }
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ 'report-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/hooks/usePayment.ts:46:13
 
         const response = await api.post(apiEndpoint, { query });
 
-        if (response.error) {
+        if (false) {
           throw new Error(response.error.message);
         }
killedBy: usePayment Dev/Test mode (payments disabled) should handle API error response
statusReason: expected 'No report ID returned' to be 'Invalid query' // Object.is equality

[Killed] ConditionalExpression
src/hooks/usePayment.ts:50:26
           throw new Error(response.error.message);
         }
 
-        const reportId = response.data?.reportId || response.data?.id;
+        const reportId = true;
         if (reportId) {
           onSuccess?.(reportId);
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ 'report-123' ]

Received: 

  1st spy call:

  Array [
-   "report-123",

[Killed] LogicalOperator
src/hooks/usePayment.ts:50:26
           throw new Error(response.error.message);
         }
 
-        const reportId = response.data?.reportId || response.data?.id;
+        const reportId = response.data?.reportId && response.data?.id;
         if (reportId) {
           onSuccess?.(reportId);
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ 'report-123' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/hooks/usePayment.ts:51:23
         }
 
         const reportId = response.data?.reportId || response.data?.id;
-        if (reportId) {
-          onSuccess?.(reportId);
-        } else {
+        if (reportId) {} else {
           throw new Error('No report ID returned');
         }
killedBy: usePayment Dev/Test mode (payments disabled) should bypass payment and create report directly
statusReason: expected "spy" to be called with arguments: [ 'report-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/hooks/usePayment.ts:51:13
         }
 
         const reportId = response.data?.reportId || response.data?.id;
-        if (reportId) {
+        if (true) {
           onSuccess?.(reportId);
         } else {
killedBy: usePayment Dev/Test mode (payments disabled) should handle missing report ID in response
statusReason: expected null to be 'No report ID returned' // Object.is equality

[Killed] OptionalChaining
src/hooks/usePayment.ts:52:11
 
         const reportId = response.data?.reportId || response.data?.id;
         if (reportId) {
-          onSuccess?.(reportId);
+          onSuccess(reportId);
         } else {
           throw new Error('No report ID returned');
killedBy: usePayment Callback options should work without onSuccess callback
statusReason: expected 'onSuccess is not a function' to be null

[Killed] BlockStatement
src/hooks/usePayment.ts:53:16
         const reportId = response.data?.reportId || response.data?.id;
         if (reportId) {
           onSuccess?.(reportId);
-        } else {
-          throw new Error('No report ID returned');
-        }
+        } else {}
       } else {
         // Production mode: create Stripe checkout
killedBy: usePayment Dev/Test mode (payments disabled) should handle missing report ID in response
statusReason: expected null to be 'No report ID returned' // Object.is equality

[Killed] BlockStatement
src/hooks/usePayment.ts:56:14
         } else {
           throw new Error('No report ID returned');
         }
-      } else {
-        // Production mode: create Stripe checkout
-        logInfo('Creating Stripe checkout', { query });
-
-        const response = await api.post(apiEndpoint, { query });
-
-        if (response.error) {
-          throw new Error(response.error.message);
-        }
-
-        const checkoutUrl = response.data?.checkoutUrl;
-        if (checkoutUrl) {
-          // Redirect to Stripe checkout
-          window.location.href = checkoutUrl;
-        } else {
-          throw new Error('No checkout URL returned');
-        }
-      }
+      } else {}
     } catch (err) {
       const errorMessage = err instanceof Error ? err.message : 'Payment failed';
killedBy: usePayment Production mode (payments enabled) should create Stripe checkout and redirect
statusReason: expected "spy" to be called with arguments: [ 'Creating Stripe checkout', …(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/hooks/usePayment.ts:58:17
         }
       } else {
         // Production mode: create Stripe checkout
-        logInfo('Creating Stripe checkout', { query });
+        logInfo("", { query });
 
         const response = await api.post(apiEndpoint, { query });
killedBy: usePayment Production mode (payments enabled) should create Stripe checkout and redirect
statusReason: expected "spy" to be called with arguments: [ 'Creating Stripe checkout', …(1) ]

Received: 

  1st spy call:

  Array [
-   "Creating Stripe checkout",

[Killed] BlockStatement
src/hooks/usePayment.ts:62:29
 
         const response = await api.post(apiEndpoint, { query });
 
-        if (response.error) {
-          throw new Error(response.error.message);
-        }
+        if (response.error) {}
 
         const checkoutUrl = response.data?.checkoutUrl;
killedBy: usePayment Production mode (payments enabled) should handle API error during checkout creation
statusReason: expected 'No checkout URL returned' to be 'Server error' // Object.is equality

[Survived] OptionalChaining
src/hooks/usePayment.ts:66:29
           throw new Error(response.error.message);
         }
 
-        const checkoutUrl = response.data?.checkoutUrl;
+        const checkoutUrl = response.data.checkoutUrl;
         if (checkoutUrl) {
           // Redirect to Stripe checkout

[Killed] BlockStatement
src/hooks/usePayment.ts:67:26
         }
 
         const checkoutUrl = response.data?.checkoutUrl;
-        if (checkoutUrl) {
-          // Redirect to Stripe checkout
-          window.location.href = checkoutUrl;
-        } else {
+        if (checkoutUrl) {} else {
           throw new Error('No checkout URL returned');
         }
killedBy: usePayment Production mode (payments enabled) should create Stripe checkout and redirect
statusReason: expected '' to be 'https://checkout.stripe.com/session-1…' // Object.is equality

[Killed] ConditionalExpression
src/hooks/usePayment.ts:67:13
         }
 
         const checkoutUrl = response.data?.checkoutUrl;
-        if (checkoutUrl) {
+        if (true) {
           // Redirect to Stripe checkout
           window.location.href = checkoutUrl;
killedBy: usePayment Production mode (payments enabled) should handle missing checkout URL
statusReason: expected null to be 'No checkout URL returned' // Object.is equality

[Killed] BlockStatement
src/hooks/usePayment.ts:70:16
         if (checkoutUrl) {
           // Redirect to Stripe checkout
           window.location.href = checkoutUrl;
-        } else {
-          throw new Error('No checkout URL returned');
-        }
+        } else {}
       }
     } catch (err) {
killedBy: usePayment Production mode (payments enabled) should handle missing checkout URL
statusReason: expected null to be 'No checkout URL returned' // Object.is equality

[Killed] BlockStatement
src/hooks/usePayment.ts:74:19
           throw new Error('No checkout URL returned');
         }
       }
-    } catch (err) {
-      const errorMessage = err instanceof Error ? err.message : 'Payment failed';
-      setError(errorMessage);
-      logError('Payment error', err);
-      onError?.(errorMessage);
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }
killedBy: usePayment Dev/Test mode (payments disabled) should handle API error response
statusReason: expected null to be 'Invalid query' // Object.is equality

[Killed] StringLiteral
src/hooks/usePayment.ts:75:65
         }
       }
     } catch (err) {
-      const errorMessage = err instanceof Error ? err.message : 'Payment failed';
+      const errorMessage = err instanceof Error ? err.message : "";
       setError(errorMessage);
       logError('Payment error', err);
killedBy: usePayment Dev/Test mode (payments disabled) should handle non-Error exceptions
statusReason: expected '' to be 'Payment failed' // Object.is equality

[Killed] OptionalChaining
src/hooks/usePayment.ts:78:7
       const errorMessage = err instanceof Error ? err.message : 'Payment failed';
       setError(errorMessage);
       logError('Payment error', err);
-      onError?.(errorMessage);
+      onError(errorMessage);
     } finally {
       setIsLoading(false);
killedBy: usePayment Callback options should work without onError callback
statusReason: onError is not a function

[Killed] BlockStatement
src/hooks/usePayment.ts:79:15
       setError(errorMessage);
       logError('Payment error', err);
       onError?.(errorMessage);
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
 
killedBy: usePayment Dev/Test mode (payments disabled) should set isLoading to true during request
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
