[Survived] StringLiteral
app/(app)/reports/page.tsx:17:12
 const STATUS_FILTERS: Array<{ value: ReportStatus | 'all'; label: string }> = [
   { value: 'all', label: 'All Reports' },
   { value: 'completed', label: 'Completed' },
-  { value: 'generating', label: 'Generating' },
+  { value: "", label: 'Generating' },
   { value: 'failed', label: 'Failed' },
   { value: 'expired', label: 'Expired' },

[Survived] StringLiteral
app/(app)/reports/page.tsx:19:30
   { value: 'completed', label: 'Completed' },
   { value: 'generating', label: 'Generating' },
   { value: 'failed', label: 'Failed' },
-  { value: 'expired', label: 'Expired' },
+  { value: 'expired', label: "" },
 ];
 

[Survived] ObjectLiteral
app/(app)/reports/page.tsx:19:3
   { value: 'completed', label: 'Completed' },
   { value: 'generating', label: 'Generating' },
   { value: 'failed', label: 'Failed' },
-  { value: 'expired', label: 'Expired' },
+  {},
 ];
 

[Survived] ObjectLiteral
app/(app)/reports/page.tsx:28:18
 
   const {
     reports, isLoading, error, refetch,
-  } = useReports({
-    limit: 100, // Fetch more for the full history page
-    autoFetch: true,
-  });
+  } = useReports({});
 
   // Filter reports based on status and search query

[Survived] BooleanLiteral
app/(app)/reports/page.tsx:30:16
     reports, isLoading, error, refetch,
   } = useReports({
     limit: 100, // Fetch more for the full history page
-    autoFetch: true,
+    autoFetch: false,
   });
 

[Killed] BlockStatement
app/(app)/reports/page.tsx:34:41
   });
 
   // Filter reports based on status and search query
-  const filteredReports = useMemo(() => {
-    let filtered = reports;
-
-    // Apply status filter
-    if (statusFilter !== 'all') {
-      filtered = filtered.filter((report) => report.status === statusFilter);
-    }
-
-    // Apply search filter
-    if (searchQuery.trim()) {
-      const query = searchQuery.toLowerCase();
-      filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
-    }
-
-    return filtered;
-  }, [reports, statusFilter, searchQuery]);
+  const filteredReports = useMemo(() => {}, [reports, statusFilter, searchQuery]);
 
   return (
killedBy: ReportsPage rendering should render page heading
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:38:9
     let filtered = reports;
 
     // Apply status filter
-    if (statusFilter !== 'all') {
+    if (true) {
       filtered = filtered.filter((report) => report.status === statusFilter);
     }
killedBy: ReportsPage with reports should render report cards
statusReason: Unable to find an element by: [data-testid="report-card-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BlockStatement
app/(app)/reports/page.tsx:38:33
     let filtered = reports;
 
     // Apply status filter
-    if (statusFilter !== 'all') {
-      filtered = filtered.filter((report) => report.status === statusFilter);
-    }
+    if (statusFilter !== 'all') {}
 
     // Apply search filter
killedBy: ReportsPage filtering should filter by status
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] EqualityOperator
app/(app)/reports/page.tsx:39:46
 
     // Apply status filter
     if (statusFilter !== 'all') {
-      filtered = filtered.filter((report) => report.status === statusFilter);
+      filtered = filtered.filter((report) => report.status !== statusFilter);
     }
 
killedBy: ReportsPage filtering should filter by status
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] MethodExpression
app/(app)/reports/page.tsx:39:18
 
     // Apply status filter
     if (statusFilter !== 'all') {
-      filtered = filtered.filter((report) => report.status === statusFilter);
+      filtered = filtered;
     }
 
killedBy: ReportsPage filtering should filter by status
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BlockStatement
app/(app)/reports/page.tsx:43:29
     }
 
     // Apply search filter
-    if (searchQuery.trim()) {
-      const query = searchQuery.toLowerCase();
-      filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
-    }
+    if (searchQuery.trim()) {}
 
     return filtered;
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:43:9
     }
 
     // Apply search filter
-    if (searchQuery.trim()) {
+    if (false) {
       const query = searchQuery.toLowerCase();
       filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] MethodExpression
app/(app)/reports/page.tsx:44:21
 
     // Apply search filter
     if (searchQuery.trim()) {
-      const query = searchQuery.toLowerCase();
+      const query = searchQuery.toUpperCase();
       filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
     }
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] MethodExpression
app/(app)/reports/page.tsx:45:46
     // Apply search filter
     if (searchQuery.trim()) {
       const query = searchQuery.toLowerCase();
-      filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
+      filtered = filtered.filter((report) => report.query.toUpperCase().includes(query));
     }
 
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] MethodExpression
app/(app)/reports/page.tsx:45:18
     // Apply search filter
     if (searchQuery.trim()) {
       const query = searchQuery.toLowerCase();
-      filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));
+      filtered = filtered;
     }
 
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ArrayDeclaration
app/(app)/reports/page.tsx:49:6
     }
 
     return filtered;
-  }, [reports, statusFilter, searchQuery]);
+  }, []);
 
   return (
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ArrowFunction
app/(app)/reports/page.tsx:100:25
               type="text"
               placeholder="Search reports..."
               value={searchQuery}
-              onChange={(e) => setSearchQuery(e.target.value)}
+              onChange={() => undefined}
               className="block w-full rounded-lg border border-gray-300 bg-white py-2 pl-10 pr-3 text-sm focus:border-blue-500 focus:outline-none focus:ring-1 focus:ring-blue-500"
             />
killedBy: ReportsPage filtering should filter by search query
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ArrowFunction
app/(app)/reports/page.tsx:113:25
             <select
               id="status-filter"
               value={statusFilter}
-              onChange={(e) => setStatusFilter(e.target.value as ReportStatus | 'all')}
+              onChange={() => undefined}
               className="rounded-lg border border-gray-300 bg-white px-3 py-2 text-sm focus:border-blue-500 focus:outline-none focus:ring-1 focus:ring-blue-500"
             >
killedBy: ReportsPage filtering should filter by status
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ArrowFunction
app/(app)/reports/page.tsx:116:35
               onChange={(e) => setStatusFilter(e.target.value as ReportStatus | 'all')}
               className="rounded-lg border border-gray-300 bg-white px-3 py-2 text-sm focus:border-blue-500 focus:outline-none focus:ring-1 focus:ring-blue-500"
             >
-              {STATUS_FILTERS.map((filter) => (
-                <option key={filter.value} value={filter.value}>
-                  {filter.label}
-                </option>
-              ))}
+              {STATUS_FILTERS.map(() => undefined)}
             </select>
           </div>
killedBy: ReportsPage filtering should filter by status
statusReason: Unable to find an element with the text: /showing 2 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:126:10
         </div>
 
         {/* Results count */}
-        {!isLoading && (
+        {isLoading && (
           <div className="mt-4 text-sm text-gray-600">
             Showing
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:126:10
         </div>
 
         {/* Results count */}
-        {!isLoading && (
-          <div className="mt-4 text-sm text-gray-600">
-            Showing
-            {' '}
-            {filteredReports.length}
-            {' '}
-            of
-            {' '}
-            {reports.length}
-            {' '}
-            reports
-          </div>
-        )}
+        {true}
       </div>
 
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:129:14
         {!isLoading && (
           <div className="mt-4 text-sm text-gray-600">
             Showing
-            {' '}
+            {""}
             {filteredReports.length}
             {' '}
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:131:14
             Showing
             {' '}
             {filteredReports.length}
-            {' '}
+            {""}
             of
             {' '}
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:133:14
             {filteredReports.length}
             {' '}
             of
-            {' '}
+            {""}
             {reports.length}
             {' '}
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:135:14
             of
             {' '}
             {reports.length}
-            {' '}
+            {""}
             reports
           </div>
killedBy: ReportsPage with reports should show results count
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:142:8
       </div>
 
       {/* Loading state */}
-      {isLoading && (
-        <div className="space-y-4">
-          {[1, 2, 3, 4].map((i) => (
-            <div key={i} className="h-32 animate-pulse rounded-lg bg-gray-100" />
-          ))}
-        </div>
-      )}
+      {false}
 
       {/* Error state */}
killedBy: ReportsPage loading state should show skeleton loaders when loading
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
app/(app)/reports/page.tsx:142:8
       </div>
 
       {/* Loading state */}
-      {isLoading && (
-        <div className="space-y-4">
-          {[1, 2, 3, 4].map((i) => (
-            <div key={i} className="h-32 animate-pulse rounded-lg bg-gray-100" />
-          ))}
-        </div>
-      )}
+      {isLoading || <div className="space-y-4">
+          {[1, 2, 3, 4].map(i => <div key={i} className="h-32 animate-pulse rounded-lg bg-gray-100" />)}
+        </div>}
 
       {/* Error state */}
killedBy: ReportsPage loading state should show skeleton loaders when loading
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
app/(app)/reports/page.tsx:144:29
       {/* Loading state */}
       {isLoading && (
         <div className="space-y-4">
-          {[1, 2, 3, 4].map((i) => (
-            <div key={i} className="h-32 animate-pulse rounded-lg bg-gray-100" />
-          ))}
+          {[1, 2, 3, 4].map(() => undefined)}
         </div>
       )}
killedBy: ReportsPage loading state should show skeleton loaders when loading
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:151:17
       )}
 
       {/* Error state */}
-      {error && !isLoading && (
+      {error && isLoading && (
         <div className="rounded-lg border border-red-200 bg-red-50 p-6">
           <div className="flex items-center gap-2 text-red-800">
killedBy: ReportsPage error state should show error message when error occurs
statusReason: Unable to find an element with the text: /Failed to load reports/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:151:8
       )}
 
       {/* Error state */}
-      {error && !isLoading && (
-        <div className="rounded-lg border border-red-200 bg-red-50 p-6">
-          <div className="flex items-center gap-2 text-red-800">
-            <svg className="h-5 w-5" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-              <path
-                strokeLinecap="round"
-                strokeLinejoin="round"
-                strokeWidth={2}
-                d="M12 8v4m0 4h.01M21 12a9 9 0 11-18 0 9 9 0 0118 0z"
-              />
-            </svg>
-            <h3 className="font-medium">Failed to load reports</h3>
-          </div>
-          <p className="mt-2 text-sm text-red-700">{error}</p>
-          <button
-            onClick={refetch}
-            className="mt-4 rounded-lg bg-red-100 px-4 py-2 text-sm font-medium text-red-800 hover:bg-red-200"
-          >
-            Try again
-          </button>
-        </div>
-      )}
+      {true}
 
       {/* Empty state */}
killedBy: ReportsPage error state should show error message when error occurs
statusReason: Unable to find an element with the text: /Failed to load reports/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:175:8
       )}
 
       {/* Empty state */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length === 0 && (
+      {isLoading && !error && filteredReports.length === 0 && reports.length === 0 && (
         <div className="rounded-lg border border-dashed border-gray-300 bg-gray-50 p-12 text-center">
           <svg
killedBy: ReportsPage empty state should show empty state when no reports
statusReason: Unable to find an element with the text: No reports yet. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:175:22
       )}
 
       {/* Empty state */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length === 0 && (
+      {!isLoading && error && filteredReports.length === 0 && reports.length === 0 && (
         <div className="rounded-lg border border-dashed border-gray-300 bg-gray-50 p-12 text-center">
           <svg
killedBy: ReportsPage empty state should show empty state when no reports
statusReason: Unable to find an element with the text: No reports yet. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:212:8
       )}
 
       {/* No results from filter */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length > 0 && (
+      {isLoading && !error && filteredReports.length === 0 && reports.length > 0 && (
         <div className="rounded-lg border border-gray-200 bg-white p-12 text-center">
           <svg
killedBy: ReportsPage filtering should show no results message when filter matches nothing
statusReason: Unable to find an element with the text: No reports found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BooleanLiteral
app/(app)/reports/page.tsx:212:22
       )}
 
       {/* No results from filter */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length > 0 && (
+      {!isLoading && error && filteredReports.length === 0 && reports.length > 0 && (
         <div className="rounded-lg border border-gray-200 bg-white p-12 text-center">
           <svg
killedBy: ReportsPage filtering should show no results message when filter matches nothing
statusReason: Unable to find an element with the text: No reports found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] BlockStatement
app/(app)/reports/page.tsx:232:28
             Try adjusting your search or filter criteria
           </p>
           <button
-            onClick={() => {
-              setSearchQuery('');
-              setStatusFilter('all');
-            }}
+            onClick={() => {}}
             className="text-sm font-medium text-blue-600 hover:text-blue-700"
           >
killedBy: ReportsPage filtering should clear filters when Clear filters button clicked
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:233:30
           </p>
           <button
             onClick={() => {
-              setSearchQuery('');
+              setSearchQuery("Stryker was here!");
               setStatusFilter('all');
             }}
killedBy: ReportsPage filtering should clear filters when Clear filters button clicked
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] StringLiteral
app/(app)/reports/page.tsx:234:31
           <button
             onClick={() => {
               setSearchQuery('');
-              setStatusFilter('all');
+              setStatusFilter("");
             }}
             className="text-sm font-medium text-blue-600 hover:text-blue-700"
killedBy: ReportsPage filtering should clear filters when Clear filters button clicked
statusReason: Unable to find an element with the text: /showing 3 of 3 reports/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ConditionalExpression
app/(app)/reports/page.tsx:244:8
       )}
 
       {/* Reports list */}
-      {!isLoading && !error && filteredReports.length > 0 && (
-        <div className="space-y-4">
-          {filteredReports.map((report) => (
-            <ReportCard key={report.id} report={report} />
-          ))}
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: ReportsPage with reports should render report cards
statusReason: Unable to find an element by: [data-testid="report-card-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] EqualityOperator
app/(app)/reports/page.tsx:244:32
       )}
 
       {/* Reports list */}
-      {!isLoading && !error && filteredReports.length > 0 && (
+      {!isLoading && !error && filteredReports.length <= 0 && (
         <div className="space-y-4">
           {filteredReports.map((report) => (
killedBy: ReportsPage with reports should render report cards
statusReason: Unable to find an element by: [data-testid="report-card-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >

[Killed] ArrowFunction
app/(app)/reports/page.tsx:246:32
       {/* Reports list */}
       {!isLoading && !error && filteredReports.length > 0 && (
         <div className="space-y-4">
-          {filteredReports.map((report) => (
-            <ReportCard key={report.id} report={report} />
-          ))}
+          {filteredReports.map(() => undefined)}
         </div>
       )}
killedBy: ReportsPage with reports should render report cards
statusReason: Unable to find an element by: [data-testid="report-card-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-6xl mx-auto"
    >
