[NoCoverage] ConditionalExpression
src/components/dev/environment-badge.tsx:115:12
             </div>
           )}
 
-          {environmentMode === 'test' && (
+          {true && (
             <div className="mt-3 rounded bg-yellow-50 p-2 text-xs text-yellow-800">
               <strong>Test Mode:</strong>
