[Survived] BooleanLiteral
src/components/ClerkWarning.tsx:11:46
 import { useEffect, useState } from 'react';
 
 export function ClerkWarning() {
-  const [isMounted, setIsMounted] = useState(false);
+  const [isMounted, setIsMounted] = useState(true);
   const [configured, setConfigured] = useState(true);
 

[Survived] BooleanLiteral
src/components/ClerkWarning.tsx:12:48
 
 export function ClerkWarning() {
   const [isMounted, setIsMounted] = useState(false);
-  const [configured, setConfigured] = useState(true);
+  const [configured, setConfigured] = useState(false);
 
   useEffect(() => {

[Killed] BlockStatement
src/components/ClerkWarning.tsx:14:19
   const [isMounted, setIsMounted] = useState(false);
   const [configured, setConfigured] = useState(true);
 
-  useEffect(() => {
-    setIsMounted(true);
-    // Only check client-accessible environment variables to avoid hydration mismatch
-    const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-    const hasValidKey = publishableKey
-      && !publishableKey.includes('YOUR_')
-      && !publishableKey.includes('your_')
-      && publishableKey !== 'pk_test_your_clerk_publishable_key';
-
-    setConfigured(hasValidKey);
-  }, []);
+  useEffect(() => {}, []);
 
   // Don't render anything until after hydration
killedBy: ClerkWarning when Clerk has placeholder keys should render warning when key contains YOUR_
statusReason: Unable to find an element with the text: /Development Mode:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/components/ClerkWarning.tsx:15:18
   const [configured, setConfigured] = useState(true);
 
   useEffect(() => {
-    setIsMounted(true);
+    setIsMounted(false);
     // Only check client-accessible environment variables to avoid hydration mismatch
     const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
killedBy: ClerkWarning when Clerk has placeholder keys should render warning when key contains YOUR_
statusReason: Unable to find an element with the text: /Development Mode:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/components/ClerkWarning.tsx:17:28
   useEffect(() => {
     setIsMounted(true);
     // Only check client-accessible environment variables to avoid hydration mismatch
-    const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
+    const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY && '';
     const hasValidKey = publishableKey
       && !publishableKey.includes('YOUR_')
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: expected <div …(1)><div …(1)>…(2)</div></div> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/components/ClerkWarning.tsx:17:28
   useEffect(() => {
     setIsMounted(true);
     // Only check client-accessible environment variables to avoid hydration mismatch
-    const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
+    const publishableKey = true;
     const hasValidKey = publishableKey
       && !publishableKey.includes('YOUR_')
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: publishableKey.includes is not a function

[Killed] LogicalOperator
src/components/ClerkWarning.tsx:18:25
     setIsMounted(true);
     // Only check client-accessible environment variables to avoid hydration mismatch
     const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-    const hasValidKey = publishableKey
-      && !publishableKey.includes('YOUR_')
-      && !publishableKey.includes('your_')
-      && publishableKey !== 'pk_test_your_clerk_publishable_key';
+    const hasValidKey = publishableKey && !publishableKey.includes('YOUR_') && !publishableKey.includes('your_') || publishableKey !== 'pk_test_your_clerk_publishable_key';
 
     setConfigured(hasValidKey);
killedBy: ClerkWarning when Clerk has placeholder keys should render warning when key contains YOUR_
statusReason: Unable to find an element with the text: /Development Mode:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/ClerkWarning.tsx:18:25
     setIsMounted(true);
     // Only check client-accessible environment variables to avoid hydration mismatch
     const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-    const hasValidKey = publishableKey
-      && !publishableKey.includes('YOUR_')
-      && !publishableKey.includes('your_')
-      && publishableKey !== 'pk_test_your_clerk_publishable_key';
+    const hasValidKey = true;
 
     setConfigured(hasValidKey);
killedBy: ClerkWarning when Clerk has placeholder keys should render warning when key contains YOUR_
statusReason: Unable to find an element with the text: /Development Mode:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/components/ClerkWarning.tsx:19:10
     // Only check client-accessible environment variables to avoid hydration mismatch
     const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
     const hasValidKey = publishableKey
-      && !publishableKey.includes('YOUR_')
+      && publishableKey.includes('YOUR_')
       && !publishableKey.includes('your_')
       && publishableKey !== 'pk_test_your_clerk_publishable_key';
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: expected <div …(1)><div …(1)>…(2)</div></div> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/components/ClerkWarning.tsx:20:10
     const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
     const hasValidKey = publishableKey
       && !publishableKey.includes('YOUR_')
-      && !publishableKey.includes('your_')
+      && publishableKey.includes('your_')
       && publishableKey !== 'pk_test_your_clerk_publishable_key';
 
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: expected <div …(1)><div …(1)>…(2)</div></div> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/components/ClerkWarning.tsx:21:10
     const hasValidKey = publishableKey
       && !publishableKey.includes('YOUR_')
       && !publishableKey.includes('your_')
-      && publishableKey !== 'pk_test_your_clerk_publishable_key';
+      && publishableKey === 'pk_test_your_clerk_publishable_key';
 
     setConfigured(hasValidKey);
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: expected <div …(1)><div …(1)>…(2)</div></div> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ConditionalExpression
src/components/ClerkWarning.tsx:21:10
     const hasValidKey = publishableKey
       && !publishableKey.includes('YOUR_')
       && !publishableKey.includes('your_')
-      && publishableKey !== 'pk_test_your_clerk_publishable_key';
+      && true;
 
     setConfigured(hasValidKey);

[Survived] ArrayDeclaration
src/components/ClerkWarning.tsx:24:6
       && publishableKey !== 'pk_test_your_clerk_publishable_key';
 
     setConfigured(hasValidKey);
-  }, []);
+  }, ["Stryker was here"]);
 
   // Don't render anything until after hydration

[Killed] LogicalOperator
src/components/ClerkWarning.tsx:27:7
   }, []);
 
   // Don't render anything until after hydration
-  if (!isMounted || configured) {
+  if (!isMounted && configured) {
     return null;
   }
killedBy: ClerkWarning when Clerk is properly configured should return null when publishable key is valid
statusReason: expected <div …(1)><div …(1)>…(2)</div></div> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/components/ClerkWarning.tsx:27:7
   }, []);
 
   // Don't render anything until after hydration
-  if (!isMounted || configured) {
+  if (isMounted || configured) {
     return null;
   }
killedBy: ClerkWarning when Clerk has placeholder keys should render warning when key contains YOUR_
statusReason: Unable to find an element with the text: /Development Mode:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
src/components/ClerkWarning.tsx:52:14
         <div className="ml-3">
           <p className="text-sm text-yellow-700">
             <strong>Development Mode:</strong>
-            {' '}
+            {""}
             Clerk is using placeholder keys. Please configure real API keys in .env.local. See docs/CLERK-SETUP-GUIDE.md for instructions.
           </p>
