[NoCoverage] OptionalChaining
src/hooks/usePayment.ts:50:53
           throw new Error(response.error.message);
         }
 
-        const reportId = response.data?.reportId || response.data?.id;
+        const reportId = response.data?.reportId || response.data.id;
         if (reportId) {
           onSuccess?.(reportId);
