[Killed] ArrayDeclaration
src/components/chat/StreamingResponse.tsx:36:55
  * @param onError - Callback when an error occurs
  */
 export function StreamingResponse({ reportId, onComplete, onError }: StreamingResponseProps) {
-  const [sections, setSections] = useState<Section[]>([]);
+  const [sections, setSections] = useState<Section[]>(["Stryker was here"]);
   const [currentChunk, setCurrentChunk] = useState<string>('');
   const [progress, setProgress] = useState<{ current: number; total: number }>({ current: 0, total: 10 });
killedBy: StreamingResponse Initial rendering should render with empty sections initially
statusReason: expected [ <div …(1)><h3></h3>
<p></p></div> ] to have a length of +0 but got 1

[Killed] ObjectLiteral
src/components/chat/StreamingResponse.tsx:38:80
 export function StreamingResponse({ reportId, onComplete, onError }: StreamingResponseProps) {
   const [sections, setSections] = useState<Section[]>([]);
   const [currentChunk, setCurrentChunk] = useState<string>('');
-  const [progress, setProgress] = useState<{ current: number; total: number }>({ current: 0, total: 10 });
+  const [progress, setProgress] = useState<{ current: number; total: number }>({});
   const [isComplete, setIsComplete] = useState(false);
   const [error, setError] = useState<string | null>(null);
killedBy: StreamingResponse Initial rendering should render progress indicator initially
statusReason: Unable to find an element with the text: /Section 0 of 10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] BooleanLiteral
src/components/chat/StreamingResponse.tsx:39:48
   const [sections, setSections] = useState<Section[]>([]);
   const [currentChunk, setCurrentChunk] = useState<string>('');
   const [progress, setProgress] = useState<{ current: number; total: number }>({ current: 0, total: 10 });
-  const [isComplete, setIsComplete] = useState(false);
+  const [isComplete, setIsComplete] = useState(true);
   const [error, setError] = useState<string | null>(null);
 
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:43:20
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    const apiUrl = process.env.NEXT_PUBLIC_API_URL || 'http://localhost:8000';
+    const apiUrl = false;
     const eventSource = new EventSource(
       `${apiUrl}/stream/reports/${reportId}`,
killedBy: StreamingResponse Initial rendering should initialize EventSource with correct URL
statusReason: expected 'false/stream/reports/report-456' to be 'http://localhost:8000/stream/reports/…' // Object.is equality

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:43:20
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    const apiUrl = process.env.NEXT_PUBLIC_API_URL || 'http://localhost:8000';
+    const apiUrl = true;
     const eventSource = new EventSource(
       `${apiUrl}/stream/reports/${reportId}`,
killedBy: StreamingResponse Initial rendering should initialize EventSource with correct URL
statusReason: expected 'true/stream/reports/report-456' to be 'http://localhost:8000/stream/reports/…' // Object.is equality

[Survived] BooleanLiteral
src/components/chat/StreamingResponse.tsx:46:26
     const apiUrl = process.env.NEXT_PUBLIC_API_URL || 'http://localhost:8000';
     const eventSource = new EventSource(
       `${apiUrl}/stream/reports/${reportId}`,
-      { withCredentials: true },
+      { withCredentials: false },
     );
 

[Survived] ObjectLiteral
src/components/chat/StreamingResponse.tsx:46:7
     const apiUrl = process.env.NEXT_PUBLIC_API_URL || 'http://localhost:8000';
     const eventSource = new EventSource(
       `${apiUrl}/stream/reports/${reportId}`,
-      { withCredentials: true },
+      {},
     );
 

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:54:11
         const data = JSON.parse(event.data);
 
         switch (data.type) {
-          case 'start':
-            console.log('Streaming started for report:', data.report_id);
-            break;
+          case 'start':
 
           case 'chunk':
killedBy: StreamingResponse SSE event handling start event should handle start event
statusReason: expected "log" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:58:11
             console.log('Streaming started for report:', data.report_id);
             break;
 
-          case 'chunk':
-            // Accumulate raw text chunks for progressive rendering
-            setCurrentChunk((prev) => prev + data.content);
-            break;
+          case 'chunk':
 
           case 'section':
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk.*second chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] StringLiteral
src/components/chat/StreamingResponse.tsx:58:16
             console.log('Streaming started for report:', data.report_id);
             break;
 
-          case 'chunk':
+          case "":
             // Accumulate raw text chunks for progressive rendering
             setCurrentChunk((prev) => prev + data.content);
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArrowFunction
src/components/chat/StreamingResponse.tsx:60:29
 
           case 'chunk':
             // Accumulate raw text chunks for progressive rendering
-            setCurrentChunk((prev) => prev + data.content);
+            setCurrentChunk(() => undefined);
             break;
 
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArithmeticOperator
src/components/chat/StreamingResponse.tsx:60:39
 
           case 'chunk':
             // Accumulate raw text chunks for progressive rendering
-            setCurrentChunk((prev) => prev + data.content);
+            setCurrentChunk((prev) => prev - data.content);
             break;
 
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:63:11
             setCurrentChunk((prev) => prev + data.content);
             break;
 
-          case 'section':
-            // Complete section received
-            setSections((prev) => [...prev, {
-              section_num: data.section_num,
-              heading: data.heading,
-              content: data.content,
-              citations: data.citations,
-            }]);
-            setCurrentChunk(''); // Clear chunk buffer
-            break;
+          case 'section':
 
           case 'progress':
killedBy: StreamingResponse SSE event handling section event should render completed section
statusReason: Unable to find an element with the text: Introduction. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] StringLiteral
src/components/chat/StreamingResponse.tsx:63:16
             setCurrentChunk((prev) => prev + data.content);
             break;
 
-          case 'section':
+          case "":
             // Complete section received
             setSections((prev) => [...prev, {
killedBy: StreamingResponse SSE event handling section event should render completed section
statusReason: Unable to find an element with the text: Introduction. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArrowFunction
src/components/chat/StreamingResponse.tsx:65:25
 
           case 'section':
             // Complete section received
-            setSections((prev) => [...prev, {
-              section_num: data.section_num,
-              heading: data.heading,
-              content: data.content,
-              citations: data.citations,
-            }]);
+            setSections(() => undefined);
             setCurrentChunk(''); // Clear chunk buffer
             break;
killedBy: StreamingResponse SSE event handling section event should render completed section
statusReason: Unable to find an element with the text: Introduction. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
src/components/chat/StreamingResponse.tsx:65:45
 
           case 'section':
             // Complete section received
-            setSections((prev) => [...prev, {
-              section_num: data.section_num,
-              heading: data.heading,
-              content: data.content,
-              citations: data.citations,
-            }]);
+            setSections((prev) => [...prev, {}]);
             setCurrentChunk(''); // Clear chunk buffer
             break;
killedBy: StreamingResponse SSE event handling section event should render completed section
statusReason: Unable to find an element with the text: Introduction. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Survived] StringLiteral
src/components/chat/StreamingResponse.tsx:71:29
               content: data.content,
               citations: data.citations,
             }]);
-            setCurrentChunk(''); // Clear chunk buffer
+            setCurrentChunk("Stryker was here!"); // Clear chunk buffer
             break;
 

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:74:11
             setCurrentChunk(''); // Clear chunk buffer
             break;
 
-          case 'progress':
-            setProgress({
-              current: data.current_section,
-              total: data.total_sections,
-            });
-            break;
+          case 'progress':
 
           case 'complete':
killedBy: StreamingResponse SSE event handling progress event should update progress indicator
statusReason: Unable to find an element with the text: /Section 3 of 10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] StringLiteral
src/components/chat/StreamingResponse.tsx:74:16
             setCurrentChunk(''); // Clear chunk buffer
             break;
 
-          case 'progress':
+          case "":
             setProgress({
               current: data.current_section,
killedBy: StreamingResponse SSE event handling progress event should update progress indicator
statusReason: Unable to find an element with the text: /Section 3 of 10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:81:11
             });
             break;
 
-          case 'complete':
-            setIsComplete(true);
-            eventSource.close();
-            onComplete?.();
-            break;
+          case 'complete':
 
           case 'error':
killedBy: StreamingResponse SSE event handling complete event should show completion message
statusReason: Unable to find an element with the text: Report Generation Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border border-red-200 bg-red-50 p-6"
    >

[Killed] BooleanLiteral
src/components/chat/StreamingResponse.tsx:82:27
             break;
 
           case 'complete':
-            setIsComplete(true);
+            setIsComplete(false);
             eventSource.close();
             onComplete?.();
killedBy: StreamingResponse SSE event handling complete event should show completion message
statusReason: Unable to find an element with the text: Report Generation Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Survived] OptionalChaining
src/components/chat/StreamingResponse.tsx:84:13
           case 'complete':
             setIsComplete(true);
             eventSource.close();
-            onComplete?.();
+            onComplete();
             break;
 

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:87:11
             onComplete?.();
             break;
 
-          case 'error':
-            const errorMsg = data.message || 'Unknown error occurred';
-            setError(errorMsg);
-            onError?.(errorMsg);
-            eventSource.close();
-            break;
+          case 'error':
 
           default:
killedBy: StreamingResponse SSE event handling error event should display error message from SSE
statusReason: Unable to find an element with the text: Error Generating Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] LogicalOperator
src/components/chat/StreamingResponse.tsx:88:30
             break;
 
           case 'error':
-            const errorMsg = data.message || 'Unknown error occurred';
+            const errorMsg = data.message && 'Unknown error occurred';
             setError(errorMsg);
             onError?.(errorMsg);
killedBy: StreamingResponse SSE event handling error event should display error message from SSE
statusReason: Unable to find an element with the text: Failed to generate report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg border border-red-200 bg-red-50 p-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:88:30
             break;
 
           case 'error':
-            const errorMsg = data.message || 'Unknown error occurred';
+            const errorMsg = false;
             setError(errorMsg);
             onError?.(errorMsg);
killedBy: StreamingResponse SSE event handling error event should display error message from SSE
statusReason: Unable to find an element with the text: Error Generating Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] OptionalChaining
src/components/chat/StreamingResponse.tsx:90:13
           case 'error':
             const errorMsg = data.message || 'Unknown error occurred';
             setError(errorMsg);
-            onError?.(errorMsg);
+            onError(errorMsg);
             eventSource.close();
             break;
killedBy: StreamingResponse SSE event handling error event should close EventSource on error
statusReason: expected "close" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:94:11
             eventSource.close();
             break;
 
-          default:
-            console.warn('Unknown event type:', data.type);
+          default:
         }
       } catch (err) {
killedBy: StreamingResponse SSE event handling unknown event type should log warning for unknown event type
statusReason: expected "warn" to be called with arguments: [ 'Unknown event type:', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/components/chat/StreamingResponse.tsx:97:21
           default:
             console.warn('Unknown event type:', data.type);
         }
-      } catch (err) {
-        console.error('Failed to parse SSE data:', err);
-      }
+      } catch (err) {}
     };
 
killedBy: StreamingResponse JSON parsing errors should handle invalid JSON in message
statusReason: expected "error" to be called with arguments: [ 'Failed to parse SSE data:', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/components/chat/StreamingResponse.tsx:102:36
       }
     };
 
-    eventSource.onerror = (err) => {
-      console.error('SSE connection error:', err);
-      const errorMsg = 'Streaming connection lost. Please try again.';
-      setError(errorMsg);
-      onError?.(errorMsg);
-      eventSource.close();
-    };
+    eventSource.onerror = (err) => {};
 
     // Cleanup on unmount
killedBy: StreamingResponse EventSource error handling should handle connection error
statusReason: Unable to find an element with the text: Error Generating Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] BlockStatement
src/components/chat/StreamingResponse.tsx:111:18
     };
 
     // Cleanup on unmount
-    return () => {
-      eventSource.close();
-    };
+    return () => {};
   }, [reportId, onComplete, onError]);
 
killedBy: StreamingResponse Component lifecycle should close EventSource on unmount
statusReason: expected "close" to be called at least once

[Killed] ArrayDeclaration
src/components/chat/StreamingResponse.tsx:114:6
     return () => {
       eventSource.close();
     };
-  }, [reportId, onComplete, onError]);
+  }, []);
 
   // Show error state
killedBy: StreamingResponse Component lifecycle should create new EventSource when reportId changes
statusReason: expected [ MockEventSource{ …(4) } ] to have a length of 2 but got 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/components/chat/StreamingResponse.tsx:117:14
   }, [reportId, onComplete, onError]);
 
   // Show error state
-  if (error) {
-    return (
-      <div className="rounded-lg border border-red-200 bg-red-50 p-6">
-        <h3 className="text-lg font-semibold text-red-900 mb-2">
-          Error Generating Report
-        </h3>
-        <p className="text-red-700">{error}</p>
-        <button
-          onClick={() => window.location.reload()}
-          className="mt-4 px-4 py-2 bg-red-600 text-white rounded-md hover:bg-red-700 transition-colors"
-        >
-          Try Again
-        </button>
-      </div>
-    );
-  }
+  if (error) {}
 
   return (
killedBy: StreamingResponse SSE event handling error event should display error message from SSE
statusReason: Unable to find an element with the text: Error Generating Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:117:7
   }, [reportId, onComplete, onError]);
 
   // Show error state
-  if (error) {
+  if (false) {
     return (
       <div className="rounded-lg border border-red-200 bg-red-50 p-6">
killedBy: StreamingResponse SSE event handling error event should display error message from SSE
statusReason: Unable to find an element with the text: Error Generating Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArrowFunction
src/components/chat/StreamingResponse.tsx:125:20
         </h3>
         <p className="text-red-700">{error}</p>
         <button
-          onClick={() => window.location.reload()}
+          onClick={() => undefined}
           className="mt-4 px-4 py-2 bg-red-600 text-white rounded-md hover:bg-red-700 transition-colors"
         >
killedBy: StreamingResponse SSE event handling error event should reload page when Try Again is clicked
statusReason: expected "spy" to be called at least once

[Killed] StringLiteral
src/components/chat/StreamingResponse.tsx:147:16
               Section
               {' '}
               {progress.current}
-              {' '}
+              {""}
               of
               {' '}
killedBy: StreamingResponse Initial rendering should render progress indicator initially
statusReason: Unable to find an element with the text: /Section 0 of 10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArithmeticOperator
src/components/chat/StreamingResponse.tsx:156:35
           <div className="w-full bg-gray-200 rounded-full h-2">
             <div
               className="bg-blue-600 h-2 rounded-full transition-all duration-300"
-              style={{ width: `${(progress.current / progress.total) * 100}%` }}
+              style={{ width: `${(progress.current * progress.total) * 100}%` }}
             />
           </div>
killedBy: StreamingResponse SSE event handling progress event should update progress bar width
statusReason: expect(element).toHaveStyle()

- Expected

- width: 50%;
+ width: 5000%;

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
src/components/chat/StreamingResponse.tsx:156:34
           <div className="w-full bg-gray-200 rounded-full h-2">
             <div
               className="bg-blue-600 h-2 rounded-full transition-all duration-300"
-              style={{ width: `${(progress.current / progress.total) * 100}%` }}
+              style={{ width: `${progress.current / progress.total / 100}%` }}
             />
           </div>
killedBy: StreamingResponse SSE event handling progress event should update progress bar width
statusReason: expect(element).toHaveStyle()

- Expected

- width: 50%;
+ width: 0.005%;

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/components/chat/StreamingResponse.tsx:164:23
 
       {/* Rendered sections */}
       <div className="space-y-6">
-        {sections.map((section) => (
-          <div
-            key={section.section_num}
-            className="animate-fade-in"
-          >
-            <ReportSection
-              section={{ ...section, title: section.heading }}
-              index={section.section_num || 0}
-            />
-          </div>
-        ))}
+        {sections.map(() => undefined)}
 
         {/* Current chunk being streamed (progressive rendering) */}
killedBy: StreamingResponse SSE event handling section event should render completed section
statusReason: Unable to find an element with the text: Introduction. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] LogicalOperator
src/components/chat/StreamingResponse.tsx:171:22
           >
             <ReportSection
               section={{ ...section, title: section.heading }}
-              index={section.section_num || 0}
+              index={section.section_num && 0}
             />
           </div>
killedBy: StreamingResponse UI rendering should animate sections when they appear
statusReason: Unable to find an element by: [data-testid="report-section-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:171:22
           >
             <ReportSection
               section={{ ...section, title: section.heading }}
-              index={section.section_num || 0}
+              index={true}
             />
           </div>
killedBy: StreamingResponse UI rendering should animate sections when they appear
statusReason: Unable to find an element by: [data-testid="report-section-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] LogicalOperator
src/components/chat/StreamingResponse.tsx:177:10
         ))}
 
         {/* Current chunk being streamed (progressive rendering) */}
-        {currentChunk && !isComplete && (
-          <div className="animate-pulse">
-            <div className="rounded-lg border border-gray-200 bg-gray-50 p-6">
-              <p className="text-gray-600 whitespace-pre-wrap">{currentChunk}</p>
-            </div>
-          </div>
-        )}
+        {currentChunk && !isComplete || <div className="animate-pulse">
+            <div className="rounded-lg border border-gray-200 bg-gray-50 p-6">
+              <p className="text-gray-600 whitespace-pre-wrap">{currentChunk}</p>
+            </div>
+          </div>}
       </div>
 
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:177:10
         ))}
 
         {/* Current chunk being streamed (progressive rendering) */}
-        {currentChunk && !isComplete && (
-          <div className="animate-pulse">
-            <div className="rounded-lg border border-gray-200 bg-gray-50 p-6">
-              <p className="text-gray-600 whitespace-pre-wrap">{currentChunk}</p>
-            </div>
-          </div>
-        )}
+        {false}
       </div>
 
killedBy: StreamingResponse SSE event handling chunk event should accumulate text chunks
statusReason: Unable to find an element with the text: /First chunk/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >
