[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:187:8
       </div>
 
       {/* Completion message */}
-      {isComplete && (
-        <div className="rounded-lg border border-green-200 bg-green-50 p-6 text-center animate-fade-in">
-          <div className="flex items-center justify-center mb-2">
-            <svg
-              className="w-6 h-6 text-green-600 mr-2"
-              fill="none"
-              strokeLinecap="round"
-              strokeLinejoin="round"
-              strokeWidth="2"
-              viewBox="0 0 24 24"
-              stroke="currentColor"
-            >
-              <path d="M5 13l4 4L19 7" />
-            </svg>
-            <span className="text-lg font-semibold text-green-900">
-              Report Generation Complete
-            </span>
-          </div>
-          <p className="text-green-700 text-sm">
-            Your report is now available for 30 days
-          </p>
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: StreamingResponse SSE event handling complete event should show completion message
statusReason: Unable to find an element with the text: Report Generation Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/chat/StreamingResponse.tsx:187:8
       </div>
 
       {/* Completion message */}
-      {isComplete && (
-        <div className="rounded-lg border border-green-200 bg-green-50 p-6 text-center animate-fade-in">
-          <div className="flex items-center justify-center mb-2">
-            <svg
-              className="w-6 h-6 text-green-600 mr-2"
-              fill="none"
-              strokeLinecap="round"
-              strokeLinejoin="round"
-              strokeWidth="2"
-              viewBox="0 0 24 24"
-              stroke="currentColor"
-            >
-              <path d="M5 13l4 4L19 7" />
-            </svg>
-            <span className="text-lg font-semibold text-green-900">
-              Report Generation Complete
-            </span>
-          </div>
-          <p className="text-green-700 text-sm">
-            Your report is now available for 30 days
-          </p>
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: StreamingResponse SSE event handling complete event should show completion message
statusReason: Unable to find an element with the text: Report Generation Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >
