[Killed] BlockStatement
src/components/reports/CitationList.tsx:15:45
 }
 
 export function CitationList({ citations }: CitationListProps) {
-  if (!citations || citations.length === 0) {
-    return null;
-  }
+  if (!citations || citations.length === 0) {}
 
   return (
killedBy: CitationList Empty State should return null when citations array is empty
statusReason: expected <div …(1)><h3 …(1)></h3>
…(1)</div> to be null

[Killed] BooleanLiteral
src/components/reports/CitationList.tsx:15:7
 }
 
 export function CitationList({ citations }: CitationListProps) {
-  if (!citations || citations.length === 0) {
+  if (citations || citations.length === 0) {
     return null;
   }
killedBy: CitationList Empty State should return null when citations is undefined
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
src/components/reports/CitationList.tsx:33:18
             >
               <span className="text-gray-500">
                 [
-                {index + 1}
+                {index - 1}
                 ]
               </span>
killedBy: CitationList Single Citation Rendering should display citation index
statusReason: Unable to find an element with the text: [1]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-gray-50 border border-gray-200 rounded-lg p-4"
    >

[Killed] ConditionalExpression
src/components/reports/CitationList.tsx:38:18
               </span>
               <div>
                 <div className="font-medium">{citation.title}</div>
-                {citation.snippet && (
-                  <div className="text-gray-600 italic mt-1">
-                    &quot;
-                    {citation.snippet}
-                    &quot;
-                  </div>
-                )}
+                {false}
                 <div className="text-gray-400 text-xs mt-1">{citation.url}</div>
               </div>
killedBy: CitationList Single Citation Rendering should render snippet when provided
statusReason: Unable to find an element with the text: "This is an important finding about UK universities.". This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-gray-50 border border-gray-200 rounded-lg p-4"
    >

[Killed] LogicalOperator
src/components/reports/CitationList.tsx:38:18
               </span>
               <div>
                 <div className="font-medium">{citation.title}</div>
-                {citation.snippet && (
-                  <div className="text-gray-600 italic mt-1">
-                    &quot;
-                    {citation.snippet}
-                    &quot;
-                  </div>
-                )}
+                {citation.snippet || <div className="text-gray-600 italic mt-1">
+                    &quot;
+                    {citation.snippet}
+                    &quot;
+                  </div>}
                 <div className="text-gray-400 text-xs mt-1">{citation.url}</div>
               </div>
killedBy: CitationList Single Citation Rendering should render snippet when provided
statusReason: Unable to find an element with the text: "This is an important finding about UK universities.". This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-gray-50 border border-gray-200 rounded-lg p-4"
    >
