[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:21:5
  */
 function getStatusBadge(status: ReportStatus): { label: string; className: string } {
   switch (status) {
-    case 'completed':
-      return {
-        label: 'Completed',
-        className: 'bg-green-100 text-green-800',
-      };
+    case 'completed':
     case 'pending':
     case 'processing':
killedBy: ReportCard status badges should show "Completed" badge with green styling for completed status
statusReason: Unable to find an element with the text: Completed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:23:16
   switch (status) {
     case 'completed':
       return {
-        label: 'Completed',
+        label: "",
         className: 'bg-green-100 text-green-800',
       };
killedBy: ReportCard status badges should show "Completed" badge with green styling for completed status
statusReason: Unable to find an element with the text: Completed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:27:5
         className: 'bg-green-100 text-green-800',
       };
     case 'pending':
-    case 'processing':
-      return {
-        label: 'Processing',
-        className: 'bg-blue-100 text-blue-800',
-      };
+    case 'processing':
     case 'generating':
       return {
killedBy: ReportCard status badges should show "Processing" badge with blue styling for pending status
statusReason: Unable to find an element with the text: Processing. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ObjectLiteral
src/components/reports/ReportCard.tsx:28:14
       };
     case 'pending':
     case 'processing':
-      return {
-        label: 'Processing',
-        className: 'bg-blue-100 text-blue-800',
-      };
+      return {};
     case 'generating':
       return {
killedBy: ReportCard status badges should show "Processing" badge with blue styling for pending status
statusReason: Unable to find an element with the text: Processing. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:32:5
         label: 'Processing',
         className: 'bg-blue-100 text-blue-800',
       };
-    case 'generating':
-      return {
-        label: 'Generating',
-        className: 'bg-yellow-100 text-yellow-800',
-      };
+    case 'generating':
     case 'failed':
       return {
killedBy: ReportCard status badges should show "Generating" badge with yellow styling for generating status
statusReason: Unable to find an element with the text: Generating. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ObjectLiteral
src/components/reports/ReportCard.tsx:33:14
         className: 'bg-blue-100 text-blue-800',
       };
     case 'generating':
-      return {
-        label: 'Generating',
-        className: 'bg-yellow-100 text-yellow-800',
-      };
+      return {};
     case 'failed':
       return {
killedBy: ReportCard status badges should show "Generating" badge with yellow styling for generating status
statusReason: Unable to find an element with the text: Generating. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:35:20
     case 'generating':
       return {
         label: 'Generating',
-        className: 'bg-yellow-100 text-yellow-800',
+        className: "",
       };
     case 'failed':
killedBy: ReportCard status badges should show "Generating" badge with yellow styling for generating status
statusReason: expect(element).toHaveClass("bg-yellow-100 text-yellow-800")

Expected the element to have class:
  bg-yellow-100 text-yellow-800
Received:
  flex-shrink-0 rounded-full px-2 py-1 text-xs font-medium

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:37:5
         label: 'Generating',
         className: 'bg-yellow-100 text-yellow-800',
       };
-    case 'failed':
-      return {
-        label: 'Failed',
-        className: 'bg-red-100 text-red-800',
-      };
+    case 'failed':
     case 'expired':
       return {
killedBy: ReportCard status badges should show "Failed" badge with red styling for failed status
statusReason: Unable to find an element with the text: Failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ObjectLiteral
src/components/reports/ReportCard.tsx:38:14
         className: 'bg-yellow-100 text-yellow-800',
       };
     case 'failed':
-      return {
-        label: 'Failed',
-        className: 'bg-red-100 text-red-800',
-      };
+      return {};
     case 'expired':
       return {
killedBy: ReportCard status badges should show "Failed" badge with red styling for failed status
statusReason: Unable to find an element with the text: Failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:42:5
         label: 'Failed',
         className: 'bg-red-100 text-red-800',
       };
-    case 'expired':
-      return {
-        label: 'Expired',
-        className: 'bg-gray-100 text-gray-800',
-      };
+    case 'expired':
     default:
       return {
killedBy: ReportCard status badges should show "Expired" badge with gray styling for expired status
statusReason: Unable to find an element with the text: Expired. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:42:10
         label: 'Failed',
         className: 'bg-red-100 text-red-800',
       };
-    case 'expired':
+    case "":
       return {
         label: 'Expired',
killedBy: ReportCard status badges should show "Expired" badge with gray styling for expired status
statusReason: Unable to find an element with the text: Expired. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:47:5
         label: 'Expired',
         className: 'bg-gray-100 text-gray-800',
       };
-    default:
-      return {
-        label: 'Unknown',
-        className: 'bg-gray-100 text-gray-800',
-      };
+    default:
   }
 }
killedBy: ReportCard status badges should show "Unknown" badge for unknown status
statusReason: Cannot read properties of undefined (reading 'className')

[Killed] ObjectLiteral
src/components/reports/ReportCard.tsx:48:14
         className: 'bg-gray-100 text-gray-800',
       };
     default:
-      return {
-        label: 'Unknown',
-        className: 'bg-gray-100 text-gray-800',
-      };
+      return {};
   }
 }
killedBy: ReportCard status badges should show "Unknown" badge for unknown status
statusReason: Unable to find an element with the text: Unknown. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:49:16
       };
     default:
       return {
-        label: 'Unknown',
+        label: "",
         className: 'bg-gray-100 text-gray-800',
       };
killedBy: ReportCard status badges should show "Unknown" badge for unknown status
statusReason: Unable to find an element with the text: Unknown. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] BlockStatement
src/components/reports/ReportCard.tsx:58:49
 /**
  * Format date for display
  */
-function formatDate(dateString: string): string {
-  const date = new Date(dateString);
-  const now = new Date();
-  const diffMs = now.getTime() - date.getTime();
-  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
-
-  if (diffDays === 0) {
-    const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
-    if (diffHours === 0) {
-      const diffMins = Math.floor(diffMs / (1000 * 60));
-      return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
-    }
-    return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
-  }
-
-  if (diffDays === 1) return 'Yesterday';
-  if (diffDays < 7) return `${diffDays} days ago`;
-
-  return date.toLocaleDateString(undefined, {
-    month: 'short',
-    day: 'numeric',
-    year: date.getFullYear() !== now.getFullYear() ? 'numeric' : undefined,
-  });
-}
+function formatDate(dateString: string): string {}
 
 /**
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:61:18
 function formatDate(dateString: string): string {
   const date = new Date(dateString);
   const now = new Date();
-  const diffMs = now.getTime() - date.getTime();
+  const diffMs = now.getTime() + date.getTime();
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:62:41
   const date = new Date(dateString);
   const now = new Date();
   const diffMs = now.getTime() - date.getTime();
-  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
+  const diffDays = Math.floor(diffMs / (1000 * 60 / 60 * 24));
 
   if (diffDays === 0) {
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:62:31
   const date = new Date(dateString);
   const now = new Date();
   const diffMs = now.getTime() - date.getTime();
-  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
+  const diffDays = Math.floor(diffMs * (1000 * 60 * 60 * 24));
 
   if (diffDays === 0) {
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:64:7
   const diffMs = now.getTime() - date.getTime();
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
-  if (diffDays === 0) {
+  if (diffDays !== 0) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:64:7
   const diffMs = now.getTime() - date.getTime();
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
-  if (diffDays === 0) {
+  if (true) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
killedBy: ReportCard date formatting should show "Yesterday" for yesterday
statusReason: Unable to find an element with the text: Yesterday. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:65:44
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
   if (diffDays === 0) {
-    const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
+    const diffHours = Math.floor(diffMs / (1000 * 60 / 60));
     if (diffHours === 0) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:65:44
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
   if (diffDays === 0) {
-    const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
+    const diffHours = Math.floor(diffMs / (1000 / 60 * 60));
     if (diffHours === 0) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:66:9
 
   if (diffDays === 0) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
-    if (diffHours === 0) {
+    if (true) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
killedBy: ReportCard date formatting should show "X hours ago" for same-day dates
statusReason: Unable to find an element with the text: 3 hours ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:66:9
 
   if (diffDays === 0) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
-    if (diffHours === 0) {
+    if (diffHours !== 0) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:67:45
   if (diffDays === 0) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
-      const diffMins = Math.floor(diffMs / (1000 * 60));
+      const diffMins = Math.floor(diffMs / (1000 / 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
     }
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ArithmeticOperator
src/components/reports/ReportCard.tsx:67:35
   if (diffDays === 0) {
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
-      const diffMins = Math.floor(diffMs / (1000 * 60));
+      const diffMins = Math.floor(diffMs * (1000 * 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
     }
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:68:32
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
-      return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
+      return `${diffMins} min${false ? 's' : ''} ago`;
     }
     return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:68:32
     const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
     if (diffHours === 0) {
       const diffMins = Math.floor(diffMs / (1000 * 60));
-      return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
+      return `${diffMins} min${diffMins === 1 ? 's' : ''} ago`;
     }
     return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
killedBy: ReportCard date formatting should show "X mins ago" for recent dates
statusReason: Unable to find an element with the text: 15 mins ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:70:32
       const diffMins = Math.floor(diffMs / (1000 * 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
     }
-    return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
+    return `${diffHours} hour${diffHours === 1 ? 's' : ''} ago`;
   }
 
killedBy: ReportCard date formatting should show "X hours ago" for same-day dates
statusReason: Unable to find an element with the text: 3 hours ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:70:32
       const diffMins = Math.floor(diffMs / (1000 * 60));
       return `${diffMins} min${diffMins !== 1 ? 's' : ''} ago`;
     }
-    return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
+    return `${diffHours} hour${false ? 's' : ''} ago`;
   }
 
killedBy: ReportCard date formatting should show "X hours ago" for same-day dates
statusReason: Unable to find an element with the text: 3 hours ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:73:7
     return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
   }
 
-  if (diffDays === 1) return 'Yesterday';
+  if (diffDays !== 1) return 'Yesterday';
   if (diffDays < 7) return `${diffDays} days ago`;
 
killedBy: ReportCard date formatting should show "Yesterday" for yesterday
statusReason: Unable to find an element with the text: Yesterday. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:73:7
     return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
   }
 
-  if (diffDays === 1) return 'Yesterday';
+  if (true) return 'Yesterday';
   if (diffDays < 7) return `${diffDays} days ago`;
 
killedBy: ReportCard date formatting should show "X days ago" for dates within a week
statusReason: Unable to find an element with the text: 3 days ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:74:7
   }
 
   if (diffDays === 1) return 'Yesterday';
-  if (diffDays < 7) return `${diffDays} days ago`;
+  if (true) return `${diffDays} days ago`;
 
   return date.toLocaleDateString(undefined, {
killedBy: ReportCard date formatting should show formatted date for older dates in same year
statusReason: Unable to find an element with the text: /Dec 20/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:74:7
   }
 
   if (diffDays === 1) return 'Yesterday';
-  if (diffDays < 7) return `${diffDays} days ago`;
+  if (false) return `${diffDays} days ago`;
 
   return date.toLocaleDateString(undefined, {
killedBy: ReportCard date formatting should show "X days ago" for dates within a week
statusReason: Unable to find an element with the text: 3 days ago. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:77:12
   if (diffDays < 7) return `${diffDays} days ago`;
 
   return date.toLocaleDateString(undefined, {
-    month: 'short',
+    month: "",
     day: 'numeric',
     year: date.getFullYear() !== now.getFullYear() ? 'numeric' : undefined,
killedBy: ReportCard date formatting should show formatted date for older dates in same year
statusReason: Value  out of range for Date.prototype.toLocaleDateString options property month

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:79:11
   return date.toLocaleDateString(undefined, {
     month: 'short',
     day: 'numeric',
-    year: date.getFullYear() !== now.getFullYear() ? 'numeric' : undefined,
+    year: date.getFullYear() === now.getFullYear() ? 'numeric' : undefined,
   });
 }
killedBy: ReportCard date formatting should show formatted date for older dates in same year
statusReason: Unable to find an element with the text: /Dec 20/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:79:11
   return date.toLocaleDateString(undefined, {
     month: 'short',
     day: 'numeric',
-    year: date.getFullYear() !== now.getFullYear() ? 'numeric' : undefined,
+    year: false ? 'numeric' : undefined,
   });
 }
killedBy: ReportCard date formatting should show formatted date for older dates in same year
statusReason: Unable to find an element with the text: /Dec 20/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] BlockStatement
src/components/reports/ReportCard.tsx:86:71
 /**
  * Truncate query text for display
  */
-function truncateQuery(query: string, maxLength: number = 60): string {
-  if (query.length <= maxLength) return query;
-  return `${query.substring(0, maxLength)}...`;
-}
+function truncateQuery(query: string, maxLength: number = 60): string {}
 
 export function ReportCard({ report, compact = false }: ReportCardProps) {
killedBy: ReportCard query truncation should not truncate short queries
statusReason: Unable to find an element with the text: Short query. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4
