[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:87:7
  * Truncate query text for display
  */
 function truncateQuery(query: string, maxLength: number = 60): string {
-  if (query.length <= maxLength) return query;
+  if (true) return query;
   return `${query.substring(0, maxLength)}...`;
 }
killedBy: ReportCard query truncation should truncate long queries with ellipsis in normal mode
statusReason: expected 'This is a very long query that should…' to contain '...'

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:87:7
  * Truncate query text for display
  */
 function truncateQuery(query: string, maxLength: number = 60): string {
-  if (query.length <= maxLength) return query;
+  if (query.length > maxLength) return query;
   return `${query.substring(0, maxLength)}...`;
 }
killedBy: ReportCard query truncation should not truncate short queries
statusReason: Unable to find an element with the text: Short query. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] MethodExpression
src/components/reports/ReportCard.tsx:88:13
  */
 function truncateQuery(query: string, maxLength: number = 60): string {
   if (query.length <= maxLength) return query;
-  return `${query.substring(0, maxLength)}...`;
+  return `${query}...`;
 }
 
killedBy: ReportCard query truncation should truncate long queries with ellipsis in normal mode
statusReason: expected 131 to be less than 128

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:88:10
  */
 function truncateQuery(query: string, maxLength: number = 60): string {
   if (query.length <= maxLength) return query;
-  return `${query.substring(0, maxLength)}...`;
+  return ``;
 }
 
killedBy: ReportCard query truncation should truncate long queries with ellipsis in normal mode
statusReason: expected '' to contain '...'

[Killed] BooleanLiteral
src/components/reports/ReportCard.tsx:91:48
   return `${query.substring(0, maxLength)}...`;
 }
 
-export function ReportCard({ report, compact = false }: ReportCardProps) {
+export function ReportCard({ report, compact = true }: ReportCardProps) {
   const router = useRouter();
   const statusBadge = getStatusBadge(report.status);
killedBy: ReportCard compact mode should apply normal spacing in default mode
statusReason: expect(element).toHaveClass("space-y-3")

Expected the element to have class:
  space-y-3
Received:
  cursor-pointer rounded-lg border border-gray-200 bg-white p-4 transition-all duration-200 hover:border-blue-400 hover:shadow-md space-y-2

[Killed] BlockStatement
src/components/reports/ReportCard.tsx:95:29
   const router = useRouter();
   const statusBadge = getStatusBadge(report.status);
 
-  const handleClick = () => {
-    router.push(`/report/${report.id}`);
-  };
+  const handleClick = () => {};
 
   return (
killedBy: ReportCard navigation should navigate to report on click
statusReason: expected "spy" to be called with arguments: [ '/report/test-123' ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:105:21
       className={`
         cursor-pointer rounded-lg border border-gray-200 bg-white p-4
         transition-all duration-200 hover:border-blue-400 hover:shadow-md
-        ${compact ? 'space-y-2' : 'space-y-3'}
+        ${compact ? "" : 'space-y-3'}
       `}
       role="button"
killedBy: ReportCard compact mode should apply compact spacing in compact mode
statusReason: expect(element).toHaveClass("space-y-2")

Expected the element to have class:
  space-y-2
Received:
  cursor-pointer rounded-lg border border-gray-200 bg-white p-4 transition-all duration-200 hover:border-blue-400 hover:shadow-md

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:105:35
       className={`
         cursor-pointer rounded-lg border border-gray-200 bg-white p-4
         transition-all duration-200 hover:border-blue-400 hover:shadow-md
-        ${compact ? 'space-y-2' : 'space-y-3'}
+        ${compact ? 'space-y-2' : ""}
       `}
       role="button"
killedBy: ReportCard compact mode should apply normal spacing in default mode
statusReason: expect(element).toHaveClass("space-y-3")

Expected the element to have class:
  space-y-3
Received:
  cursor-pointer rounded-lg border border-gray-200 bg-white p-4 transition-all duration-200 hover:border-blue-400 hover:shadow-md

[Killed] BlockStatement
src/components/reports/ReportCard.tsx:109:25
       `}
       role="button"
       tabIndex={0}
-      onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
-          e.preventDefault();
-          handleClick();
-        }
-      }}
+      onKeyDown={(e) => {}}
     >
       <div className="flex items-start justify-between gap-2">
killedBy: ReportCard navigation should navigate to report on Enter key
statusReason: expected "spy" to be called with arguments: [ '/report/test-123' ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/components/reports/ReportCard.tsx:110:13
       role="button"
       tabIndex={0}
       onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
+        if (e.key !== 'Enter' || e.key === ' ') {
           e.preventDefault();
           handleClick();
killedBy: ReportCard navigation should navigate to report on Enter key
statusReason: expected "spy" to be called with arguments: [ '/report/test-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:110:34
       role="button"
       tabIndex={0}
       onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
+        if (e.key === 'Enter' || false) {
           e.preventDefault();
           handleClick();
killedBy: ReportCard navigation should navigate to report on Space key
statusReason: expected "spy" to be called with arguments: [ '/report/test-123' ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/components/reports/ReportCard.tsx:120:25
         <h3
           className={`
             font-medium text-gray-900 line-clamp-2
-            ${compact ? 'text-sm' : 'text-base'}
+            ${compact ? "" : 'text-base'}
           `}
           title={report.query}
killedBy: ReportCard compact mode should apply smaller text in compact mode
statusReason: expect(element).toHaveClass("text-sm")

Expected the element to have class:
  text-sm
Received:
  font-medium text-gray-900 line-clamp-2

[Survived] StringLiteral
src/components/reports/ReportCard.tsx:136:60
         </span>
       </div>
 
-      <div className={`flex items-center gap-4 ${compact ? 'text-xs' : 'text-sm'} text-gray-500`}>
+      <div className={`flex items-center gap-4 ${compact ? "" : 'text-sm'} text-gray-500`}>
         <div className="flex items-center gap-1">
           <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:149:10
           <span>{formatDate(report.createdAt)}</span>
         </div>
 
-        {report.expires_at && report.status !== 'expired' && (
-          <div className="flex items-center gap-1 text-orange-600">
-            <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-              <path
-                strokeLinecap="round"
-                strokeLinejoin="round"
-                strokeWidth={2}
-                d="M12 8v4l3 3m6-3a9 9 0 11-18 0 9 9 0 0118 0z"
-              />
-            </svg>
-            <span>
-              Expires
-              {' '}
-              {formatDate(report.expires_at)}
-            </span>
-          </div>
-        )}
+        {false}
       </div>
 
killedBy: ReportCard expiration display should show expiration date when expires_at is set and not expired
statusReason: Unable to find an element with the text: /Expires/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] LogicalOperator
src/components/reports/ReportCard.tsx:149:10
           <span>{formatDate(report.createdAt)}</span>
         </div>
 
-        {report.expires_at && report.status !== 'expired' && (
-          <div className="flex items-center gap-1 text-orange-600">
-            <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-              <path
-                strokeLinecap="round"
-                strokeLinejoin="round"
-                strokeWidth={2}
-                d="M12 8v4l3 3m6-3a9 9 0 11-18 0 9 9 0 0118 0z"
-              />
-            </svg>
-            <span>
-              Expires
-              {' '}
-              {formatDate(report.expires_at)}
-            </span>
-          </div>
-        )}
+        {report.expires_at && report.status !== 'expired' || <div className="flex items-center gap-1 text-orange-600">
+            <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
+              <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M12 8v4l3 3m6-3a9 9 0 11-18 0 9 9 0 0118 0z" />
+            </svg>
+            <span>
+              Expires
+              {' '}
+              {formatDate(report.expires_at)}
+            </span>
+          </div>}
       </div>
 
killedBy: ReportCard expiration display should show expiration date when expires_at is set and not expired
statusReason: Unable to find an element with the text: /Expires/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] BooleanLiteral
src/components/reports/ReportCard.tsx:168:8
         )}
       </div>
 
-      {!compact && report.content?.total_citations && (
+      {compact && report.content?.total_citations && (
         <div className="flex items-center gap-1 text-xs text-gray-500">
           <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
killedBy: ReportCard citations display should show citation count in normal mode when content has citations
statusReason: Unable to find an element with the text: /12\s+sources cited/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Killed] OptionalChaining
src/components/reports/ReportCard.tsx:168:20
         )}
       </div>
 
-      {!compact && report.content?.total_citations && (
+      {!compact && report.content.total_citations && (
         <div className="flex items-center gap-1 text-xs text-gray-500">
           <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
killedBy: ReportCard status badges should show "Completed" badge with green styling for completed status
statusReason: Cannot read properties of undefined (reading 'total_citations')
