[Killed] BlockStatement
src/components/reports/ReportSection.tsx:17:71
   index: number;
 }
 
-export function ReportSection({ section, index }: ReportSectionProps) {
-  return (
-    <section className="mb-8">
-      <h2 className="text-2xl font-bold text-gray-900 mb-4 flex items-center gap-2">
-        <span className="text-blue-600">
-          {index}
-          .
-        </span>
-        {section.heading}
-      </h2>
-
-      <div className="prose prose-blue max-w-none mb-6">
-        <ReactMarkdown>{section.content}</ReactMarkdown>
-      </div>
-
-      {section.citations && section.citations.length > 0 && (
-        <CitationList citations={section.citations} />
-      )}
-    </section>
-  );
-}
+export function ReportSection({ section, index }: ReportSectionProps) {}
 
killedBy: ReportSection Basic Rendering should render section heading with index
statusReason: Unable to find an element with the text: 1.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/reports/ReportSection.tsx:32:8
         <ReactMarkdown>{section.content}</ReactMarkdown>
       </div>
 
-      {section.citations && section.citations.length > 0 && (
-        <CitationList citations={section.citations} />
-      )}
+      {true}
     </section>
   );
killedBy: ReportSection Citations Rendering should render citations when present
statusReason: Unable to find an element by: [data-testid="citation-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="mb-8"
    >

[Killed] ConditionalExpression
src/components/reports/ReportSection.tsx:32:8
         <ReactMarkdown>{section.content}</ReactMarkdown>
       </div>
 
-      {section.citations && section.citations.length > 0 && (
+      {true && (
         <CitationList citations={section.citations} />
       )}
killedBy: ReportSection Citations Rendering should not render citations when array is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="citation-list"
>
  Citations: 
  0
</div> instead
