[Killed] BooleanLiteral
src/components/reports/ReportSidebar.tsx:21:16
     reports, isLoading, error, refetch,
   } = useReports({
     limit: maxReports,
-    autoFetch: true,
+    autoFetch: false,
   });
 
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] BlockStatement
src/components/reports/ReportSidebar.tsx:25:18
   });
 
   // Loading state
-  if (isLoading) {
-    return (
-      <div className="w-full rounded-lg border border-gray-200 bg-white p-6">
-        <div className="mb-4 flex items-center justify-between">
-          <h2 className="text-lg font-semibold text-gray-900">Recent Reports</h2>
-        </div>
-        <div className="space-y-3">
-          {[1, 2, 3].map((i) => (
-            <div
-              key={i}
-              className="h-24 animate-pulse rounded-lg bg-gray-100"
-            />
-          ))}
-        </div>
-      </div>
-    );
-  }
+  if (isLoading) {}
 
   // Error state
killedBy: ReportSidebar Loading State displays loading skeleton when isLoading is true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/reports/ReportSidebar.tsx:25:7
   });
 
   // Loading state
-  if (isLoading) {
+  if (false) {
     return (
       <div className="w-full rounded-lg border border-gray-200 bg-white p-6">
killedBy: ReportSidebar Loading State displays loading skeleton when isLoading is true
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/components/reports/ReportSidebar.tsx:32:26
           <h2 className="text-lg font-semibold text-gray-900">Recent Reports</h2>
         </div>
         <div className="space-y-3">
-          {[1, 2, 3].map((i) => (
-            <div
-              key={i}
-              className="h-24 animate-pulse rounded-lg bg-gray-100"
-            />
-          ))}
+          {[1, 2, 3].map(() => undefined)}
         </div>
       </div>
killedBy: ReportSidebar Loading State displays loading skeleton when isLoading is true
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/components/reports/ReportSidebar.tsx:32:12
           <h2 className="text-lg font-semibold text-gray-900">Recent Reports</h2>
         </div>
         <div className="space-y-3">
-          {[1, 2, 3].map((i) => (
+          {[].map((i) => (
             <div
               key={i}
killedBy: ReportSidebar Loading State displays loading skeleton when isLoading is true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/reports/ReportSidebar.tsx:44:14
   }
 
   // Error state
-  if (error) {
-    return (
-      <div className="w-full rounded-lg border border-red-200 bg-red-50 p-6">
-        <div className="mb-2 flex items-center gap-2 text-red-800">
-          <svg className="h-5 w-5" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-            <path
-              strokeLinecap="round"
-              strokeLinejoin="round"
-              strokeWidth={2}
-              d="M12 8v4m0 4h.01M21 12a9 9 0 11-18 0 9 9 0 0118 0z"
-            />
-          </svg>
-          <h3 className="font-medium">Failed to load reports</h3>
-        </div>
-        <p className="mb-3 text-sm text-red-700">{error}</p>
-        <button
-          onClick={refetch}
-          className="text-sm text-red-800 underline hover:text-red-900"
-        >
-          Try again
-        </button>
-      </div>
-    );
-  }
+  if (error) {}
 
   // Empty state
killedBy: ReportSidebar Error State displays error message when error occurs
statusReason: Unable to find an element with the text: Failed to load reports. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] ConditionalExpression
src/components/reports/ReportSidebar.tsx:44:7
   }
 
   // Error state
-  if (error) {
+  if (true) {
     return (
       <div className="w-full rounded-lg border border-red-200 bg-red-50 p-6">
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-red-200 bg-red-50 p-6"
    >

[Killed] ConditionalExpression
src/components/reports/ReportSidebar.tsx:70:7
   }
 
   // Empty state
-  if (reports.length === 0) {
+  if (true) {
     return (
       <div className="w-full rounded-lg border border-gray-200 bg-white p-6">
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] EqualityOperator
src/components/reports/ReportSidebar.tsx:70:7
   }
 
   // Empty state
-  if (reports.length === 0) {
+  if (reports.length !== 0) {
     return (
       <div className="w-full rounded-lg border border-gray-200 bg-white p-6">
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] ArrowFunction
src/components/reports/ReportSidebar.tsx:125:22
       </div>
 
       <div className="space-y-3">
-        {reports.map((report) => (
-          <ReportCard key={report.id} report={report} compact />
-        ))}
+        {reports.map(() => undefined)}
       </div>
 
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] ConditionalExpression
src/components/reports/ReportSidebar.tsx:130:8
         ))}
       </div>
 
-      {reports.length >= maxReports && (
-        <div className="mt-4 border-t border-gray-200 pt-4 text-center">
-          <Link
-            href="/reports"
-            className="inline-flex items-center gap-2 text-sm font-medium text-blue-600 hover:text-blue-700"
-          >
-            <span>View all reports</span>
-            <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-              <path
-                strokeLinecap="round"
-                strokeLinejoin="round"
-                strokeWidth={2}
-                d="M9 5l7 7-7 7"
-              />
-            </svg>
-          </Link>
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: ReportSidebar Reports List (T130) displays View all reports link at bottom when at max limit
statusReason: expected 1 to be greater than 1

[Killed] EqualityOperator
src/components/reports/ReportSidebar.tsx:130:8
         ))}
       </div>
 
-      {reports.length >= maxReports && (
+      {reports.length < maxReports && (
         <div className="mt-4 border-t border-gray-200 pt-4 text-center">
           <Link
killedBy: ReportSidebar Reports List (T130) displays View all reports link at bottom when at max limit
statusReason: expected 1 to be greater than 1
