[Killed] BooleanLiteral
src/hooks/useReports.ts:29:35
  * @returns Report data, loading state, and refetch function
  */
 export function useReports(options: UseReportsOptions = {}): UseReportsResult {
-  const { limit = 10, autoFetch = true } = options;
+  const { limit = 10, autoFetch = false } = options;
 
   const [reports, setReports] = useState<Report[]>([]);
killedBy: useReports Default behavior fetches reports automatically by default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useReports.ts:32:46
   const { limit = 10, autoFetch = true } = options;
 
   const [reports, setReports] = useState<Report[]>([]);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [hasMore, setHasMore] = useState(false);
killedBy: useReports Custom options respects autoFetch: false
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/hooks/useReports.ts:34:42
   const [reports, setReports] = useState<Report[]>([]);
   const [isLoading, setIsLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
-  const [hasMore, setHasMore] = useState(false);
+  const [hasMore, setHasMore] = useState(true);
 
   const fetchReports = useCallback(async () => {

[Killed] BlockStatement
src/hooks/useReports.ts:36:48
   const [error, setError] = useState<string | null>(null);
   const [hasMore, setHasMore] = useState(false);
 
-  const fetchReports = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      setError(null);
-
-      const endpoint = `/api/reports?limit=${limit}`;
-      const response = await api.get<Report[]>(endpoint);
-
-      if (response.error || !response.data) {
-        setError(response.error?.message || 'Failed to load reports');
-        setReports([]);
-        return;
-      }
-
-      setReports(response.data);
-      // If we received exactly 'limit' reports, there might be more
-      setHasMore(response.data.length === limit);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : 'Failed to load reports');
-      setReports([]);
-    } finally {
-      setIsLoading(false);
-    }
-  }, [limit]);
+  const fetchReports = useCallback(async () => {}, [limit]);
 
   useEffect(() => {
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] BlockStatement
src/hooks/useReports.ts:37:9
   const [hasMore, setHasMore] = useState(false);
 
   const fetchReports = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      setError(null);
-
-      const endpoint = `/api/reports?limit=${limit}`;
-      const response = await api.get<Report[]>(endpoint);
-
-      if (response.error || !response.data) {
-        setError(response.error?.message || 'Failed to load reports');
-        setReports([]);
-        return;
-      }
-
-      setReports(response.data);
-      // If we received exactly 'limit' reports, there might be more
-      setHasMore(response.data.length === limit);
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : 'Failed to load reports');
       setReports([]);
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Killed] BlockStatement
src/hooks/useReports.ts:44:45
       const endpoint = `/api/reports?limit=${limit}`;
       const response = await api.get<Report[]>(endpoint);
 
-      if (response.error || !response.data) {
-        setError(response.error?.message || 'Failed to load reports');
-        setReports([]);
-        return;
-      }
+      if (response.error || !response.data) {}
 
       setReports(response.data);
killedBy: useReports Error handling (T134) sets error message when API returns error
statusReason: expected 'Cannot read properties of null (readi…' to be 'Failed to fetch reports' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useReports.ts:45:18
       const response = await api.get<Report[]>(endpoint);
 
       if (response.error || !response.data) {
-        setError(response.error?.message || 'Failed to load reports');
+        setError(false);
         setReports([]);
         return;
killedBy: useReports Error handling (T134) sets error message when API returns error
statusReason: expected false to be 'Failed to fetch reports' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/hooks/useReports.ts:45:18
       const response = await api.get<Report[]>(endpoint);
 
       if (response.error || !response.data) {
-        setError(response.error?.message || 'Failed to load reports');
+        setError(response.error?.message && 'Failed to load reports');
         setReports([]);
         return;
killedBy: User Story 2: View Report History - Integration Tests T132: Reports are user-scoped (user A cannot see user B reports) displays error when unauthorized to access reports
statusReason: Found multiple elements with the text: Failed to load reports

Here are the matching elements:

Ignored nodes: comments, script, style
<h3
  class="font-medium"
>

[Killed] ConditionalExpression
src/hooks/useReports.ts:52:18
 
       setReports(response.data);
       // If we received exactly 'limit' reports, there might be more
-      setHasMore(response.data.length === limit);
+      setHasMore(false);
     } catch (err) {
       setError(err instanceof Error ? err.message : 'Failed to load reports');
killedBy: useReports Pagination support sets hasMore to true when exactly limit reports returned
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/hooks/useReports.ts:52:18
 
       setReports(response.data);
       // If we received exactly 'limit' reports, there might be more
-      setHasMore(response.data.length === limit);
+      setHasMore(response.data.length !== limit);
     } catch (err) {
       setError(err instanceof Error ? err.message : 'Failed to load reports');
killedBy: useReports Pagination support sets hasMore to true when exactly limit reports returned
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useReports.ts:53:19
       setReports(response.data);
       // If we received exactly 'limit' reports, there might be more
       setHasMore(response.data.length === limit);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : 'Failed to load reports');
-      setReports([]);
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }
killedBy: useReports Error handling (T134) handles exception during fetch
statusReason: expected null to be 'Network failure' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/hooks/useReports.ts:54:53
       // If we received exactly 'limit' reports, there might be more
       setHasMore(response.data.length === limit);
     } catch (err) {
-      setError(err instanceof Error ? err.message : 'Failed to load reports');
+      setError(err instanceof Error ? err.message : "");
       setReports([]);
     } finally {
killedBy: useReports Error handling (T134) handles non-Error exceptions
statusReason: expected '' to be 'Failed to load reports' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useReports.ts:56:15
     } catch (err) {
       setError(err instanceof Error ? err.message : 'Failed to load reports');
       setReports([]);
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   }, [limit]);
 
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Unable to find an element with the text: /Subject \d+ in UK/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full rounded-lg border border-gray-200 bg-white p-6"
    >

[Survived] ArrayDeclaration
src/hooks/useReports.ts:59:6
     } finally {
       setIsLoading(false);
     }
-  }, [limit]);
+  }, []);
 
   useEffect(() => {

[Killed] BlockStatement
src/hooks/useReports.ts:61:19
     }
   }, [limit]);
 
-  useEffect(() => {
-    if (autoFetch) {
-      fetchReports();
-    }
-  }, [autoFetch, fetchReports]);
+  useEffect(() => {}, [autoFetch, fetchReports]);
 
   return {
killedBy: useReports Default behavior fetches reports automatically by default
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useReports.ts:62:20
   }, [limit]);
 
   useEffect(() => {
-    if (autoFetch) {
-      fetchReports();
-    }
+    if (autoFetch) {}
   }, [autoFetch, fetchReports]);
 
killedBy: useReports Default behavior fetches reports automatically by default
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useReports.ts:62:9
   }, [limit]);
 
   useEffect(() => {
-    if (autoFetch) {
+    if (true) {
       fetchReports();
     }
killedBy: useReports Custom options respects autoFetch: false
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "/api/reports?limit=10",

[Killed] ObjectLiteral
src/hooks/useReports.ts:67:10
     }
   }, [autoFetch, fetchReports]);
 
-  return {
-    reports,
-    isLoading,
-    error,
-    refetch: fetchReports,
-    hasMore,
-  };
+  return {};
 }
 
killedBy: User Story 2: View Report History - Integration Tests T130: Sidebar displays all user reports (max 10 recent) displays maximum 10 most recent reports
statusReason: Cannot read properties of undefined (reading 'length')
