[Killed] BlockStatement
src/lib/clerk.ts:11:34
 /**
  * Get Clerk configuration
  */
-export function getClerkConfig() {
-  const config = getConfig();
-  return {
-    publishableKey: config.clerkPublishableKey,
-    secretKey: config.clerkSecretKey,
-  };
-}
+export function getClerkConfig() {}
 
 /**
killedBy: clerk getClerkConfig should return Clerk configuration from config
statusReason: expected undefined to deeply equal { publishableKey: 'pk_test_xxx', …(1) }

[Killed] ObjectLiteral
src/lib/clerk.ts:13:10
  */
 export function getClerkConfig() {
   const config = getConfig();
-  return {
-    publishableKey: config.clerkPublishableKey,
-    secretKey: config.clerkSecretKey,
-  };
+  return {};
 }
 
killedBy: clerk getClerkConfig should return Clerk configuration from config
statusReason: expected {} to deeply equal { publishableKey: 'pk_test_xxx', …(1) }

[Killed] BlockStatement
src/lib/clerk.ts:23:46
  * Check if Clerk is properly configured with real API keys
  * @returns true if Clerk has real keys, false if using placeholders
  */
-export function isClerkConfigured(): boolean {
-  const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-  const secretKey = process.env.CLERK_SECRET_KEY || '';
-
-  // Check if keys contain placeholder text
-  const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
-    || publishableKey.includes('your_')
-    || publishableKey === ''
-    || publishableKey === 'pk_test_your_clerk_publishable_key';
-
-  const hasPlaceholderSecret = secretKey.includes('YOUR_')
-    || secretKey.includes('your_')
-    || secretKey === ''
-    || secretKey === 'sk_test_your_clerk_secret_key';
-
-  return !hasPlaceholderPublishable && !hasPlaceholderSecret;
-}
+export function isClerkConfigured(): boolean {}
 
 /**
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:24:26
  * @returns true if Clerk has real keys, false if using placeholders
  */
 export function isClerkConfigured(): boolean {
-  const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
+  const publishableKey = true;
   const secretKey = process.env.CLERK_SECRET_KEY || '';
 
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: publishableKey.includes is not a function

[Killed] LogicalOperator
src/lib/clerk.ts:24:26
  * @returns true if Clerk has real keys, false if using placeholders
  */
 export function isClerkConfigured(): boolean {
-  const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
+  const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY && '';
   const secretKey = process.env.CLERK_SECRET_KEY || '';
 
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:25:21
  */
 export function isClerkConfigured(): boolean {
   const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-  const secretKey = process.env.CLERK_SECRET_KEY || '';
+  const secretKey = true;
 
   // Check if keys contain placeholder text
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: secretKey.includes is not a function

[Killed] LogicalOperator
src/lib/clerk.ts:25:21
  */
 export function isClerkConfigured(): boolean {
   const publishableKey = process.env.NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY || '';
-  const secretKey = process.env.CLERK_SECRET_KEY || '';
+  const secretKey = process.env.CLERK_SECRET_KEY && '';
 
   // Check if keys contain placeholder text
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:28:37
   const secretKey = process.env.CLERK_SECRET_KEY || '';
 
   // Check if keys contain placeholder text
-  const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
-    || publishableKey.includes('your_')
-    || publishableKey === ''
-    || publishableKey === 'pk_test_your_clerk_publishable_key';
+  const hasPlaceholderPublishable = true;
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/lib/clerk.ts:28:37
   const secretKey = process.env.CLERK_SECRET_KEY || '';
 
   // Check if keys contain placeholder text
-  const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
-    || publishableKey.includes('your_')
-    || publishableKey === ''
-    || publishableKey === 'pk_test_your_clerk_publishable_key';
+  const hasPlaceholderPublishable = (publishableKey.includes('YOUR_') || publishableKey.includes('your_') || publishableKey === '') && publishableKey === 'pk_test_your_clerk_publishable_key';
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
killedBy: clerk isClerkConfigured should return false when publishable key is empty
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/clerk.ts:29:32
 
   // Check if keys contain placeholder text
   const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
-    || publishableKey.includes('your_')
+    || publishableKey.includes("")
     || publishableKey === ''
     || publishableKey === 'pk_test_your_clerk_publishable_key';
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:30:8
   // Check if keys contain placeholder text
   const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
     || publishableKey.includes('your_')
-    || publishableKey === ''
+    || false
     || publishableKey === 'pk_test_your_clerk_publishable_key';
 
killedBy: clerk isClerkConfigured should return false when publishable key is empty
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/clerk.ts:30:8
   // Check if keys contain placeholder text
   const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
     || publishableKey.includes('your_')
-    || publishableKey === ''
+    || publishableKey !== ''
     || publishableKey === 'pk_test_your_clerk_publishable_key';
 
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/clerk.ts:31:8
   const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
     || publishableKey.includes('your_')
     || publishableKey === ''
-    || publishableKey === 'pk_test_your_clerk_publishable_key';
+    || publishableKey !== 'pk_test_your_clerk_publishable_key';
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/clerk.ts:31:8
   const hasPlaceholderPublishable = publishableKey.includes('YOUR_')
     || publishableKey.includes('your_')
     || publishableKey === ''
-    || publishableKey === 'pk_test_your_clerk_publishable_key';
+    || false;
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')

[Killed] ConditionalExpression
src/lib/clerk.ts:33:32
     || publishableKey === ''
     || publishableKey === 'pk_test_your_clerk_publishable_key';
 
-  const hasPlaceholderSecret = secretKey.includes('YOUR_')
-    || secretKey.includes('your_')
-    || secretKey === ''
-    || secretKey === 'sk_test_your_clerk_secret_key';
+  const hasPlaceholderSecret = false;
 
   return !hasPlaceholderPublishable && !hasPlaceholderSecret;
killedBy: clerk isClerkConfigured should return false when secret key is empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:33:32
     || publishableKey === ''
     || publishableKey === 'pk_test_your_clerk_publishable_key';
 
-  const hasPlaceholderSecret = secretKey.includes('YOUR_')
-    || secretKey.includes('your_')
-    || secretKey === ''
+  const hasPlaceholderSecret = false
     || secretKey === 'sk_test_your_clerk_secret_key';
 
killedBy: clerk isClerkConfigured should return false when secret key is empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/clerk.ts:35:8
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
     || secretKey.includes('your_')
-    || secretKey === ''
+    || false
     || secretKey === 'sk_test_your_clerk_secret_key';
 
killedBy: clerk isClerkConfigured should return false when secret key is empty
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/clerk.ts:35:8
 
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
     || secretKey.includes('your_')
-    || secretKey === ''
+    || secretKey !== ''
     || secretKey === 'sk_test_your_clerk_secret_key';
 
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/clerk.ts:36:8
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
     || secretKey.includes('your_')
     || secretKey === ''
-    || secretKey === 'sk_test_your_clerk_secret_key';
+    || secretKey !== 'sk_test_your_clerk_secret_key';
 
   return !hasPlaceholderPublishable && !hasPlaceholderSecret;
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/clerk.ts:36:8
   const hasPlaceholderSecret = secretKey.includes('YOUR_')
     || secretKey.includes('your_')
     || secretKey === ''
-    || secretKey === 'sk_test_your_clerk_secret_key';
+    || false;
 
   return !hasPlaceholderPublishable && !hasPlaceholderSecret;

[Killed] LogicalOperator
src/lib/clerk.ts:38:10
     || secretKey === ''
     || secretKey === 'sk_test_your_clerk_secret_key';
 
-  return !hasPlaceholderPublishable && !hasPlaceholderSecret;
+  return !hasPlaceholderPublishable || !hasPlaceholderSecret;
 }
 
killedBy: clerk isClerkConfigured should return false when publishable key is empty
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/clerk.ts:38:40
     || secretKey === ''
     || secretKey === 'sk_test_your_clerk_secret_key';
 
-  return !hasPlaceholderPublishable && !hasPlaceholderSecret;
+  return !hasPlaceholderPublishable && hasPlaceholderSecret;
 }
 
killedBy: clerk isClerkConfigured should return true when both keys are properly configured
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/clerk.ts:45:76
  * Get Clerk configuration status message
  * @returns object with configured status and message
  */
-export function getClerkStatus(): { configured: boolean; message: string } {
-  const configured = isClerkConfigured();
-
-  if (configured) {
-    return {
-      configured: true,
-      message: 'Clerk authentication is properly configured',
-    };
-  }
-
-  return {
-    configured: false,
-    message: 'Clerk is using placeholder keys. Please configure real API keys in .env.local. See docs/CLERK-SETUP-GUIDE.md for instructions.',
-  };
-}
+export function getClerkStatus(): { configured: boolean; message: string } {}
 
killedBy: clerk getClerkStatus should return configured status when Clerk is properly configured
statusReason: Cannot read properties of undefined (reading 'configured')

[Killed] ConditionalExpression
src/lib/clerk.ts:48:7
 export function getClerkStatus(): { configured: boolean; message: string } {
   const configured = isClerkConfigured();
 
-  if (configured) {
+  if (true) {
     return {
       configured: true,
killedBy: clerk getClerkStatus should return not configured status when Clerk has placeholder keys
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/clerk.ts:48:19
 export function getClerkStatus(): { configured: boolean; message: string } {
   const configured = isClerkConfigured();
 
-  if (configured) {
-    return {
-      configured: true,
-      message: 'Clerk authentication is properly configured',
-    };
-  }
+  if (configured) {}
 
   return {
killedBy: clerk getClerkStatus should return configured status when Clerk is properly configured
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/clerk.ts:50:19
 
   if (configured) {
     return {
-      configured: true,
+      configured: false,
       message: 'Clerk authentication is properly configured',
     };
killedBy: clerk getClerkStatus should return configured status when Clerk is properly configured
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/clerk.ts:56:17
   }
 
   return {
-    configured: false,
+    configured: true,
     message: 'Clerk is using placeholder keys. Please configure real API keys in .env.local. See docs/CLERK-SETUP-GUIDE.md for instructions.',
   };
killedBy: clerk getClerkStatus should return not configured status when Clerk has placeholder keys
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/clerk.ts:57:14
 
   return {
     configured: false,
-    message: 'Clerk is using placeholder keys. Please configure real API keys in .env.local. See docs/CLERK-SETUP-GUIDE.md for instructions.',
+    message: "",
   };
 }
killedBy: clerk getClerkStatus should return not configured status when Clerk has placeholder keys
statusReason: expected '' to contain 'placeholder keys'
