[Killed] BlockStatement
src/lib/config.ts:18:55
  * Initialize configuration loader
  * Should be called once at app startup
  */
-export function initializeConfig(): EnvironmentConfig {
-  if (configInstance) {
-    return configInstance;
-  }
-
-  try {
-    // ConfigLoader has static methods - use ConfigLoader.load() directly
-    configInstance = ConfigLoader.load();
-
-    // In development, log successful initialization
-    if (configInstance.ENVIRONMENT_MODE === 'dev') {
-      console.log('[Config] Configuration initialized successfully', {
-        mode: configInstance.ENVIRONMENT_MODE,
-        enableSupabase: configInstance.ENABLE_SUPABASE,
-        enablePayments: configInstance.ENABLE_PAYMENTS,
-      });
-    }
-
-    return configInstance;
-  } catch (error) {
-    console.error('[Config] Failed to initialize configuration:', error);
-    throw error;
-  }
-}
+export function initializeConfig(): EnvironmentConfig {}
 
 /**
killedBy: config initializeConfig should initialize configuration successfully
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/lib/config.ts:19:7
  * Should be called once at app startup
  */
 export function initializeConfig(): EnvironmentConfig {
-  if (configInstance) {
+  if (true) {
     return configInstance;
   }
killedBy: config initializeConfig should initialize configuration successfully
statusReason: Cannot read properties of null (reading 'ENVIRONMENT_MODE')

[Killed] ConditionalExpression
src/lib/config.ts:19:7
  * Should be called once at app startup
  */
 export function initializeConfig(): EnvironmentConfig {
-  if (configInstance) {
+  if (false) {
     return configInstance;
   }
killedBy: config initializeConfig should return same instance on multiple calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/lib/config.ts:23:7
     return configInstance;
   }
 
-  try {
-    // ConfigLoader has static methods - use ConfigLoader.load() directly
-    configInstance = ConfigLoader.load();
-
-    // In development, log successful initialization
-    if (configInstance.ENVIRONMENT_MODE === 'dev') {
-      console.log('[Config] Configuration initialized successfully', {
-        mode: configInstance.ENVIRONMENT_MODE,
-        enableSupabase: configInstance.ENABLE_SUPABASE,
-        enablePayments: configInstance.ENABLE_PAYMENTS,
-      });
-    }
-
-    return configInstance;
-  } catch (error) {
+  try {} catch (error) {
     console.error('[Config] Failed to initialize configuration:', error);
     throw error;
killedBy: config initializeConfig should initialize configuration successfully
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/lib/config.ts:28:9
     configInstance = ConfigLoader.load();
 
     // In development, log successful initialization
-    if (configInstance.ENVIRONMENT_MODE === 'dev') {
+    if (false) {
       console.log('[Config] Configuration initialized successfully', {
         mode: configInstance.ENVIRONMENT_MODE,
killedBy: config initializeConfig should log initialization in development mode
statusReason: expected "log" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/config.ts:28:9
     configInstance = ConfigLoader.load();
 
     // In development, log successful initialization
-    if (configInstance.ENVIRONMENT_MODE === 'dev') {
+    if (true) {
       console.log('[Config] Configuration initialized successfully', {
         mode: configInstance.ENVIRONMENT_MODE,
killedBy: config initializeConfig should not log in non-development mode
statusReason: expected "log" to not be called at all, but actually been called 1 times

Received: 

  1st log call:

    Array [
      "[Config] Configuration initialized successfully",

[Killed] ObjectLiteral
src/lib/config.ts:29:70
 
     // In development, log successful initialization
     if (configInstance.ENVIRONMENT_MODE === 'dev') {
-      console.log('[Config] Configuration initialized successfully', {
-        mode: configInstance.ENVIRONMENT_MODE,
-        enableSupabase: configInstance.ENABLE_SUPABASE,
-        enablePayments: configInstance.ENABLE_PAYMENTS,
-      });
+      console.log('[Config] Configuration initialized successfully', {});
     }
 
killedBy: config initializeConfig should log initialization in development mode
statusReason: expected "log" to be called with arguments: [ …(2) ]

Received: 

  1st log call:

  Array [
    "[Config] Configuration initialized successfully",

[Killed] BlockStatement
src/lib/config.ts:37:19
     }
 
     return configInstance;
-  } catch (error) {
-    console.error('[Config] Failed to initialize configuration:', error);
-    throw error;
-  }
+  } catch (error) {}
 }
 
killedBy: config initializeConfig should throw error if ConfigLoader fails
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/config.ts:47:48
  * Get the current configuration
  * Throws if configuration hasn't been initialized
  */
-export function getConfig(): EnvironmentConfig {
-  if (!configInstance) {
-    throw new Error('Configuration not initialized. Call initializeConfig() first.');
-  }
-  return configInstance;
-}
+export function getConfig(): EnvironmentConfig {}
 
 /**
killedBy: config getConfig should return initialized config
statusReason: expected undefined not to be undefined

[Killed] BooleanLiteral
src/lib/config.ts:48:7
  * Throws if configuration hasn't been initialized
  */
 export function getConfig(): EnvironmentConfig {
-  if (!configInstance) {
+  if (configInstance) {
     throw new Error('Configuration not initialized. Call initializeConfig() first.');
   }
killedBy: config getConfig should return initialized config
statusReason: Configuration not initialized. Call initializeConfig() first.

[Killed] ConditionalExpression
src/lib/config.ts:48:7
  * Throws if configuration hasn't been initialized
  */
 export function getConfig(): EnvironmentConfig {
-  if (!configInstance) {
+  if (true) {
     throw new Error('Configuration not initialized. Call initializeConfig() first.');
   }
killedBy: config getConfig should return initialized config
statusReason: Configuration not initialized. Call initializeConfig() first.

[Killed] BlockStatement
src/lib/config.ts:59:25
  */
 export function getConfigValue<K extends keyof EnvironmentConfig>(
   key: K,
-): EnvironmentConfig[K] {
-  return getConfig()[key];
-}
+): EnvironmentConfig[K] {}
 
 /**
killedBy: config getConfigValue should return specific config value
statusReason: expected undefined to be 'production' // Object.is equality

[Killed] BlockStatement
src/lib/config.ts:70:35
  * This should be used in client components to avoid accidentally
  * exposing server-side secrets
  */
-export function getClientConfig() {
-  const config = getConfig();
-
-  return {
-    mode: config.ENVIRONMENT_MODE,
-    apiUrl: config.NEXT_PUBLIC_API_URL,
-    enableSupabase: config.ENABLE_SUPABASE,
-    enablePayments: config.ENABLE_PAYMENTS,
-    supabaseUrl: config.SUPABASE_URL,
-    // Note: anon key is safe to expose (it's public)
-    supabaseAnonKey: config.SUPABASE_ANON_KEY,
-  };
-}
+export function getClientConfig() {}
 
 /**
killedBy: config getClientConfig should return only client-safe configuration
statusReason: expected undefined to deeply equal { mode: 'dev', …(5) }

[Killed] BlockStatement
src/lib/config.ts:87:42
 /**
  * Check if we're running in development mode
  */
-export function isDevelopment(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'dev';
-}
+export function isDevelopment(): boolean {}
 
 /**
killedBy: config Environment mode helpers isDevelopment should return true in development mode
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/config.ts:88:10
  * Check if we're running in development mode
  */
 export function isDevelopment(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'dev';
+  return true;
 }
 
killedBy: config Environment mode helpers isDevelopment should return false in non-development mode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/config.ts:88:10
  * Check if we're running in development mode
  */
 export function isDevelopment(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'dev';
+  return false;
 }
 
killedBy: config Environment mode helpers isDevelopment should return true in development mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/config.ts:94:41
 /**
  * Check if we're running in production mode
  */
-export function isProduction(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'production';
-}
+export function isProduction(): boolean {}
 
 /**
killedBy: config Environment mode helpers isProduction should return true in production mode
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/lib/config.ts:95:10
  * Check if we're running in production mode
  */
 export function isProduction(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'production';
+  return getConfig().ENVIRONMENT_MODE !== 'production';
 }
 
killedBy: config Environment mode helpers isProduction should return true in production mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/config.ts:95:10
  * Check if we're running in production mode
  */
 export function isProduction(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'production';
+  return true;
 }
 
killedBy: config Environment mode helpers isProduction should return false in non-production mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/config.ts:101:35
 /**
  * Check if we're running in test mode
  */
-export function isTest(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'test';
-}
+export function isTest(): boolean {}
 
 /**
killedBy: config Environment mode helpers isTest should return true in test mode
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/config.ts:102:10
  * Check if we're running in test mode
  */
 export function isTest(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'test';
+  return true;
 }
 
killedBy: config Environment mode helpers isTest should return false in non-test mode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/config.ts:102:10
  * Check if we're running in test mode
  */
 export function isTest(): boolean {
-  return getConfig().ENVIRONMENT_MODE === 'test';
+  return false;
 }
 
killedBy: config Environment mode helpers isTest should return true in test mode
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/config.ts:110:30
  * Throws descriptive errors if validation fails
  */
 export function validateEnvironment(): void {
-  const requiredClientVars = [
-    'NEXT_PUBLIC_API_URL',
-    'NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY',
-  ];
+  const requiredClientVars = [];
 
   const requiredServerVars = [
killedBy: config validateEnvironment should throw error if NEXT_PUBLIC_API_URL is missing
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/config.ts:111:5
  */
 export function validateEnvironment(): void {
   const requiredClientVars = [
-    'NEXT_PUBLIC_API_URL',
+    "",
     'NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY',
   ];
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/lib/config.ts:112:5
 export function validateEnvironment(): void {
   const requiredClientVars = [
     'NEXT_PUBLIC_API_URL',
-    'NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY',
+    "",
   ];
 
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] BlockStatement
src/lib/config.ts:122:43
   const missing: string[] = [];
 
   // Check client-side variables
-  requiredClientVars.forEach((varName) => {
-    if (!process.env[varName]) {
-      missing.push(varName);
-    }
-  });
+  requiredClientVars.forEach((varName) => {});
 
   // Check server-side variables (only on server)
killedBy: config validateEnvironment should throw error if NEXT_PUBLIC_API_URL is missing
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/config.ts:123:32
 
   // Check client-side variables
   requiredClientVars.forEach((varName) => {
-    if (!process.env[varName]) {
-      missing.push(varName);
-    }
+    if (!process.env[varName]) {}
   });
 
killedBy: config validateEnvironment should throw error if NEXT_PUBLIC_API_URL is missing
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/config.ts:123:9
 
   // Check client-side variables
   requiredClientVars.forEach((varName) => {
-    if (!process.env[varName]) {
+    if (true) {
       missing.push(varName);
     }
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] BlockStatement
src/lib/config.ts:129:38
   });
 
   // Check server-side variables (only on server)
-  if (typeof window === 'undefined') {
-    requiredServerVars.forEach((varName) => {
-      if (!process.env[varName]) {
-        missing.push(varName);
-      }
-    });
-  }
+  if (typeof window === 'undefined') {}
 
   if (missing.length > 0) {
killedBy: config validateEnvironment should throw error if CLERK_SECRET_KEY is missing on server
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/config.ts:129:7
   });
 
   // Check server-side variables (only on server)
-  if (typeof window === 'undefined') {
+  if (true) {
     requiredServerVars.forEach((varName) => {
       if (!process.env[varName]) {
killedBy: config validateEnvironment should not check server variables on client
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] BlockStatement
src/lib/config.ts:130:45
 
   // Check server-side variables (only on server)
   if (typeof window === 'undefined') {
-    requiredServerVars.forEach((varName) => {
-      if (!process.env[varName]) {
-        missing.push(varName);
-      }
-    });
+    requiredServerVars.forEach((varName) => {});
   }
 
killedBy: config validateEnvironment should throw error if CLERK_SECRET_KEY is missing on server
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/config.ts:131:11
   // Check server-side variables (only on server)
   if (typeof window === 'undefined') {
     requiredServerVars.forEach((varName) => {
-      if (!process.env[varName]) {
+      if (true) {
         missing.push(varName);
       }
killedBy: config validateEnvironment should not validate Stripe on server
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] BlockStatement
src/lib/config.ts:131:34
   // Check server-side variables (only on server)
   if (typeof window === 'undefined') {
     requiredServerVars.forEach((varName) => {
-      if (!process.env[varName]) {
-        missing.push(varName);
-      }
+      if (!process.env[varName]) {}
     });
   }
killedBy: config validateEnvironment should throw error if CLERK_SECRET_KEY is missing on server
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/config.ts:137:7
     });
   }
 
-  if (missing.length > 0) {
+  if (missing.length >= 0) {
     const errorMessage = `Missing required environment variables:\n${missing.join('\n')}`;
     console.error('[Config]', errorMessage);
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] EqualityOperator
src/lib/config.ts:137:7
     });
   }
 
-  if (missing.length > 0) {
+  if (missing.length <= 0) {
     const errorMessage = `Missing required environment variables:\n${missing.join('\n')}`;
     console.error('[Config]', errorMessage);
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] ConditionalExpression
src/lib/config.ts:146:7
   // Validate optional variables based on feature flags
   const config = getConfig();
 
-  if (config.ENABLE_SUPABASE) {
+  if (false) {
     if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
       throw new Error(
killedBy: config validateEnvironment should validate Supabase config when enabled
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/config.ts:146:7
   // Validate optional variables based on feature flags
   const config = getConfig();
 
-  if (config.ENABLE_SUPABASE) {
+  if (true) {
     if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
       throw new Error(
killedBy: config validateEnvironment should pass validation with all required variables
statusReason: expected [Function] to not throw an error but 'Error: Supabase is enabled but NEXT_P…' was thrown

[Killed] BooleanLiteral
src/lib/config.ts:147:9
   const config = getConfig();
 
   if (config.ENABLE_SUPABASE) {
-    if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
+    if (config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
       throw new Error(
         'Supabase is enabled but NEXT_PUBLIC_SUPABASE_URL or NEXT_PUBLIC_SUPABASE_ANON_KEY is missing',
killedBy: config validateEnvironment should pass Supabase validation when properly configured
statusReason: expected [Function] to not throw an error but 'Error: Supabase is enabled but NEXT_P…' was thrown

[Killed] BlockStatement
src/lib/config.ts:147:60
   const config = getConfig();
 
   if (config.ENABLE_SUPABASE) {
-    if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
-      throw new Error(
-        'Supabase is enabled but NEXT_PUBLIC_SUPABASE_URL or NEXT_PUBLIC_SUPABASE_ANON_KEY is missing',
-      );
-    }
+    if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {}
   }
 
killedBy: config validateEnvironment should validate Supabase config when enabled
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/config.ts:149:9
   if (config.ENABLE_SUPABASE) {
     if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
       throw new Error(
-        'Supabase is enabled but NEXT_PUBLIC_SUPABASE_URL or NEXT_PUBLIC_SUPABASE_ANON_KEY is missing',
+        "",
       );
     }
killedBy: config validateEnvironment should validate Supabase config when enabled
statusReason: expected [Function] to throw error matching /Supabase is enabled/ but got ''

[Killed] EqualityOperator
src/lib/config.ts:154:33
     }
   }
 
-  if (config.ENABLE_PAYMENTS && typeof window !== 'undefined') {
+  if (config.ENABLE_PAYMENTS && typeof window === 'undefined') {
     if (!process.env.NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY) {
       throw new Error(
killedBy: config validateEnvironment should validate Stripe config when payments enabled on client
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/config.ts:154:33
     }
   }
 
-  if (config.ENABLE_PAYMENTS && typeof window !== 'undefined') {
+  if (config.ENABLE_PAYMENTS && true) {
     if (!process.env.NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY) {
       throw new Error(
killedBy: config validateEnvironment should not validate Stripe on server
statusReason: expected [Function] to not throw an error but 'Error: Payments are enabled but NEXT_…' was thrown

[Killed] ConditionalExpression
src/lib/config.ts:155:9
   }
 
   if (config.ENABLE_PAYMENTS && typeof window !== 'undefined') {
-    if (!process.env.NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY) {
+    if (true) {
       throw new Error(
         'Payments are enabled but NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY is missing',
killedBy: config validateEnvironment should pass Stripe validation when properly configured
statusReason: expected [Function] to not throw an error but 'Error: Payments are enabled but NEXT_…' was thrown

[Killed] BooleanLiteral
src/lib/config.ts:155:9
   }
 
   if (config.ENABLE_PAYMENTS && typeof window !== 'undefined') {
-    if (!process.env.NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY) {
+    if (process.env.NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY) {
       throw new Error(
         'Payments are enabled but NEXT_PUBLIC_STRIPE_PUBLISHABLE_KEY is missing',
killedBy: config validateEnvironment should validate Stripe config when payments enabled on client
statusReason: expected [Function] to throw an error
