[Survived] BlockStatement
src/lib/logger.ts:30:49
  * Generate a correlation ID for request tracking
  * Returns undefined if not needed (simple implementation)
  */
-function getCorrelationId(): string | undefined {
-  // For now, return undefined - correlation IDs are typically generated per request
-  // This could be enhanced to maintain a session-level correlation ID if needed
-  return undefined;
-}
+function getCorrelationId(): string | undefined {}
 
 /**

[Killed] ConditionalExpression
src/lib/logger.ts:41:7
  * Should be called once at app startup
  */
 export function initializeLogger(): BrowserLogger {
-  if (loggerInstance) {
+  if (false) {
     return loggerInstance;
   }
killedBy: logger initializeLogger should return the same instance on multiple calls
statusReason: expected { debug: [Function debug], …(3) } to be { debug: [Function debug], …(3) } // Object.is equality

[Killed] BlockStatement
src/lib/logger.ts:41:23
  * Should be called once at app startup
  */
 export function initializeLogger(): BrowserLogger {
-  if (loggerInstance) {
-    return loggerInstance;
-  }
+  if (loggerInstance) {}
 
   const config = getConfig();
killedBy: logger initializeLogger should return the same instance on multiple calls
statusReason: expected { debug: [Function debug], …(3) } to be { debug: [Function debug], …(3) } // Object.is equality

[Killed] ObjectLiteral
src/lib/logger.ts:48:20
   const config = getConfig();
 
   // Simple console-based logger for browser
-  loggerInstance = {
-    debug: (message: string, metadata?: LogMetadata) => {
-      if (config.logLevel === 'debug' || isDevelopment()) {
-        console.debug(`[DEBUG] ${message}`, metadata || {});
-      }
-    },
-    info: (message: string, metadata?: LogMetadata) => {
-      console.info(`[INFO] ${message}`, metadata || {});
-    },
-    warn: (message: string, metadata?: LogMetadata) => {
-      console.warn(`[WARN] ${message}`, metadata || {});
-    },
-    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
-      console.error(`[ERROR] ${message}`, error, metadata || {});
-    },
-  };
+  loggerInstance = {};
 
   if (isDevelopment()) {
killedBy: logger initializeLogger should initialize and return a logger instance
statusReason: expected undefined to be an instance of Function

[Killed] BlockStatement
src/lib/logger.ts:49:57
 
   // Simple console-based logger for browser
   loggerInstance = {
-    debug: (message: string, metadata?: LogMetadata) => {
-      if (config.logLevel === 'debug' || isDevelopment()) {
-        console.debug(`[DEBUG] ${message}`, metadata || {});
-      }
-    },
+    debug: (message: string, metadata?: LogMetadata) => {},
     info: (message: string, metadata?: LogMetadata) => {
       console.info(`[INFO] ${message}`, metadata || {});
killedBy: logger Logger methods debug should log debug message with metadata when log level is debug
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug message', …(1) ]

Received: 



Number of calls: 0

[Killed] LogicalOperator
src/lib/logger.ts:50:11
   // Simple console-based logger for browser
   loggerInstance = {
     debug: (message: string, metadata?: LogMetadata) => {
-      if (config.logLevel === 'debug' || isDevelopment()) {
+      if (config.logLevel === 'debug' && isDevelopment()) {
         console.debug(`[DEBUG] ${message}`, metadata || {});
       }
killedBy: logger Logger methods debug should log debug message with metadata when log level is debug
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug message', …(1) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.ts:50:11
   // Simple console-based logger for browser
   loggerInstance = {
     debug: (message: string, metadata?: LogMetadata) => {
-      if (config.logLevel === 'debug' || isDevelopment()) {
+      if (config.logLevel !== 'debug' || isDevelopment()) {
         console.debug(`[DEBUG] ${message}`, metadata || {});
       }
killedBy: logger Logger methods debug should log debug message with metadata when log level is debug
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug message', …(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:51:45
   loggerInstance = {
     debug: (message: string, metadata?: LogMetadata) => {
       if (config.logLevel === 'debug' || isDevelopment()) {
-        console.debug(`[DEBUG] ${message}`, metadata || {});
+        console.debug(`[DEBUG] ${message}`, true);
       }
     },
killedBy: logger Logger methods debug should log debug message with metadata when log level is debug
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug message', …(1) ]

Received: 

  1st debug call:

  Array [
    "[DEBUG] Debug message",

[Killed] ConditionalExpression
src/lib/logger.ts:51:45
   loggerInstance = {
     debug: (message: string, metadata?: LogMetadata) => {
       if (config.logLevel === 'debug' || isDevelopment()) {
-        console.debug(`[DEBUG] ${message}`, metadata || {});
+        console.debug(`[DEBUG] ${message}`, false);
       }
     },
killedBy: logger Logger methods debug should log debug message with metadata when log level is debug
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug message', …(1) ]

Received: 

  1st debug call:

  Array [
    "[DEBUG] Debug message",

[Killed] BlockStatement
src/lib/logger.ts:54:56
         console.debug(`[DEBUG] ${message}`, metadata || {});
       }
     },
-    info: (message: string, metadata?: LogMetadata) => {
-      console.info(`[INFO] ${message}`, metadata || {});
-    },
+    info: (message: string, metadata?: LogMetadata) => {},
     warn: (message: string, metadata?: LogMetadata) => {
       console.warn(`[WARN] ${message}`, metadata || {});
killedBy: logger Logger methods info should log info message with metadata
statusReason: expected "info" to be called with arguments: [ '[INFO] Info message', …(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:55:41
       }
     },
     info: (message: string, metadata?: LogMetadata) => {
-      console.info(`[INFO] ${message}`, metadata || {});
+      console.info(`[INFO] ${message}`, true);
     },
     warn: (message: string, metadata?: LogMetadata) => {
killedBy: logger Logger methods info should log info message with metadata
statusReason: expected "info" to be called with arguments: [ '[INFO] Info message', …(1) ]

Received: 

  1st info call:

  Array [
    "[INFO] Info message",

[Killed] LogicalOperator
src/lib/logger.ts:55:41
       }
     },
     info: (message: string, metadata?: LogMetadata) => {
-      console.info(`[INFO] ${message}`, metadata || {});
+      console.info(`[INFO] ${message}`, metadata && {});
     },
     warn: (message: string, metadata?: LogMetadata) => {
killedBy: logger Logger methods info should log info message with metadata
statusReason: expected "info" to be called with arguments: [ '[INFO] Info message', …(1) ]

Received: 

  1st info call:

  Array [
    "[INFO] Info message",

[Killed] BlockStatement
src/lib/logger.ts:57:56
     info: (message: string, metadata?: LogMetadata) => {
       console.info(`[INFO] ${message}`, metadata || {});
     },
-    warn: (message: string, metadata?: LogMetadata) => {
-      console.warn(`[WARN] ${message}`, metadata || {});
-    },
+    warn: (message: string, metadata?: LogMetadata) => {},
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
       console.error(`[ERROR] ${message}`, error, metadata || {});
killedBy: logger Logger methods warn should log warning message with metadata
statusReason: expected "warn" to be called with arguments: [ '[WARN] Warning message', …(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:58:41
       console.info(`[INFO] ${message}`, metadata || {});
     },
     warn: (message: string, metadata?: LogMetadata) => {
-      console.warn(`[WARN] ${message}`, metadata || {});
+      console.warn(`[WARN] ${message}`, true);
     },
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
killedBy: logger Logger methods warn should log warning message with metadata
statusReason: expected "warn" to be called with arguments: [ '[WARN] Warning message', …(1) ]

Received: 

  1st warn call:

  Array [
    "[WARN] Warning message",

[Killed] ConditionalExpression
src/lib/logger.ts:58:41
       console.info(`[INFO] ${message}`, metadata || {});
     },
     warn: (message: string, metadata?: LogMetadata) => {
-      console.warn(`[WARN] ${message}`, metadata || {});
+      console.warn(`[WARN] ${message}`, false);
     },
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
killedBy: logger Logger methods warn should log warning message with metadata
statusReason: expected "warn" to be called with arguments: [ '[WARN] Warning message', …(1) ]

Received: 

  1st warn call:

  Array [
    "[WARN] Warning message",

[Killed] BlockStatement
src/lib/logger.ts:60:82
     warn: (message: string, metadata?: LogMetadata) => {
       console.warn(`[WARN] ${message}`, metadata || {});
     },
-    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
-      console.error(`[ERROR] ${message}`, error, metadata || {});
-    },
+    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {},
   };
 
killedBy: logger Logger methods error should log error message with Error object and metadata
statusReason: expected "error" to be called with arguments: [ '[ERROR] Error occurred', …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:61:50
       console.warn(`[WARN] ${message}`, metadata || {});
     },
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
-      console.error(`[ERROR] ${message}`, error, metadata || {});
+      console.error(`[ERROR] ${message}`, error, false);
     },
   };
killedBy: logger Logger methods error should log error message with Error object and metadata
statusReason: expected "error" to be called with arguments: [ '[ERROR] Error occurred', …(2) ]

Received: 

  1st error call:

  Array [
    "[ERROR] Error occurred",

[Killed] LogicalOperator
src/lib/logger.ts:61:50
       console.warn(`[WARN] ${message}`, metadata || {});
     },
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {
-      console.error(`[ERROR] ${message}`, error, metadata || {});
+      console.error(`[ERROR] ${message}`, error, metadata && {});
     },
   };
killedBy: logger Logger methods error should log error message with Error object and metadata
statusReason: expected "error" to be called with arguments: [ '[ERROR] Error occurred', …(2) ]

Received: 

  1st error call:

  Array [
    "[ERROR] Error occurred",

[Killed] ConditionalExpression
src/lib/logger.ts:65:7
     },
   };
 
-  if (isDevelopment()) {
+  if (true) {
     console.log('[Logger] Logger initialized for browser environment', {
       level: config.logLevel,
killedBy: logger initializeLogger should not log initialization message in non-development mode
statusReason: expected "log" to not be called with arguments: [ StringContaining{…}, Any<Object> ]

Received: 

  1st log call:

  Array [
-   StringContaining "[Logger] Logger initialized",

[Killed] BlockStatement
src/lib/logger.ts:65:24
     },
   };
 
-  if (isDevelopment()) {
-    console.log('[Logger] Logger initialized for browser environment', {
-      level: config.logLevel,
-      environment: config.mode,
-    });
-  }
+  if (isDevelopment()) {}
 
   return loggerInstance;
killedBy: logger initializeLogger should log initialization message in development mode
statusReason: expected "log" to be called with arguments: [ StringContaining{…}, …(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/lib/logger.ts:66:17
   };
 
   if (isDevelopment()) {
-    console.log('[Logger] Logger initialized for browser environment', {
+    console.log("", {
       level: config.logLevel,
       environment: config.mode,
killedBy: logger initializeLogger should log initialization message in development mode
statusReason: expected "log" to be called with arguments: [ StringContaining{…}, …(1) ]

Received: 

  1st log call:

  Array [
-   StringContaining "[Logger] Logger initialized",

[Killed] ObjectLiteral
src/lib/logger.ts:66:72
   };
 
   if (isDevelopment()) {
-    console.log('[Logger] Logger initialized for browser environment', {
-      level: config.logLevel,
-      environment: config.mode,
-    });
+    console.log('[Logger] Logger initialized for browser environment', {});
   }
 
killedBy: logger initializeLogger should log initialization message in development mode
statusReason: expected "log" to be called with arguments: [ StringContaining{…}, …(1) ]

Received: 

  1st log call:

  Array [
-   StringContaining "[Logger] Logger initialized",

[Killed] BlockStatement
src/lib/logger.ts:79:44
  * Get the current logger instance
  * Automatically initializes if not already done
  */
-export function getLogger(): BrowserLogger {
-  if (!loggerInstance) {
-    return initializeLogger();
-  }
-  return loggerInstance;
-}
+export function getLogger(): BrowserLogger {}
 
 /**
killedBy: logger getLogger should return existing logger instance
statusReason: expected undefined not to be undefined

[Killed] BooleanLiteral
src/lib/logger.ts:80:7
  * Automatically initializes if not already done
  */
 export function getLogger(): BrowserLogger {
-  if (!loggerInstance) {
+  if (loggerInstance) {
     return initializeLogger();
   }
killedBy: logger getLogger should return existing logger instance
statusReason: Cannot read properties of null (reading 'debug')

[Killed] BlockStatement
src/lib/logger.ts:80:24
  * Automatically initializes if not already done
  */
 export function getLogger(): BrowserLogger {
-  if (!loggerInstance) {
-    return initializeLogger();
-  }
+  if (!loggerInstance) {}
   return loggerInstance;
 }
killedBy: logger getLogger should return existing logger instance
statusReason: Cannot read properties of null (reading 'debug')

[Killed] BlockStatement
src/lib/logger.ts:90:73
  * Log helper functions for convenience
  */
 
-export function logDebug(message: string, metadata?: LogMetadata): void {
-  getLogger().debug(message, metadata);
-}
+export function logDebug(message: string, metadata?: LogMetadata): void {}
 
 export function logInfo(message: string, metadata?: LogMetadata): void {
killedBy: logger Helper functions logDebug should call logger.debug when debug level enabled
statusReason: expected "debug" to be called with arguments: [ '[DEBUG] Debug via helper', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:94:72
   getLogger().debug(message, metadata);
 }
 
-export function logInfo(message: string, metadata?: LogMetadata): void {
-  getLogger().info(message, metadata);
-}
+export function logInfo(message: string, metadata?: LogMetadata): void {}
 
 export function logWarn(message: string, metadata?: LogMetadata): void {
killedBy: logger Helper functions logInfo should call logger.info
statusReason: expected "info" to be called with arguments: [ '[INFO] Info via helper', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:98:72
   getLogger().info(message, metadata);
 }
 
-export function logWarn(message: string, metadata?: LogMetadata): void {
-  getLogger().warn(message, metadata);
-}
+export function logWarn(message: string, metadata?: LogMetadata): void {}
 
 export function logError(message: string, error?: Error | unknown, metadata?: LogMetadata): void {
killedBy: logger Helper functions logWarn should call logger.warn
statusReason: expected "warn" to be called with arguments: [ '[WARN] Warn via helper', …(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:102:98
   getLogger().warn(message, metadata);
 }
 
-export function logError(message: string, error?: Error | unknown, metadata?: LogMetadata): void {
-  getLogger().error(message, error, metadata);
-}
+export function logError(message: string, error?: Error | unknown, metadata?: LogMetadata): void {}
 
 /**
killedBy: logger Helper functions logError should call logger.error with error
statusReason: expected "error" to be called with arguments: [ '[ERROR] Error via helper', …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:114:9
   method: string,
   url: string,
   metadata?: LogMetadata,
-): void {
-  getLogger().info(`API Request: ${method} ${url}`, {
-    ...metadata,
-    method,
-    url,
-    correlationId: getCorrelationId(),
-    type: 'api_request',
-  });
-}
+): void {}
 
 /**
killedBy: logger API logging functions logApiRequest should log API request with method and URL
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:134:9
   status: number,
   duration: number,
   metadata?: LogMetadata,
-): void {
-  const level = status >= 400 ? 'error' : 'info';
-  const logger = getLogger();
-
-  const logData = {
-    ...metadata,
-    method,
-    url,
-    status,
-    duration,
-    correlationId: getCorrelationId(),
-    type: 'api_response',
-  };
-
-  if (level === 'error') {
-    logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
-  } else {
-    logger.info(`API Response: ${method} ${url} ${status}`, logData);
-  }
-}
+): void {}
 
 /**
killedBy: logger API logging functions logApiResponse should log successful API response as info
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:135:17
   duration: number,
   metadata?: LogMetadata,
 ): void {
-  const level = status >= 400 ? 'error' : 'info';
+  const level = false ? 'error' : 'info';
   const logger = getLogger();
 
killedBy: logger API logging functions logApiResponse should log 4xx response as error
statusReason: expected "error" to be called with arguments: [ …(3) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.ts:135:17
   duration: number,
   metadata?: LogMetadata,
 ): void {
-  const level = status >= 400 ? 'error' : 'info';
+  const level = status < 400 ? 'error' : 'info';
   const logger = getLogger();
 
killedBy: logger API logging functions logApiResponse should log successful API response as info
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.ts:148:7
     type: 'api_response',
   };
 
-  if (level === 'error') {
+  if (false) {
     logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
   } else {
killedBy: logger API logging functions logApiResponse should log 4xx response as error
statusReason: expected "error" to be called with arguments: [ …(3) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.ts:148:7
     type: 'api_response',
   };
 
-  if (level === 'error') {
+  if (level !== 'error') {
     logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
   } else {
killedBy: logger API logging functions logApiResponse should log successful API response as info
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/lib/logger.ts:149:18
   };
 
   if (level === 'error') {
-    logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
+    logger.error(``, undefined, logData);
   } else {
     logger.info(`API Response: ${method} ${url} ${status}`, logData);
killedBy: logger API logging functions logApiResponse should log 4xx response as error
statusReason: expected "error" to be called with arguments: [ …(3) ]

Received: 

  1st error call:

  Array [
-   "[ERROR] API Response: POST /api/posts 400",

[Killed] BlockStatement
src/lib/logger.ts:150:10
 
   if (level === 'error') {
     logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
-  } else {
-    logger.info(`API Response: ${method} ${url} ${status}`, logData);
-  }
+  } else {}
 }
 
killedBy: logger API logging functions logApiResponse should log successful API response as info
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:163:9
   url: string,
   error: Error | unknown,
   metadata?: LogMetadata,
-): void {
-  getLogger().error(`API Error: ${method} ${url}`, error, {
-    ...metadata,
-    method,
-    url,
-    correlationId: getCorrelationId(),
-    type: 'api_error',
-  });
-}
+): void {}
 
 /**
killedBy: logger API logging functions logApiError should log API error with Error object
statusReason: expected "error" to be called with arguments: [ …(3) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/lib/logger.ts:169:11
     method,
     url,
     correlationId: getCorrelationId(),
-    type: 'api_error',
+    type: "",
   });
 }
killedBy: logger API logging functions logApiError should log API error with Error object
statusReason: expected "error" to be called with arguments: [ …(3) ]

Received: 

  1st error call:

  Array [
    "[ERROR] API Error: GET /api/users",

[Killed] BlockStatement
src/lib/logger.ts:180:9
 export function logUserAction(
   action: string,
   metadata?: LogMetadata,
-): void {
-  getLogger().info(`User Action: ${action}`, {
-    ...metadata,
-    action,
-    type: 'user_action',
-  });
-}
+): void {}
 
 /**
killedBy: logger User action logging logUserAction should log user action
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:191:73
 /**
  * Log page view
  */
-export function logPageView(path: string, metadata?: LogMetadata): void {
-  getLogger().info(`Page View: ${path}`, {
-    ...metadata,
-    path,
-    type: 'page_view',
-  });
-}
+export function logPageView(path: string, metadata?: LogMetadata): void {}
 
 /**
killedBy: logger User action logging logPageView should log page view
statusReason: expected "info" to be called with arguments: [ Array(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/lib/logger.ts:203:55
  * Set the current user ID for logging context
  * Should be called after authentication
  */
-export function setLoggerUserId(userId: string): void {
-  logInfo('User context set for logging', { userId });
-}
+export function setLoggerUserId(userId: string): void {}
 
 /**
killedBy: logger User action logging setLoggerUserId should log user context being set
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/lib/logger.ts:204:11
  * Should be called after authentication
  */
 export function setLoggerUserId(userId: string): void {
-  logInfo('User context set for logging', { userId });
+  logInfo("", { userId });
 }
 
killedBy: logger User action logging setLoggerUserId should log user context being set
statusReason: expected "info" to be called with arguments: [ …(2) ]

Received: 

  1st info call:

  Array [
-   "[INFO] User context set for logging",

[Killed] BlockStatement
src/lib/logger.ts:211:72
  * Create a child logger with additional context
  * Useful for component-specific logging
  */
-export function createChildLogger(context: LogMetadata): BrowserLogger {
-  const logger = getLogger();
-  return {
-    debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
-    info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
-    warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
-    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
-  };
-}
+export function createChildLogger(context: LogMetadata): BrowserLogger {}
 
 // Export types for type safety
killedBy: logger createChildLogger should create logger with additional context
statusReason: Cannot read properties of undefined (reading 'info')

[Killed] ArrowFunction
src/lib/logger.ts:214:12
 export function createChildLogger(context: LogMetadata): BrowserLogger {
   const logger = getLogger();
   return {
-    debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
+    debug: () => undefined,
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
killedBy: logger createChildLogger should merge child context with message metadata for debug
statusReason: expected "debug" to be called with arguments: [ StringContaining "Auth debug", …(1) ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/lib/logger.ts:215:11
   const logger = getLogger();
   return {
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
-    info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
+    info: () => undefined,
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
killedBy: logger createChildLogger should create logger with additional context
statusReason: expected "info" to be called with arguments: [ '[INFO] Child log message', …(1) ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/lib/logger.ts:216:11
   return {
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
-    warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
+    warn: () => undefined,
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
   };
killedBy: logger createChildLogger should work with all log levels
statusReason: expected "warn" to be called with arguments: [ Any<String>, ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/lib/logger.ts:216:77
   return {
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
-    warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
+    warn: (message: string, metadata?: LogMetadata) => logger.warn(message, {}),
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
   };
killedBy: logger createChildLogger should work with all log levels
statusReason: expected "warn" to be called with arguments: [ Any<String>, ObjectContaining{…} ]

Received: 

  1st warn call:

  Array [
-   Any<String>,

[Killed] ArrowFunction
src/lib/logger.ts:217:12
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
-    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
+    error: () => undefined,
   };
 }
killedBy: logger createChildLogger should work with all log levels
statusReason: expected "error" to be called with arguments: [ Any<String>, Any<Error>, …(1) ]

Received: 



Number of calls: 0
