[Killed] BlockStatement
src/lib/startup-checks.ts:12:36
  * Run startup checks and log warnings
  * Call this in server components or API routes
  */
-export function runStartupChecks() {
-  if (process.env.NODE_ENV === 'production') {
-    return; // Skip checks in production
-  }
-
-  const clerkStatus = getClerkStatus();
-
-  if (!clerkStatus.configured) {
-    console.warn('\n========================================');
-    console.warn('⚠️  CLERK CONFIGURATION WARNING');
-    console.warn('========================================');
-    console.warn(clerkStatus.message);
-    console.warn('\nQuick setup (2 minutes):');
-    console.warn('1. Create free account: https://clerk.com');
-    console.warn('2. Get API keys: https://dashboard.clerk.com/last-active?path=api-keys');
-    console.warn('3. Update: frontend/.env.local');
-    console.warn('4. Restart dev server');
-    console.warn('\nDetailed guide: docs/CLERK-SETUP-GUIDE.md');
-    console.warn('========================================\n');
-  }
-}
+export function runStartupChecks() {}
 
killedBy: startup-checks runStartupChecks should run checks in development environment
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/lib/startup-checks.ts:13:7
  * Call this in server components or API routes
  */
 export function runStartupChecks() {
-  if (process.env.NODE_ENV === 'production') {
+  if (false) {
     return; // Skip checks in production
   }
killedBy: startup-checks runStartupChecks should skip checks in production environment
statusReason: Cannot read properties of undefined (reading 'configured')

[Killed] ConditionalExpression
src/lib/startup-checks.ts:13:7
  * Call this in server components or API routes
  */
 export function runStartupChecks() {
-  if (process.env.NODE_ENV === 'production') {
+  if (true) {
     return; // Skip checks in production
   }
killedBy: startup-checks runStartupChecks should run checks in development environment
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/lib/startup-checks.ts:19:7
 
   const clerkStatus = getClerkStatus();
 
-  if (!clerkStatus.configured) {
+  if (false) {
     console.warn('\n========================================');
     console.warn('⚠️  CLERK CONFIGURATION WARNING');
killedBy: startup-checks runStartupChecks should log warnings when Clerk is not configured
statusReason: expected "warn" to be called at least once

[Killed] BooleanLiteral
src/lib/startup-checks.ts:19:7
 
   const clerkStatus = getClerkStatus();
 
-  if (!clerkStatus.configured) {
+  if (clerkStatus.configured) {
     console.warn('\n========================================');
     console.warn('⚠️  CLERK CONFIGURATION WARNING');
killedBy: startup-checks runStartupChecks should not log warnings when Clerk is configured
statusReason: expected "warn" to not be called at all, but actually been called 11 times

Received: 

  1st warn call:

    Array [
      "

[Killed] StringLiteral
src/lib/startup-checks.ts:25:18
     console.warn('========================================');
     console.warn(clerkStatus.message);
     console.warn('\nQuick setup (2 minutes):');
-    console.warn('1. Create free account: https://clerk.com');
+    console.warn("");
     console.warn('2. Get API keys: https://dashboard.clerk.com/last-active?path=api-keys');
     console.warn('3. Update: frontend/.env.local');
killedBy: startup-checks runStartupChecks should display numbered setup steps
statusReason: expected "warn" to be called with arguments: [ StringContaining "1." ]

Received: 

  1st warn call:

  Array [
-   StringContaining "1.",

[Killed] StringLiteral
src/lib/startup-checks.ts:26:18
     console.warn(clerkStatus.message);
     console.warn('\nQuick setup (2 minutes):');
     console.warn('1. Create free account: https://clerk.com');
-    console.warn('2. Get API keys: https://dashboard.clerk.com/last-active?path=api-keys');
+    console.warn("");
     console.warn('3. Update: frontend/.env.local');
     console.warn('4. Restart dev server');
killedBy: startup-checks runStartupChecks should display numbered setup steps
statusReason: expected "warn" to be called with arguments: [ StringContaining "2." ]

Received: 

  1st warn call:

  Array [
-   StringContaining "2.",

[Killed] StringLiteral
src/lib/startup-checks.ts:27:18
     console.warn('\nQuick setup (2 minutes):');
     console.warn('1. Create free account: https://clerk.com');
     console.warn('2. Get API keys: https://dashboard.clerk.com/last-active?path=api-keys');
-    console.warn('3. Update: frontend/.env.local');
+    console.warn("");
     console.warn('4. Restart dev server');
     console.warn('\nDetailed guide: docs/CLERK-SETUP-GUIDE.md');
killedBy: startup-checks runStartupChecks should display numbered setup steps
statusReason: expected "warn" to be called with arguments: [ StringContaining "3." ]

Received: 

  1st warn call:

  Array [
-   StringContaining "3.",

[Killed] StringLiteral
src/lib/startup-checks.ts:28:18
     console.warn('1. Create free account: https://clerk.com');
     console.warn('2. Get API keys: https://dashboard.clerk.com/last-active?path=api-keys');
     console.warn('3. Update: frontend/.env.local');
-    console.warn('4. Restart dev server');
+    console.warn("");
     console.warn('\nDetailed guide: docs/CLERK-SETUP-GUIDE.md');
     console.warn('========================================\n');
killedBy: startup-checks runStartupChecks should display numbered setup steps
statusReason: expected "warn" to be called with arguments: [ StringContaining "4." ]

Received: 

  1st warn call:

  Array [
-   StringContaining "4.",

[Survived] StringLiteral
src/lib/startup-checks.ts:30:18
     console.warn('3. Update: frontend/.env.local');
     console.warn('4. Restart dev server');
     console.warn('\nDetailed guide: docs/CLERK-SETUP-GUIDE.md');
-    console.warn('========================================\n');
+    console.warn("");
   }
 }
