[Killed] BlockStatement
src/lib/supabase.ts:12:37
 /**
  * Get Supabase configuration
  */
-export function getSupabaseConfig() {
-  const config = getConfig();
-  return {
-    url: config.supabaseUrl,
-    anonKey: config.supabaseAnonKey,
-  };
-}
+export function getSupabaseConfig() {}
 
 /**
killedBy: supabase getSupabaseConfig should return Supabase configuration from config
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
src/lib/supabase.ts:23:31
 /**
  * Get Supabase client instance
  */
-export function getSupabase() {
-  const { url, anonKey } = getSupabaseConfig();
-  return createClient(url, anonKey);
-}
+export function getSupabase() {}
 
killedBy: supabase getSupabase should create and return Supabase client
statusReason: expected "spy" to be called with arguments: [ 'https://test.supabase.co', …(1) ]

Received: 



Number of calls: 0
