[Killed] BlockStatement
src/lib/utils.ts:11:45
 /**
  * Merge Tailwind CSS classes with clsx
  */
-export function cn(...inputs: ClassValue[]) {
-  return twMerge(clsx(inputs));
-}
+export function cn(...inputs: ClassValue[]) {}
 
killedBy: utils cn (className merge utility) should merge multiple class strings
statusReason: expected undefined to be 'class1 class2 class3' // Object.is equality
