[Killed] StringLiteral
src/middleware.ts:17:3
 const isPublicRoute = createRouteMatcher([
   '/',
   '/login(.*)',
-  '/signup(.*)',
+  "",
   '/api/webhooks(.*)',
   '/api/health(.*)',
killedBy: middleware route protection should not call auth.protect for signup route
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
src/middleware.ts:25:42
 /**
  * Generate a correlation ID for request tracing
  */
-function generateCorrelationId(): string {
-  return `${Date.now()}-${Math.random().toString(36).substring(2, 15)}`;
-}
+function generateCorrelationId(): string {}
 
 export default clerkMiddleware(async (auth, request) => {
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected undefined to be truthy

[Survived] MethodExpression
src/middleware.ts:26:27
  * Generate a correlation ID for request tracing
  */
 function generateCorrelationId(): string {
-  return `${Date.now()}-${Math.random().toString(36).substring(2, 15)}`;
+  return `${Date.now()}-${Math.random().toString(36)}`;
 }
 

[Killed] StringLiteral
src/middleware.ts:26:10
  * Generate a correlation ID for request tracing
  */
 function generateCorrelationId(): string {
-  return `${Date.now()}-${Math.random().toString(36).substring(2, 15)}`;
+  return ``;
 }
 
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected '' to be truthy

[Killed] BlockStatement
src/middleware.ts:29:57
   return `${Date.now()}-${Math.random().toString(36).substring(2, 15)}`;
 }
 
-export default clerkMiddleware(async (auth, request) => {
-  // Generate correlation ID for this request
-  const correlationId = request.headers.get('X-Correlation-ID') || generateCorrelationId();
-
-  // Create response with correlation ID header
-  let response: NextResponse | undefined;
-
-  // Allow public routes without authentication
-  if (isPublicRoute(request)) {
-    response = NextResponse.next();
-  } else {
-    // Protect all other routes - redirect to sign-in if not authenticated
-    await auth.protect();
-    response = NextResponse.next();
-  }
-
-  // Add correlation ID to response headers
-  if (response) {
-    response.headers.set('X-Correlation-ID', correlationId);
-  }
-
-  return response;
-});
+export default clerkMiddleware(async (auth, request) => {});
 
 export const config = {
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/middleware.ts:31:25
 
 export default clerkMiddleware(async (auth, request) => {
   // Generate correlation ID for this request
-  const correlationId = request.headers.get('X-Correlation-ID') || generateCorrelationId();
+  const correlationId = request.headers.get('X-Correlation-ID') && generateCorrelationId();
 
   // Create response with correlation ID header
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected null to be truthy

[Killed] ConditionalExpression
src/middleware.ts:31:25
 
 export default clerkMiddleware(async (auth, request) => {
   // Generate correlation ID for this request
-  const correlationId = request.headers.get('X-Correlation-ID') || generateCorrelationId();
+  const correlationId = true;
 
   // Create response with correlation ID header
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/middleware.ts:37:31
   let response: NextResponse | undefined;
 
   // Allow public routes without authentication
-  if (isPublicRoute(request)) {
-    response = NextResponse.next();
-  } else {
+  if (isPublicRoute(request)) {} else {
     // Protect all other routes - redirect to sign-in if not authenticated
     await auth.protect();
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/middleware.ts:37:7
   let response: NextResponse | undefined;
 
   // Allow public routes without authentication
-  if (isPublicRoute(request)) {
+  if (true) {
     response = NextResponse.next();
   } else {
killedBy: middleware route protection should call auth.protect for protected routes like dashboard
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/middleware.ts:39:10
   // Allow public routes without authentication
   if (isPublicRoute(request)) {
     response = NextResponse.next();
-  } else {
-    // Protect all other routes - redirect to sign-in if not authenticated
-    await auth.protect();
-    response = NextResponse.next();
-  }
+  } else {}
 
   // Add correlation ID to response headers
killedBy: middleware correlation ID generation should generate unique correlation IDs for different requests
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] ConditionalExpression
src/middleware.ts:46:7
   }
 
   // Add correlation ID to response headers
-  if (response) {
+  if (false) {
     response.headers.set('X-Correlation-ID', correlationId);
   }
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/middleware.ts:46:17
   }
 
   // Add correlation ID to response headers
-  if (response) {
-    response.headers.set('X-Correlation-ID', correlationId);
-  }
+  if (response) {}
 
   return response;
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/middleware.ts:47:26
 
   // Add correlation ID to response headers
   if (response) {
-    response.headers.set('X-Correlation-ID', correlationId);
+    response.headers.set("", correlationId);
   }
 
killedBy: middleware correlation ID generation should generate correlation ID when not provided in request
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/middleware.ts:54:12
 });
 
 export const config = {
-  matcher: [
-    // Skip Next.js internals and all static files, unless found in search params
-    '/((?!_next|[^?]*\\.(?:html?|css|js(?!on)|jpe?g|webp|png|gif|svg|ttf|woff2?|ico|csv|docx?|xlsx?|zip|webmanifest)).*)',
-    // Always run for API routes
-    '/(api|trpc)(.*)',
-  ],
+  matcher: [],
 };
 
killedBy: middleware middleware config should export config with correct matcher
statusReason: expected [] to have a length of 2 but got +0
