[Survived] BooleanLiteral
src/providers/feature-flag-provider.tsx:42:22
  */
 export function FeatureFlagProvider({ children }: FeatureFlagProviderProps) {
   const [flags, setFlags] = useState<FeatureFlagState>({
-    ENABLE_SUPABASE: false,
+    ENABLE_SUPABASE: true,
     ENABLE_PAYMENTS: false,
   });

[Survived] BooleanLiteral
src/providers/feature-flag-provider.tsx:43:22
 export function FeatureFlagProvider({ children }: FeatureFlagProviderProps) {
   const [flags, setFlags] = useState<FeatureFlagState>({
     ENABLE_SUPABASE: false,
-    ENABLE_PAYMENTS: false,
+    ENABLE_PAYMENTS: true,
   });
   const [environmentMode, setEnvironmentMode] = useState<EnvironmentMode>('development');

[Survived] BooleanLiteral
src/providers/feature-flag-provider.tsx:46:46
     ENABLE_PAYMENTS: false,
   });
   const [environmentMode, setEnvironmentMode] = useState<EnvironmentMode>('development');
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
 
   useEffect(() => {

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:49:9
   const [isLoading, setIsLoading] = useState(true);
 
   useEffect(() => {
-    try {
-      // Get configuration
-      const config = getConfig();
-
-      // Initialize feature flags
-      const featureFlags = new FeatureFlags(config.mode);
-
-      // Set environment mode
-      setEnvironmentMode(config.mode);
-
-      // Evaluate all feature flags
-      const evaluatedFlags: FeatureFlagState = {
-        ENABLE_SUPABASE: featureFlags.isEnabled('ENABLE_SUPABASE'),
-        ENABLE_PAYMENTS: featureFlags.isEnabled('ENABLE_PAYMENTS'),
-      };
-
-      setFlags(evaluatedFlags);
-
-      // Log feature flag initialization
-      logInfo('Feature flags initialized', {
-        environmentMode: config.mode,
-        flags: evaluatedFlags,
-      });
-    } catch (error) {
+    try {} catch (error) {
       console.error('[FeatureFlagProvider] Failed to initialize feature flags:', error);
     } finally {
killedBy: FeatureFlagProvider FeatureFlagProvider component should initialize feature flags from config
statusReason: expected "spy" to be called with arguments: [ 'development' ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/providers/feature-flag-provider.tsx:61:49
 
       // Evaluate all feature flags
       const evaluatedFlags: FeatureFlagState = {
-        ENABLE_SUPABASE: featureFlags.isEnabled('ENABLE_SUPABASE'),
+        ENABLE_SUPABASE: featureFlags.isEnabled(""),
         ENABLE_PAYMENTS: featureFlags.isEnabled('ENABLE_PAYMENTS'),
       };
killedBy: FeatureFlagProvider useFeature hook should return feature status
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Survived] StringLiteral
src/providers/feature-flag-provider.tsx:62:49
       // Evaluate all feature flags
       const evaluatedFlags: FeatureFlagState = {
         ENABLE_SUPABASE: featureFlags.isEnabled('ENABLE_SUPABASE'),
-        ENABLE_PAYMENTS: featureFlags.isEnabled('ENABLE_PAYMENTS'),
+        ENABLE_PAYMENTS: featureFlags.isEnabled(""),
       };
 

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:72:21
         environmentMode: config.mode,
         flags: evaluatedFlags,
       });
-    } catch (error) {
-      console.error('[FeatureFlagProvider] Failed to initialize feature flags:', error);
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }
killedBy: FeatureFlagProvider FeatureFlagProvider component should handle config errors gracefully
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] BlockStatement
src/providers/feature-flag-provider.tsx:74:15
       });
     } catch (error) {
       console.error('[FeatureFlagProvider] Failed to initialize feature flags:', error);
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   }, []);
 

[Killed] ArrowFunction
src/providers/feature-flag-provider.tsx:79:28
     }
   }, []);
 
-  const isFeatureEnabled = (feature: Feature): boolean => flags[feature] || false;
+  const isFeatureEnabled = () => undefined;
 
   const value: FeatureFlagContextType = {
killedBy: FeatureFlagProvider useFeature hook should return feature status
statusReason: expected undefined to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:79:59
     }
   }, []);
 
-  const isFeatureEnabled = (feature: Feature): boolean => flags[feature] || false;
+  const isFeatureEnabled = (feature: Feature): boolean => true;
 
   const value: FeatureFlagContextType = {
killedBy: FeatureFlagProvider FeatureGate component should not render children when feature is disabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="gated-content"
>
  Payment Feature
</div> instead

[Killed] ObjectLiteral
src/providers/feature-flag-provider.tsx:81:41
 
   const isFeatureEnabled = (feature: Feature): boolean => flags[feature] || false;
 
-  const value: FeatureFlagContextType = {
-    flags,
-    environmentMode,
-    isFeatureEnabled,
-    isLoading,
-  };
+  const value: FeatureFlagContextType = {};
 
   return (
killedBy: FeatureFlagProvider useFeatureFlags hook should return feature flag context when used within provider
statusReason: expected undefined not to be undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:98:59
 /**
  * Hook to access feature flags
  */
-export function useFeatureFlags(): FeatureFlagContextType {
-  const context = useContext(FeatureFlagContext);
-  if (!context) {
-    throw new Error('useFeatureFlags must be used within a FeatureFlagProvider');
-  }
-  return context;
-}
+export function useFeatureFlags(): FeatureFlagContextType {}
 
 /**
killedBy: FeatureFlagProvider useFeatureFlags hook should throw error when used outside provider
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:100:7
  */
 export function useFeatureFlags(): FeatureFlagContextType {
   const context = useContext(FeatureFlagContext);
-  if (!context) {
+  if (false) {
     throw new Error('useFeatureFlags must be used within a FeatureFlagProvider');
   }
killedBy: FeatureFlagProvider useFeatureFlags hook should throw error when used outside provider
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:100:17
  */
 export function useFeatureFlags(): FeatureFlagContextType {
   const context = useContext(FeatureFlagContext);
-  if (!context) {
-    throw new Error('useFeatureFlags must be used within a FeatureFlagProvider');
-  }
+  if (!context) {}
   return context;
 }
killedBy: FeatureFlagProvider useFeatureFlags hook should throw error when used outside provider
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:109:55
 /**
  * Hook to check if a specific feature is enabled
  */
-export function useFeature(feature: Feature): boolean {
-  const { isFeatureEnabled } = useFeatureFlags();
-  return isFeatureEnabled(feature);
-}
+export function useFeature(feature: Feature): boolean {}
 
 /**
killedBy: FeatureFlagProvider useFeature hook should return feature status
statusReason: expected undefined to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:117:51
 /**
  * Hook to get the current environment mode
  */
-export function useEnvironment(): EnvironmentMode {
-  const { environmentMode } = useFeatureFlags();
-  return environmentMode;
-}
+export function useEnvironment(): EnvironmentMode {}
 
 /**
killedBy: FeatureFlagProvider useEnvironment hook should return current environment
statusReason: expected undefined to be 'production' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:131:87
   fallback?: React.ReactNode;
 }
 
-export function FeatureGate({ feature, children, fallback = null }: FeatureGateProps) {
-  const isEnabled = useFeature(feature);
-
-  if (!isEnabled && fallback) {
-    return <>{fallback}</>;
-  }
-
-  return isEnabled ? <>{children}</> : null;
-}
+export function FeatureGate({ feature, children, fallback = null }: FeatureGateProps) {}
 
 /**
killedBy: FeatureFlagProvider FeatureGate component should render children when feature is enabled
statusReason: Unable to find an element by: [data-testid="gated-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:134:7
 export function FeatureGate({ feature, children, fallback = null }: FeatureGateProps) {
   const isEnabled = useFeature(feature);
 
-  if (!isEnabled && fallback) {
+  if (true) {
     return <>{fallback}</>;
   }
killedBy: FeatureFlagProvider FeatureGate component should render children when feature is enabled
statusReason: Unable to find an element by: [data-testid="gated-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:134:7
 export function FeatureGate({ feature, children, fallback = null }: FeatureGateProps) {
   const isEnabled = useFeature(feature);
 
-  if (!isEnabled && fallback) {
+  if (false) {
     return <>{fallback}</>;
   }
killedBy: FeatureFlagProvider FeatureGate component should render fallback when feature is disabled
statusReason: Unable to find an element by: [data-testid="fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/providers/feature-flag-provider.tsx:154:26
   environments,
   children,
   fallback = null,
-}: EnvironmentGateProps) {
-  const currentEnvironment = useEnvironment();
-  const isAllowed = environments.includes(currentEnvironment);
-
-  if (!isAllowed && fallback) {
-    return <>{fallback}</>;
-  }
-
-  return isAllowed ? <>{children}</> : null;
-}
+}: EnvironmentGateProps) {}
 
killedBy: FeatureFlagProvider EnvironmentGate component should render children when in allowed environment
statusReason: Unable to find an element by: [data-testid="env-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:158:7
   const currentEnvironment = useEnvironment();
   const isAllowed = environments.includes(currentEnvironment);
 
-  if (!isAllowed && fallback) {
+  if (true) {
     return <>{fallback}</>;
   }
killedBy: FeatureFlagProvider EnvironmentGate component should render children when in allowed environment
statusReason: Unable to find an element by: [data-testid="env-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/providers/feature-flag-provider.tsx:158:7
   const currentEnvironment = useEnvironment();
   const isAllowed = environments.includes(currentEnvironment);
 
-  if (!isAllowed && fallback) {
+  if (false) {
     return <>{fallback}</>;
   }
killedBy: FeatureFlagProvider EnvironmentGate component should render fallback when not in allowed environment
statusReason: Unable to find an element by: [data-testid="fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
