[NoCoverage] LogicalOperator
(app)/report/[id]/page.tsx:30:13
         setIsLoading(true);
         const response = await api.get<Report>(`/api/reports/${reportId}`);
 
-        if (response.error || !response.data) {
+        if (response.error && !response.data) {
           setError(response.error?.message || 'Failed to load report');
           return;

[NoCoverage] LogicalOperator
(app)/report/[id]/page.tsx:55:7
     );
   }
 
-  if (error || !report) {
+  if (error && !report) {
     return (
       <div className="max-w-4xl mx-auto text-center py-12">
