[NoCoverage] ConditionalExpression
app/(app)/reports/page.tsx:43:9
     }
 
     // Apply search filter
-    if (searchQuery.trim()) {
+    if (true) {
       const query = searchQuery.toLowerCase();
       filtered = filtered.filter((report) => report.query.toLowerCase().includes(query));

[NoCoverage] LogicalOperator
app/(app)/reports/page.tsx:151:8
       )}
 
       {/* Error state */}
-      {error && !isLoading && (
+      {error || !isLoading && (
         <div className="rounded-lg border border-red-200 bg-red-50 p-6">
           <div className="flex items-center gap-2 text-red-800">

[NoCoverage] ConditionalExpression
app/(app)/reports/page.tsx:175:8
       )}
 
       {/* Empty state */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length === 0 && (
+      {true && (
         <div className="rounded-lg border border-dashed border-gray-300 bg-gray-50 p-12 text-center">
           <svg

[NoCoverage] ConditionalExpression
app/(app)/reports/page.tsx:175:8
       )}
 
       {/* Empty state */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length === 0 && (
+      {true && reports.length === 0 && (
         <div className="rounded-lg border border-dashed border-gray-300 bg-gray-50 p-12 text-center">
           <svg

[NoCoverage] LogicalOperator
app/(app)/reports/page.tsx:212:8
       )}
 
       {/* No results from filter */}
-      {!isLoading && !error && filteredReports.length === 0 && reports.length > 0 && (
+      {!isLoading && !error && filteredReports.length === 0 || reports.length > 0 && (
         <div className="rounded-lg border border-gray-200 bg-white p-12 text-center">
           <svg

[NoCoverage] LogicalOperator
app/(app)/reports/page.tsx:244:8
       )}
 
       {/* Reports list */}
-      {!isLoading && !error && filteredReports.length > 0 && (
+      {!isLoading && !error || filteredReports.length > 0 && (
         <div className="space-y-4">
           {filteredReports.map((report) => (
