[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:73:7
     return `${diffHours} hour${diffHours !== 1 ? 's' : ''} ago`;
   }
 
-  if (diffDays === 1) return 'Yesterday';
+  if (false) return 'Yesterday';
   if (diffDays < 7) return `${diffDays} days ago`;
 
killedBy: ReportCard shows correct date formatting for yesterday
statusReason: Unable to find an element with the text: Yesterday. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4

[Survived] ConditionalExpression
src/components/reports/ReportCard.tsx:79:11
   return date.toLocaleDateString(undefined, {
     month: 'short',
     day: 'numeric',
-    year: date.getFullYear() !== now.getFullYear() ? 'numeric' : undefined,
+    year: true ? 'numeric' : undefined,
   });
 }

[Killed] ConditionalExpression
src/components/reports/ReportCard.tsx:168:8
         )}
       </div>
 
-      {!compact && report.content?.total_citations && (
-        <div className="flex items-center gap-1 text-xs text-gray-500">
-          <svg className="h-4 w-4" fill="none" stroke="currentColor" viewBox="0 0 24 24">
-            <path
-              strokeLinecap="round"
-              strokeLinejoin="round"
-              strokeWidth={2}
-              d="M9 12h6m-6 4h6m2 5H7a2 2 0 01-2-2V5a2 2 0 012-2h5.586a1 1 0 01.707.293l5.414 5.414a1 1 0 01.293.707V19a2 2 0 01-2 2z"
-            />
-          </svg>
-          <span>
-            {report.content.total_citations}
-            {' '}
-            sources cited
-          </span>
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: ReportCard displays citation count when not compact
statusReason: Unable to find an element with the text: 5 sources cited. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="
        cursor-pointer rounded-lg border border-gray-200 bg-white p-4
