[NoCoverage] ConditionalExpression
src/lib/api-client.ts:97:16
           correlationId,
         };
       }
-    } else if (!response.ok) {
+    } else if (true) {
       error = {
         message: response.statusText || 'An error occurred',
