[NoCoverage] LogicalOperator
src/lib/config.ts:147:9
   const config = getConfig();
 
   if (config.ENABLE_SUPABASE) {
-    if (!config.SUPABASE_URL || !config.SUPABASE_ANON_KEY) {
+    if (!config.SUPABASE_URL && !config.SUPABASE_ANON_KEY) {
       throw new Error(
         'Supabase is enabled but NEXT_PUBLIC_SUPABASE_URL or NEXT_PUBLIC_SUPABASE_ANON_KEY is missing',
