[NoCoverage] ConditionalExpression
src/lib/logger.ts:31:7
  * Should be called once at app startup
  */
 export function initializeLogger(): BrowserLogger {
-  if (loggerInstance) {
+  if (true) {
     return loggerInstance;
   }

[NoCoverage] BlockStatement
src/lib/logger.ts:40:59
   // Simple console-based logger for browser
   loggerInstance = {
     debug: (message: string, metadata?: LogMetadata) => {
-      if (config.logLevel === 'debug' || isDevelopment()) {
-        console.debug(`[DEBUG] ${message}`, metadata || {});
-      }
+      if (config.logLevel === 'debug' || isDevelopment()) {}
     },
     info: (message: string, metadata?: LogMetadata) => {

[NoCoverage] ConditionalExpression
src/lib/logger.ts:45:41
       }
     },
     info: (message: string, metadata?: LogMetadata) => {
-      console.info(`[INFO] ${message}`, metadata || {});
+      console.info(`[INFO] ${message}`, false);
     },
     warn: (message: string, metadata?: LogMetadata) => {

[NoCoverage] LogicalOperator
src/lib/logger.ts:48:41
       console.info(`[INFO] ${message}`, metadata || {});
     },
     warn: (message: string, metadata?: LogMetadata) => {
-      console.warn(`[WARN] ${message}`, metadata || {});
+      console.warn(`[WARN] ${message}`, metadata && {});
     },
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => {

[NoCoverage] ConditionalExpression
src/lib/logger.ts:55:7
     },
   };
 
-  if (isDevelopment()) {
+  if (false) {
     console.log('[Logger] Logger initialized for browser environment', {
       level: config.logLevel,

[NoCoverage] ConditionalExpression
src/lib/logger.ts:70:7
  * Automatically initializes if not already done
  */
 export function getLogger(): BrowserLogger {
-  if (!loggerInstance) {
+  if (false) {
     return initializeLogger();
   }

[NoCoverage] StringLiteral
src/lib/logger.ts:105:20
   url: string,
   metadata?: LogMetadata,
 ): void {
-  getLogger().info(`API Request: ${method} ${url}`, {
+  getLogger().info(``, {
     ...metadata,
     method,

[NoCoverage] ConditionalExpression
src/lib/logger.ts:125:17
   duration: number,
   metadata?: LogMetadata,
 ): void {
-  const level = status >= 400 ? 'error' : 'info';
+  const level = true ? 'error' : 'info';
   const logger = getLogger();
 

[NoCoverage] ConditionalExpression
src/lib/logger.ts:138:7
     type: 'api_response',
   };
 
-  if (level === 'error') {
+  if (true) {
     logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
   } else {

[NoCoverage] BlockStatement
src/lib/logger.ts:138:26
     type: 'api_response',
   };
 
-  if (level === 'error') {
-    logger.error(`API Response: ${method} ${url} ${status}`, undefined, logData);
-  } else {
+  if (level === 'error') {} else {
     logger.info(`API Response: ${method} ${url} ${status}`, logData);
   }

[NoCoverage] StringLiteral
src/lib/logger.ts:154:21
   error: Error | unknown,
   metadata?: LogMetadata,
 ): void {
-  getLogger().error(`API Error: ${method} ${url}`, error, {
+  getLogger().error(``, error, {
     ...metadata,
     method,

[NoCoverage] StringLiteral
src/lib/logger.ts:171:20
   action: string,
   metadata?: LogMetadata,
 ): void {
-  getLogger().info(`User Action: ${action}`, {
+  getLogger().info(``, {
     ...metadata,
     action,

[NoCoverage] StringLiteral
src/lib/logger.ts:174:11
   getLogger().info(`User Action: ${action}`, {
     ...metadata,
     action,
-    type: 'user_action',
+    type: "",
   });
 }

[NoCoverage] ObjectLiteral
src/lib/logger.ts:194:43
  * Should be called after authentication
  */
 export function setLoggerUserId(userId: string): void {
-  logInfo('User context set for logging', { userId });
+  logInfo('User context set for logging', {});
 }
 

[NoCoverage] ObjectLiteral
src/lib/logger.ts:204:79
 export function createChildLogger(context: LogMetadata): BrowserLogger {
   const logger = getLogger();
   return {
-    debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
+    debug: (message: string, metadata?: LogMetadata) => logger.debug(message, {}),
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),

[NoCoverage] ObjectLiteral
src/lib/logger.ts:205:77
   const logger = getLogger();
   return {
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
-    info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
+    info: (message: string, metadata?: LogMetadata) => logger.info(message, {}),
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
     error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),

[NoCoverage] ObjectLiteral
src/lib/logger.ts:207:111
     debug: (message: string, metadata?: LogMetadata) => logger.debug(message, { ...context, ...metadata }),
     info: (message: string, metadata?: LogMetadata) => logger.info(message, { ...context, ...metadata }),
     warn: (message: string, metadata?: LogMetadata) => logger.warn(message, { ...context, ...metadata }),
-    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, { ...context, ...metadata }),
+    error: (message: string, error?: Error | unknown, metadata?: LogMetadata) => logger.error(message, error, {}),
   };
 }
