[NoCoverage] ConditionalExpression
src/middleware.ts:46:7
   }
 
   // Add correlation ID to response headers
-  if (response) {
+  if (true) {
     response.headers.set('X-Correlation-ID', correlationId);
   }
