[NoCoverage] LogicalOperator
src/providers/feature-flag-provider.tsx:158:7
   const currentEnvironment = useEnvironment();
   const isAllowed = environments.includes(currentEnvironment);
 
-  if (!isAllowed && fallback) {
+  if (!isAllowed || fallback) {
     return <>{fallback}</>;
   }
